[
    {
        "postid": 4562,
        "date": "2019-09-02 01:29:42",
        "content": "My parents were redesigning their kitchen when this happened ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4563,
        "date": "2019-09-02 01:45:02",
        "content": "I'm mean ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4567,
        "date": "2019-09-04 05:16:33",
        "content": "I'm not okay I honestly wish that I were just not aware of other people and their relationships. I wish that people didn't take my kindness towards strangers and others as naivety and immaturity.  I wish that people wouldn't hurt others. I wish that people would stop hurting me. I wish people would stop lying. I wish people would fix their problems. I wish more people went to therapy.   I wish someone in this world actually liked me. I wish someone wanted to hold my hand and hold me in bed. I wish someone would look at me like I was the world to them and they would be damn sorry if they lost that world. I wish that I will stop having one sided conversations on dating apps.  I wish that I didn't have these thoughts. I wish that I want to make my life worth living. I wish that I didn't wish I were dead.",
        "label": [
            "S"
        ]
    },
    {
        "postid": 4569,
        "date": "2019-09-05 05:12:27",
        "content": "[HELP!] Calling All Animal Fosters from around the Orange County area! I am in desperate need of some help right now.      I have recently found a bundle of 7 or so kittens hanging around a dangerous abandoned lot with ages ranging from 2 to 7 months.   Since finding them, I have started to feed and water them in the hopes that one of them will trust me enough to get close to me. My initial plan was TNR but, due to the fact that they're young, I want them to have a better future in a home with a loving family.      I unfortunately cannot be that person since the place I live in right now does not allow animals and I am not staying in California forever. I've tried contacting different TNR and foster programs for some help or assistance during the matter but most places are already full or have too many projects to take care of.  I'm a poor college girl but I want to try my best to get these cats a better life out of that lot...  Would anyone be willing to help me or give me some advice on what to do? I'm desperate.",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4573,
        "date": "2019-09-08 22:25:04",
        "content": "I think I need to work on my self esteem... So I went on a date recently and I actually, for the first time in a couple years, had a really great time.   I was relaxed, I was myself and we seemed to hit it off pretty well, I thought.  I sent him a text after he dropped me off saying that I had a good time and that I really wanted to hang out with him again when he was free.  He didn't really respond and now I'm doubting myself thinking I already messed something up. He could've been busy with work or something but my anxiety is telling me that I'm annoying him and that I should stop thinking about that second date.  My roommates and friends say I should just relax. Idk... how do I help better myself whenever I feel this way?",
        "label": [
            "S"
        ]
    },
    {
        "postid": 4574,
        "date": "2019-09-09 21:18:38",
        "content": "Are there any Orange County cat foster homes that are willing to help find these babies a home? Please? ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4575,
        "date": "2019-09-10 02:17:40",
        "content": "I found a couple of cats near a dangerous hobo hangout and I've tried calling fostering and shelter agencies but no one will take them. Will someone help me find them good homes? ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4580,
        "date": "2019-09-11 21:11:33",
        "content": "I found these 7 cats near an abandoned lot and I haven't had much success in getting TNR specialists to help me out with trapping them. Are there any TNR specialists to help me out with them? ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4700,
        "date": "2019-10-01 17:55:11",
        "content": "I'm not your relationship therapist I am especially not going to give you relationship advice if YOU COMPLETELY IGNORE IT",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4707,
        "date": "2019-10-02 21:18:26",
        "content": "When the doctors said that my pills would make my depression worse... they weren't kidding I feel like the world, as of now, is full of nothing but drama and lies and cheats. I have nothing ahead of me. I have one more year left of college and then what? Struggling financially until the world caves in on itself?  Will everyone I meet just be manipulative attention seekers and only take advantage of the kindness or interest I've showed them?   I have nothing to look forward to; I have no opportunities in business and in love. Why do I even try.  Maybe I'm better off living alone.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4708,
        "date": "2019-10-02 21:38:50",
        "content": "I should probably tell my therapist I've had thoughts of hurting myself Rough week. Rough life, whatever. I feel like I have nothing and no one to bring happiness to my life.      Hell, I work at the fucking *happiest place on earth* and I still can't get out of bed and take my pills at a decent time.      Some people might think, \"Oh, but you're at the theme park of everyone's dreams! You have loving friends and family and a start of a promising career! You shouldn't be sad. People out there have it worse!\"   &amp;#x200B;  I haven't reached the point of actually hurting myself but one failed relationship has almost brought me to that point. I'm not going to be good enough for anyone. People will use me, my parents will be disappointed in me, I haven't got the money to live on my own anywhere. I couldn't even afford to feed myself some days!  &amp;#x200B;  How in the hell am I supposed to live in a world that wants lower class citizens like me to fail?",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4766,
        "date": "2019-10-09 16:03:37",
        "content": "My sister caught my son mid yawn. This never fails to make me laugh ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4821,
        "date": "2019-10-13 15:59:12",
        "content": "Spidey and I said that super suits should come with pockets ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4929,
        "date": "2019-10-21 18:38:25",
        "content": "This lowkey became viral in my work group so I thought I'd share it here ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5028,
        "date": "2019-10-28 16:54:14",
        "content": "[Self] I think Carol liked my authentic aviator jacket ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5064,
        "date": "2019-10-31 23:12:28",
        "content": "You could say my sister is strange and unusual ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5065,
        "date": "2019-10-31 23:19:56",
        "content": "[Photographer] my sister is strange and unusual this Halloween ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5066,
        "date": "2019-10-31 23:20:30",
        "content": "[Photographer] my sister is strange and unusual this Halloween ",
        "label": [
            "0"
        ]
    }
]