[
    {
        "postid": 4813,
        "date": "2019-10-12 09:51:20",
        "content": "If a genie appeared and granted you three wishes what would it be? mine would be  1. to die peacefully in my sleep  2. let my family live a life with success and happiness 3. free the genie from his misery (you’ll understand this one if you watched Aladdin)",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4818,
        "date": "2019-10-13 08:03:19",
        "content": "I’m going to bed now I can’t imagine myself alive next year. Should I just give up on school and everything else right now because I know I’m going to die anyways. Not sure what I should do",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4872,
        "date": "2019-10-18 07:23:48",
        "content": "I’m so freakin scared to go to school tomorrow I haven’t been to school in two days. First absent was because I was too scared to go but I did go the next day but then ended up being taken to the hospital after telling my counselor about my mental health.   The doctor wrote a note to the school about my mental illnesses and to give me extension dates for homework but I’m scared the teachers will think it’s an excuse to not do it or something. I’m also scared to see my classmates and be in a place where everyone knows who I am. The thought of walking in the classroom and being in the hallway makes me panic already but actually having to be there makes me even more nervous. Writing it here makes it seem like a small issue. I don’t know I’m just scared.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4873,
        "date": "2019-10-18 07:56:51",
        "content": "what I wish I could say to my parents I’m not lazy. I have depression and anxiety and doctors literally told you the other day. Everything is hard for me right now. Even the things you’re supposed do daily takes too much energy to do. I hope you can stop prioritizing school but me instead for a little while so I can heal. My thoughts are not silly or a teenage phase either and taking antidepressants won’t cure everything immediately. I know you guys keep telling me other people have it worse than me but I can’t help feeling like this. You made me promise you that I would go to school tomorrow but I honestly don’t think I can. I’m too scared to and thought of it makes me want to die. So please shut up about school just for a little while, please. I’m sorry for being such a disappoint.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4874,
        "date": "2019-10-18 09:10:58",
        "content": "what is this feeling I’m feeling rn ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4875,
        "date": "2019-10-18 09:24:46",
        "content": "lololol ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4876,
        "date": "2019-10-18 10:45:21",
        "content": "imagine taking a bite out of that ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4877,
        "date": "2019-10-18 17:34:55",
        "content": "aww ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4878,
        "date": "2019-10-18 20:05:24",
        "content": "master oogway ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4879,
        "date": "2019-10-18 20:18:25",
        "content": "OHH ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4890,
        "date": "2019-10-19 08:05:27",
        "content": "woah there ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4904,
        "date": "2019-10-20 04:27:49",
        "content": "I could never ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4905,
        "date": "2019-10-20 04:37:30",
        "content": "lmao ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4924,
        "date": "2019-10-21 06:03:37",
        "content": "what I wish I could say to my parents I’m not lazy. I have depression and anxiety and doctors literally told you the other day. Everything is hard for me right now. Even the things you’re supposed do daily takes too much energy to do. I hope you can stop prioritizing school but me instead for a little while so I can heal. My thoughts are not silly or a teenage phase either and taking antidepressants won’t cure everything immediately. I know you guys keep telling me other people have it worse than me but I can’t help feeling like this. You made me promise you that I would go to school tomorrow but I honestly don’t think I can. I’m too scared to and thought of it makes me want to die. I really do try to build up courage to go the night before but when the time comes I get really scared so please shut up about school just for a little while, please. I’m sorry for being such a disappoint.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4928,
        "date": "2019-10-21 15:17:53",
        "content": "yep ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4931,
        "date": "2019-10-21 20:44:01",
        "content": "coach of the year ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4932,
        "date": "2019-10-21 20:45:54",
        "content": "haha ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4935,
        "date": "2019-10-21 22:09:34",
        "content": "If we remove all laws then the crime rate would be 0% ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5025,
        "date": "2019-10-28 06:04:53",
        "content": "My doctor prescribed me sleeping medication :D My doctor told my parents to hide the medicine we have at home because I might try to overdose on them so sleeping pills is the only medication I have access to. Can’t wait to try to overdose on them",
        "label": [
            "E"
        ]
    },
    {
        "postid": 5038,
        "date": "2019-10-29 08:29:00",
        "content": "Frickk im so freakin scared to go to school tomorrow but it’s gonna be okay I can do it hopefully I can do this yep I can okokok I will I have to im gonna go for sure I know I can everything will be fine ",
        "label": [
            "E"
        ]
    },
    {
        "postid": 5039,
        "date": "2019-10-29 09:20:05",
        "content": "Why do strangers want me to be alive? Idk it’s weird that strangers care more than the people I know. It’s also weird to me how people have jobs dedicated to help people going through tough times. It’s got nothing to do with them",
        "label": [
            "E"
        ]
    },
    {
        "postid": 5158,
        "date": "2019-11-06 07:10:03",
        "content": "Y’all my mom is hilarious she said “just be happy why are u like this everyone wants to be friends with you” lol okay mom I’ll do just that. after knowing about my suicide attempts she said “you’re such a good girl y would u do that” omg I’m a good girl? Thanks 4 telling me I won’t try to die anymor [removed]",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5262,
        "date": "2019-11-13 11:11:09",
        "content": "An interesting title My mom is like you’re just depressed because you overthink too much. If you didn’t isolate yourself from everyone and eat more than maybe you’ll be happier. My depression is making me isolate myself and not eat mom. Also how the hell do I stop my brain from overthinking",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5330,
        "date": "2019-11-18 10:09:51",
        "content": "People who don’t have anyone to eat lunch at school with where do you go? I don’t have anyone to eat with so I just go home but I’m tired of having to walk home everyday since our lunch break is only 40mins and it takes around 7mins to walk home and back. Any ideas where else I could eat lunch",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5488,
        "date": "2019-12-03 08:59:28",
        "content": "We’re all just suicidal people telling other suicidal people that suicide isn’t this answer on this sub ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5502,
        "date": "2019-12-05 12:50:33",
        "content": "felt like the psychiatrist was judging me because I told her I’ve tried to commit suicide 2 times She asked me a series of questions and then asked how many times have I tried to commit suicide and I said two. She repeated back “two?” and I said yeah. The tone she said it in sounded like “pft only twice that’s so less” if you know what I mean. I could be remembering it wrong but I’ve been thinking about it since the meeting. Is being suicidal for 2 years and only attempting it twice weird?",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5509,
        "date": "2019-12-06 06:54:31",
        "content": "Will I get suspended for not going to school? I’m currently in 9th grade. I’ve been diagnosed with depression and anxiety and the school knows about it. I’ve been trying to avoid school and only went to school once every week for the pass few weeks. The counselor let me drop some classes but I’m still not going. Am I going to be suspended?",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5510,
        "date": "2019-12-06 08:59:33",
        "content": "where’s the rest of the gang ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5520,
        "date": "2019-12-07 10:41:13",
        "content": "I need a serotonin army ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5521,
        "date": "2019-12-07 10:41:19",
        "content": "I need a serotonin army ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5522,
        "date": "2019-12-07 10:41:59",
        "content": "I need a serotonin army ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5543,
        "date": "2019-12-09 10:31:48",
        "content": "true dat ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 5544,
        "date": "2019-12-09 10:40:11",
        "content": "just shoot me and then leave ",
        "label": [
            "0"
        ]
    }
]