[
    {
        "postid": "2356521",
        "date": "2015-10-02 14:46:03.020000",
        "mood": "None",
        "n_replies": "3",
        "content": "Seeing him again today, I'm not sure how to act tbh.  To forgive or forget or not at all?  To kiss him immediately or not?  I'm very goddamn nervous and I look terrible",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2356534",
        "date": "2015-10-02 14:52:45.207000",
        "mood": "None",
        "n_replies": "7",
        "content": "Rant: ignore i guess I have maybe attended 25 days of school in the past year, if not less.  No wonder I can't get anything higher than C's when it comes to math and dutch. My english has also gotten so much worse, and it annoys the hell out of me.  I have no idea how I passed last year without attending buy I don't think I can pass this year even if I do manage to go regularly again.  Which means more years of school.  I should probably go a level lower, but that would make my chance to get into college a lot less and I really just want to go.  Plus I get bored so easily when I already know things and I'll start to overthink.  I don't know what to do.",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2361859",
        "date": "2015-10-04 18:51:00.963000",
        "mood": "None",
        "n_replies": "3",
        "content": "this is the best birthday ever and I'm happy",
        "label": [
            "ISB"
        ]
    },
    {
        "postid": "2361887",
        "date": "2015-10-04 19:12:10.377000",
        "mood": "None",
        "n_replies": "0",
        "content": "I need to win the lottery so I can travel and see him more often because I already miss him like hell",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2363840",
        "date": "2015-10-05 14:17:14.243000",
        "mood": "None",
        "n_replies": "1",
        "content": "New school, new year, new chances.  I won't hang with the wrong crowd this time. I'm fine with just being the quiet girl that reads books in her break.  School is just something I'll have to survive.   The question is how",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2368199",
        "date": "2015-10-07 14:39:00.780000",
        "mood": "None",
        "n_replies": "4",
        "content": "Is it really that impossible to like me?",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2368351",
        "date": "2015-10-07 16:39:00.580000",
        "mood": "None",
        "n_replies": "1",
        "content": "school is terrible  it's a box, your feet touch the ground, and the roof is just above your head. there's a set time, and place, and date for everything. the work you have to do. there's a set agenda for everything.  and there is no room for mistakes, or flaws.  and you learn from those things.  there's no space, no room to grow in, to get better. there's no room for moving or struggling.  there's no space for me, i'm trapped.  i don't really fit in. i can't concentrate.  i can't handle the old boring routine, i'm not stable.  i have ups and downs, and i'm being pushed down, instead of getting helped up.  i can't pretend to be perfect everyday, but i'm expected to do so. i don't fit in, but i'm trapped.",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2368484",
        "date": "2015-10-07 18:08:21.383000",
        "mood": "None",
        "n_replies": "2",
        "content": "i have acne  my nose is too wide  my lips are too thin  I'm too small  my eyes aren't big enough  my eyebrows are huge  my face is chubby  my hair is terrible  my arms are covered in scars  my boobs aren't big enough  my butt is too big  my legs are too fat  my stomach isn't that flat  my feet are weird  my ears are too small  my fingers are short and fat  there's nothing to like about me  :-))",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2368528",
        "date": "2015-10-07 18:39:00.553000",
        "mood": "None",
        "n_replies": "3",
        "content": "#poetry  might be a little triggering so yeah   are you sad  sad like me?  don't you feel like  death will set us free?  is your soul, too,  ripped apart?  does it feel numb like my empty heart? do you carry sorrows  as dark as the night?  are you still trying?  or did you lose this fight?",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2368548",
        "date": "2015-10-07 18:51:58.400000",
        "mood": "None",
        "n_replies": "9",
        "content": "i'm a little lost  and a little sad  a little girl just searching  feeling like she's gone mad",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2370735",
        "date": "2015-10-08 19:06:14.273000",
        "mood": "None",
        "n_replies": "3",
        "content": "no no no no no  please don't leave me",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2371921",
        "date": "2015-10-09 05:42:17.857000",
        "mood": "None",
        "n_replies": "0",
        "content": "Is it worth it?  Missing him everyday, craving him and love, and waiting to see him again for months.  Just to see each other for two days, and then to leave again and feel worse than before.",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2372577",
        "date": "2015-10-09 17:30:45.050000",
        "mood": "None",
        "n_replies": "0",
        "content": "I'm pretty sure you are using me  Pretty certain you will leave  But can we just play games until that day has arrived?  can you just kiss me  and pretend that you miss me  Because I really really will be lost without you  And I know you're using me  But you're all I have",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2372602",
        "date": "2015-10-09 17:45:24.317000",
        "mood": "None",
        "n_replies": "15",
        "content": "Comment for a compliment postive small post thingy",
        "label": [
            "ISB"
        ]
    },
    {
        "postid": "2372608",
        "date": "2015-10-09 17:51:01.027000",
        "mood": "None",
        "n_replies": "1",
        "content": "@user_\"230485\" You seem to be a very caring, loving & intelligent girl I haven't seen you around much, so I don't think I could do you justice with this post  But I'm sure you're a beautiful person",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372614",
        "date": "2015-10-09 17:53:59.113000",
        "mood": "None",
        "n_replies": "6",
        "content": "@user_\"28188\"  Your will is my demand, Queen Emo  In all seriousness, I think you're very extremely gorgeous, honestly beautiful.  And you have one of the best  personalities on here, it seems. You're honesty is refreshing and wow, you have common sense So uh you're pretty great and you're my fellow emo ❤️",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372624",
        "date": "2015-10-09 17:58:12.377000",
        "mood": "None",
        "n_replies": "1",
        "content": "@user_\"200249\"  aw you're so cute, your face is so beautiful  You're very sweet and amazing and extremely strong Kik me if you want to talk  Don't ever change okay, just become happier 💓",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372627",
        "date": "2015-10-09 18:03:00.870000",
        "mood": "None",
        "n_replies": "1",
        "content": "@user_\"63543\" You're so beautiful I'm honestly jealous",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372744",
        "date": "2015-10-09 19:17:11.693000",
        "mood": "None",
        "n_replies": "1",
        "content": "@user_\"224854\" you're very beautiful and I love your hair.  you have your own opinion and that's great, it's important to think for yourself.  It's a risk, because lost of people might not agree with you, but it shows bravery. That's pretty much the most important quality to have, it's individuality and intelligence. Be proud of yourself . You're great.",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372749",
        "date": "2015-10-09 19:19:13.867000",
        "mood": "None",
        "n_replies": "0",
        "content": "@user_\"168762\" you're absolutely stunning & I believe in you.  Your strength shows through everything you say.  You're lovely.  I hope you realise that",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372762",
        "date": "2015-10-09 19:24:12.037000",
        "mood": "None",
        "n_replies": "0",
        "content": "@user_\"230316\" You're so stunning holy god",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372757",
        "date": "2015-10-09 19:27:00.893000",
        "mood": "None",
        "n_replies": "1",
        "content": "@user_\"224586\" You're so beautiful and likeable. How could you not see that?!",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372778",
        "date": "2015-10-09 19:27:23.460000",
        "mood": "None",
        "n_replies": "0",
        "content": "@user_\"192454\" Your looks are unbelievably close to perfection  Your personality.. is just amazing. You're so so so great, I can't explain it.  I appreciate you",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372786",
        "date": "2015-10-09 19:29:15.740000",
        "mood": "None",
        "n_replies": "2",
        "content": "@user_\"90673\" you're basically my favourite person and I miss how close we used to be  I love you  You're beautiful",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372793",
        "date": "2015-10-09 19:32:50.147000",
        "mood": "None",
        "n_replies": "1",
        "content": "@user_\"230375\" You're great  You're so cute aw  And much badass  You're appreciated 👌💗 take good care of yourself",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372811",
        "date": "2015-10-09 19:41:06.740000",
        "mood": "None",
        "n_replies": "1",
        "content": "@user_\"219553\" you're very great and you look very great and I think you're very cool",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372820",
        "date": "2015-10-09 19:44:09.913000",
        "mood": "None",
        "n_replies": "1",
        "content": "@user_\"143960\" you're awesome and beautiful  keep trying  You're well on your way",
        "label": [
            "IS"
        ]
    },
    {
        "postid": "2372831",
        "date": "2015-10-09 19:48:57.553000",
        "mood": "None",
        "n_replies": "4",
        "content": "people on TL: your hair is so pretty!  people in real life:  what the hell is that birds' nest on your head?",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2372930",
        "date": "2015-10-09 20:33:34.867000",
        "mood": "None",
        "n_replies": "0",
        "content": "I feel so numb",
        "label": [
            "IE"
        ]
    },
    {
        "postid": "2374241",
        "date": "2015-10-10 13:09:57.693000",
        "mood": "None",
        "n_replies": "10",
        "content": "I'm so unbelievably lonely  I have no one  No one cares about me anymore  Am I really that unlikable? Am I just hopeless?  What did I do wrong? I'm so lost and alone",
        "label": [
            "IE"
        ]
    },
    {
        "postid": "2374776",
        "date": "2015-10-10 19:33:14.597000",
        "mood": "None",
        "n_replies": "0",
        "content": "every inch of my mind is full of this nothingness i'm alone and all that's left is emptiness i'm just numb  lost  alone  hopeless",
        "label": [
            "IE"
        ]
    },
    {
        "postid": "2374782",
        "date": "2015-10-10 19:39:00.790000",
        "mood": "None",
        "n_replies": "1",
        "content": "all these weird urges and the desire to kill myself :-)",
        "label": [
            "IEP"
        ]
    },
    {
        "postid": "2374857",
        "date": "2015-10-10 20:25:57.877000",
        "mood": "None",
        "n_replies": "1",
        "content": "need to stop eating",
        "label": [
            "IE"
        ]
    },
    {
        "postid": "2376102",
        "date": "2015-10-11 08:55:20.743000",
        "mood": "None",
        "n_replies": "1",
        "content": "i relapsed and i hate myself  i've been clean for so long and i really don't him to know so i guess i won't be seeing him anytime soon, like i wanted to..",
        "label": [
            "IE"
        ]
    },
    {
        "postid": "2376162",
        "date": "2015-10-11 10:16:37.667000",
        "mood": "None",
        "n_replies": "4",
        "content": "I hate myself for relapsing",
        "label": [
            "IEP"
        ]
    },
    {
        "postid": "2376614",
        "date": "2015-10-11 16:32:06.227000",
        "mood": "None",
        "n_replies": "0",
        "content": "#thebandstag    Name? Evi  Age: (optional) 16  10 Top favorite bands: •La Dispute •Cage the Elephant •Arctic Monkeys  •Nirvana •Being Me The Horizon  •The Front Bottoms  •Of Mice and Men •The 1975 •Pierce the Veil  •The pretty reckless   Favorite singer:    First band you ever listened to: ARctic Monkeys because father   Do you get judged for your music taste? well i don't really care",
        "label": [
            "0"
        ]
    },
    {
        "postid": "2381574",
        "date": "2015-10-13 19:05:30.647000",
        "mood": "None",
        "n_replies": "4",
        "content": "I'm a  sad  sad  sad  waste of space  waste of blood  I'm just me me  me nothing special nothing good  I'm just me  same sad me  but I'm trying  can't you see? and I'm lost  a little blind  but I'll keep searching until I find  what  I'm  looking  for",
        "label": [
            "IEP"
        ]
    },
    {
        "postid": "2381675",
        "date": "2015-10-13 19:51:00.077000",
        "mood": "None",
        "n_replies": "0",
        "content": "depression will be the death of me",
        "label": [
            "IEP"
        ]
    },
    {
        "postid": "2383356",
        "date": "2015-10-14 12:15:00.110000",
        "mood": "None",
        "n_replies": "3",
        "content": "I'm going to delete this app my phone, and I will probably be a lot less active.  I'll also be deleting kik.  I feel like both of these things are only dragging me down and making me feel less lonely.  I wish all of you the best of luck.  And thanks to anyone who's been there for me, even though most of us have lost contact. I still appreciated/loved you a lot   so yeah  I won't be on here (much) anymore  Bye 💓",
        "label": [
            "0"
        ]
    }
]