[
    {
        "postid": 4735,
        "date": "2019-10-06 10:42:36",
        "content": "A heart’s a heavy burden. I’m at this point in my life currently where I’m somehow stuck between feeling the ache of everything, and not feeling anything at all. I was taught from a young age that the “only” way to cope with all the hurt is to flip the switch and turn it off - and now all the switches and wires feel flipped and intertwined and I can’t make sense of a single damn thing.  It’s hard to talk to people about the mess of emotions I feel, or the jumbled thoughts I have. I know people care about me, at least some of the time, but not enough for me to feel okay with talking about the things that keep me up at night. It’s a really lonely, isolating feeling to have. But god, I wish anyone cared more than the bare minimum. Enough to reach inside my chest and rip the hurt right from the comfortable place it rests, covered up by all the excuses and lies I use just to make it through each day.  There’s so much that’s happened this year, so much I’ve let people get away with because my heart is just a little too big for blame and anger to hold onto. I’m so drained though, and I’m so sick of making myself feel small in hopes I’ll fit into people’s lives. And I’m scared, because it hasn’t gotten any better. I don’t know if it will.  Writing all of this is pretty pointless, but at least if you tell it to the void, the void can’t talk back and tell you to suck it up or stop complaining.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4794,
        "date": "2019-10-11 05:39:48",
        "content": "Feeling like a waste of space. Every time I go to make a post here I get annoyed with myself because honestly, who fucking cares lol. But I'm just drained and need an outlet to vent so here I am yet again.  I know everyone moves through life at different paces, and not everything is as good as it seems, even for people who are more fortunate than others. Even still, I feel like I'm not where I'm meant to be at all and it's slowly killing me. So many people I know are getting their shit together - getting in happy relationships and starting families, having their own homes, and living their best lives. And I know I shouldn't be so worried about that stuff at 23, but fuck. I've been dealt shitty cards from the start and I'm sick of not having anything good for myself. I'm sick of feeling like a shadow in this world.  On top of that, I'm getting increasingly lonely, and usually I can control this feeling and not let it get to me but we all know the role depression plays in making you feel isolated. It's so hard to make friends though. Every time I open up to  someone, or try to build a connection with them, in the end I'm not good enough and they leave. I've stopped reaching out to people because I'm so sick of that cycle repeating. I don't want to keep opening up my heart to people just for them to crush it.  In conclusion, people suck and so does life.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4812,
        "date": "2019-10-12 08:11:43",
        "content": "Breaking point. I don’t have anyone I can talk to about this. I try to go to people, try to open up to them, put myself in a vulnerable place and all it ever does is fuck me over and make the hurt of everything that much worse.  I feel sick to my stomach with guilt for feeling this way. My best friend lost someone she loved unexpectedly earlier this year, and I don’t want her to lose another, but it’s all I can feel and think about lately.  I’ve tried to make good changes in my life. I’ve gone to therapy. I went back to school. I tried making friends. I tried dating. In the end, nothing is enough. I’m not enough. There’s always something wrong, either with me or the timing and circumstances.  My heart feels shattered and I feel beside myself with it all. I don’t see the point anymore. I’m never going to have that life I dreamed of. I never asked for much. I just wanted something good to happen. I wanted to be good enough, deserving enough. But I have nothing and no one. Just this ache that won’t go away.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4902,
        "date": "2019-10-20 01:46:18",
        "content": "drained. i don’t really have the words right now for how i feel, except that it’s miserable. i don’t have anything or anyone to keep me going anymore, and i’m still hung up over someone who couldn’t care less if i was alive or dead. i’m trying to keep my shit together because my best friend needs me, but i’m just tired and things have only been getting worse. i don’t think i’ll be here come next year and i feel sick at the thought.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 4963,
        "date": "2019-10-23 22:38:05",
        "content": "Hitting like a train today. We haven't spoken in several months, and it's not really getting any easier. It comes and goes in waves, and it hits hard when I least expect it. Today I gave that new song \"If The World Was Ending\" a listen and it shattered me on the spot; it's that easy for me to spiral into missing him, and I hate it.  I hate that I still miss him - not even romantically (okay maybe a little), but overall, his friendship and his presence in my life. It's such a shitty feeling to have the door slammed on you, so to speak. I know that closure is a tricky construct, and that sometimes you have to make it for yourself, but I'm really struggling in that regard. I truly feel like this is something I'll carry with me to my grave, and that eats away at me.  This month has been a real struggle overall. This time last year was the last time we were okay, before things completely broke apart. I broke contact and tried reaching out to him a couple of weeks ago, which was stupid of me and I know that, and he made it pretty clear he has no interest in ever speaking again. I know in the end it's for the best, but right now it's miserable and I wish I could turn back time.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 5089,
        "date": "2019-11-02 07:57:18",
        "content": "This is killing me. I was looking through our old Discord chat *(stupid, I know),* and it just... kills me. He was by far the most supportive person in my life for all the months we were together. Not even my best friend comes close to being as sincere and sweet as he was. No one has ever made me feel even a fraction of the way he did.   Any new ideas I had, he encouraged me and gave input. If I was feeling down or sick, he'd stream cartoons for us to watch together until I felt better. He always sent me new songs because he knew I'd be stubborn and play old ones on repeat all day otherwise. He sent the best damn memes and made me laugh more than anyone ever did. And when we called, it was always so comfortable and we'd talk for ages about every little thing. He never complained if I babbled on like an idiot.  This is fucking me up and I can't get past it at all. I don't know what to do. I always just cry it out and then sleep it off, but the cycle repeats and I'm growing weaker. When he left he said I'd find someone like him again, but God, there's only one him and I can never get that back.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 5103,
        "date": "2019-11-03 06:41:08",
        "content": "Miserable and guilty. My best friend’s birthday is tomorrow and all I can think about is how badly I want to end my life, but I can’t because I can’t do that to her.  I feel so empty and beside myself.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 5127,
        "date": "2019-11-04 09:15:38",
        "content": "I hate it more than anything. I’m so sick of having to pretend I’m okay because it’s more convenient for everyone around me. “You seem better” is the biggest load of shit. I’m not better, I’m so far from it. I’ve just gotten better at making you think I’m okay, because then I don’t have to hear that I’m being difficult or stupid or irrational.  I just want to leave this fucked up world behind. I’m over it all.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 5174,
        "date": "2019-11-07 05:47:48",
        "content": "It’s never going to get better is it? Every single day is the same. I can go out and convince everyone, including myself, that I’m okay. But then I come home and the heavy feelings set in and I fall apart.  I’ve been losing sleep because my mind won’t shut off. I just keep thinking about how much better things were before, but then questioning if they were ever really better at all.  I’m tired of falling apart every night and having to put myself back together every morning. I’m tired of being around people who have better lives than me. I’m tired of being bitter and angry at the world.  I want to die, but I don’t. I want everything to stop, but it isn’t. I want things to change, but they haven’t.  I just want to feel safe again.",
        "label": [
            "E"
        ]
    },
    {
        "postid": 5347,
        "date": "2019-11-19 05:31:26",
        "content": "It’s getting worse. I realized today that his birthday’s coming up in a few weeks, which really puts into perspective how much time has passed since we were last okay. Before everything crashed and burned. I’ve been numb this whole year, just floating through time because reality is miserable and I can’t face it, but I’m starting to more and more lately and I’m miserable for it.  Holidays and family events were always the worst for him, for both of us really. I miss how we’d help each other through it, being the strength for each other that we needed. All I feel now is weak, like a fragile shell of a girl I used to be.  There’s so much I wish I could say to him. Losing the opportunity to spend my life with him is painful, but nothing beats the pain of losing the friendship we had. He was my very best friend and I’ll never get that back, and it kills me every god damn day. I’ll never feel that good or whole again.  I don’t think time is healing anything.",
        "label": [
            "E"
        ]
    }
]