[
    {
        "postid": 1458,
        "date": "2015-01-22 14:18:19",
        "content": "Assorted lithuanian fatlogic, featuring contradictions, \"don't count calories\", \"exercise less\" and good ol' starvation mode ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 1463,
        "date": "2015-01-23 00:42:04",
        "content": "[Rant] I have trouble leaving the house. When I do, people assume I am something that I hate. So, for some backstory - I've had depression, avoidance and anxiety for about 12 years now. It completely ruined my life; I dropped out of education, I'm unable to work, I have 0 friends in real life and human interaction terrifies or even disgusts me. Being in a crowded place could make me cry. I would stay in my flat for months, just getting groceries every now and then, rarely ever cleaning up after myself and sinking into the internet for distraction, so I wouldn't have to feel anything.   The last year has been the first that I actually felt like I'm getting better. I'm being treated medically and with therapy, I am no longer completely lonely and I have been making efforts to do things, even ones I don't like. I have been leaving the house.   However, I moved. I got into a really bad place for the first few months and shelled in again, but now I got used to my new temporary home and environment. However, going out is much, much harder.  I'm in Israel right now, so I stand out a bit as a pale, tall northern european girl. People stare at me. There have been cases when they actually made remarks about how pale I am, that I look like a freak and a snob. But that's not the worst part.  Whenever I go to a new restaurant or other place where you are catered to by other people, they assume that I'm russian. Now, that might not seem like a big deal, as they don't mean any harm - they see an european looking person and assume that. But it fills me with burning anger and self-disgust.  Russians have killed, raped and mentally scarred people from my country for decades. Several members of my family were killed by them. The same applies to many other european countries and this amount of ignorance is appalling. Our ancestors, language and alphabet, religion and folklore are completely different. I have no russians in my bloodline. There is literally no connection between us other than war, blood and perhaps commerce. Unless you hear a person speaking russian, you shouldn't assume they are and I hate that it's happening to me.   Today, I asked for an English menu. I was instantly asked \"Russian?\" \"no...english\" \"oh, I just assumed, because you know...*waves towards my face*\" in that moment I felt so ashamed, dirty and angry. I wanted to smash my face until it was something else. I wanted to burrow myself into the ground. I wanted to blurt out \"I wonder how you would feel if everyone assumed you were palestinian\" but I just kept quiet with my distilled anger and shame. It wasn't their fault and I shouldn't insult them.  I don't know how to deal with this. I hate this so much. I don't want to deal with this ever again but the fact I have to force myself out means I will have to. Fuck this.",
        "label": [
            "S"
        ]
    },
    {
        "postid": 1482,
        "date": "2015-01-24 16:44:01",
        "content": "Long term girlfriend of a friend killed herself. He wants to follow suit. I've known him through the internet for about 5 years. He's halfway across the globe so there's no way for me to physically meet him.  What should I do? What would you like to be done to you, to consider not dying in such a situation?  I've tried messaging online, texting, replied to his initial post, encouraged others he knows to reach out....but it feels like I'm trying to melt an iceberg with a blowdryer. Useless. Not enough.  I know exactly how it feels to want to die and he doesn't deserve it. She didn't deserve it. It's quite possibly the most excruciating thing one can experience; so strong it makes you go against basic human nature. I feel powerless.",
        "label": [
            "S"
        ]
    },
    {
        "postid": 1484,
        "date": "2015-01-25 16:56:18",
        "content": "Good recipes with sweet chili? + delicious and filling soup recipe for 197 kcal/serving! My fiancee couldn't find the healthy sweet chili he likes, so he got a different one that's almost the same, but the container is huuuuge. We have 0,7 l of chili and I have no clue what to do with it other than the usual sandwich condiment. If you have any recipes, I'd really appreciate them!   Posting one of my favourite soup recipes, super filling and fairly low calorie.  **[Beef and pearl barley soup](http://i.imgur.com/Bi2gtd1.png) (serving - 373 ml)**  **Ingredients**  * 2 tbsp. olive oil * 450g lean beef, cut into cubes * 1 onion * 2 minced garlic cloves * 115g pearl barley, uncooked (I like to soak the barley in water for an hour beforehand, but it's optional) * 2l + 0,7l beef stock (I used bullion cubes, but homemade would be better!) * 3 cut up carrots * 1 big leek stem * 1 big potato, cubed * 1 tbsp. thyme * 1 tbsp oregano * salt &amp; pepper  **Cooking**  1. Add oil to the pan and brown the beef. Put it aside. 1. Add onion + garlic into the same pan and fry until golden 1. Put the onion, pearl barley, beef and 2l stock into a large pot (at least 3,5l capacity) 1. Keep pot on high heat/open until it boils. Then switch to low heat and cover. Cook for 45 min. 1. Add carrots, leek, potato and 0,7l stock. Cook for 15 min or until the vegetables are soft. 1. Add thyme, oregano and salt&amp;pepper. You can skip the salt&amp;pepper if you used bullion cubes. :)  Enjoy!   *[edit] forgot to include serving size.* ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 1525,
        "date": "2015-01-30 07:01:37",
        "content": "I have scoliosis. What exercise should I avoid, if any? ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 1553,
        "date": "2015-02-05 17:05:32",
        "content": "Who needs healthy coping mechanisms when you have cake? ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 1599,
        "date": "2015-02-10 20:00:50",
        "content": "I got trapped in bed over an irrational fear today. I actually woke up in the morning, but I couldn't leave the bed because I was too scared to step on the floor. I ended up trapped for 4 hours until my SO came home and carried me out/gave me shoes.  That's right. *Afraid to step on the floor.*  I allowed it to get pretty dirty and it disgusted me so much I couldn't bring myself to leave the bed without feeling sick in the stomach and close to tears. I felt like it could seep into my skin or that there was something living there. I knew the fear is irrational and nonsensical which added a lovely dose of self disgust over not being able to control it.  I should probably increase my anxiety med dosage but the last time I did it it left me sluggish and disconnected all day. I don't know what to do.",
        "label": [
            "S"
        ]
    },
    {
        "postid": 1755,
        "date": "2015-03-02 17:42:48",
        "content": "[LF][US] LKali and Pandora friends! I have GZL and LKali up most of the time. Both max level, GZL max +egged, kali max skilled. While I have a sea of GZL friends, I have barely any kalis, so more would be very appreciated.   My Pandora team is almost up to speed now, and I'm starting to play her, but there is a severe lack of friends. She is max level and max skilled.  I play every day! 311,094,205",
        "label": [
            "0"
        ]
    },
    {
        "postid": 1821,
        "date": "2015-03-10 18:17:06",
        "content": "Going to be out of meds soon. Sense of impending doom. So due to various circumstances, I will be unable to get a prescription for my medication until the 27th. I have enough until the 16th. I was lucky to stock up on my antidepressant for 2 months, but my anxiety and sleeping medication will be out.  I have gotten so much better, but it feels like it's all due to the meds. Just a small mishap with them knocks me back. I am expecting the worst. I don't know if I'll be able to handle it.  Have you ever had to deal with such a situation? How did it go?",
        "label": [
            "S"
        ]
    },
    {
        "postid": 1839,
        "date": "2015-03-12 10:50:14",
        "content": "[update] I went out to ask for help. I made [this post](https://www.reddit.com/r/Anxiety/comments/2yl0vn/going_to_be_out_of_meds_soon_sense_of_impending/) yesterday, about me possibly having to be off medication for a while.  The reason I got in this situation was moving countries, and my prescriptions not being valid where I was until I went through some bureaucracy with my psychiatrist. I went to schedule the meeting and the earliest they gave me was the 27th.  So, after spending a week worrying about this, I actually went out to the office again and explained my situation. They gave me an earlier date immediately. Why didn't I do it the first time? I was too scared to open my mount and ask for a different date. It sounds completely ridiculous but I physically couldn't do it.  Thanks to those of you that told me not to give up and gave me tips on my original post. I probably wouldn't have made myself go out if it wasn't for thinking over your posts.",
        "label": [
            "0"
        ]
    },
    {
        "postid": 1864,
        "date": "2015-03-15 06:00:55",
        "content": "[RNG][brag] I think I broke PaD ",
        "label": [
            "0"
        ]
    }
]