[
    {
        "postid": 4473,
        "date": "2019-07-08 14:47:27",
        "content": "Dear Atheist What is your opinion on religion being merely private? We have people stating they believe in a personal god although they consider themselves as Christians, Muslims, Jews etc. which seems like a contradiction to me. How can the statement of religion merely be a part of private life when there's a church in every little commune?  Should religion be completely eradicated or should we let these dangerous beliefs stay a part of social interaction?",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4475,
        "date": "2019-07-10 01:34:41",
        "content": "Looking for a femdom porn I've watched a couple of weeks ago a hentai pornon Xhamster. Now this porn video got deleted and I look for it again. It's titled \"Hentai femdom experiment\" where the Misstress ties, electrectues, whipes, insults etc. the sub to increase his orgasm 300×. I'd be glad if someone could give me title of this hentai",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4476,
        "date": "2019-07-10 01:44:41",
        "content": "How do I get such a fancy title? This is random af but I saw a couple of people here having a label/title like \"agnostic\" \"atheist\" etc. and I want one too. Am I just to stupid to find it or do I get is asserted by the moderators?",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4477,
        "date": "2019-07-10 02:02:14",
        "content": "20yo vegan goth guy. Round 2 ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4478,
        "date": "2019-07-10 02:18:32",
        "content": "Looking for an online dom or slave [removed]",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4479,
        "date": "2019-07-10 02:28:30",
        "content": "Looking for a slave or dom Hi,   I'm Simon a 20yo guy from Germany. I look for a girl to have some fun with whether as dom or slave. I'm switch so I'm open for both sides.  We can know each other better if you like to first or go right ahead. If you get along fine we might turn this into a deeper level. You can dm me here or on kik  My kinks:  As master: Whipping, Slapping, Binding, Blindfolding, Chocking, Humaliatan, Insults   As slave: Whipping, Slapping, Humiliation, Insults, Strap-on, Pee (Maybe)  I'm looking forward to meet you. Thanks for reading",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4481,
        "date": "2019-07-10 09:23:09",
        "content": "I'm confused Hi there. I'm a 20yo man and I kinda feel uncomfortable with my sex. It's like idk how to say my genitals don't seem to be me. I don't feel like a man but I don't know about it. I did a couple of days ago a photo gender swap (How I look as girl) and I've fallen in love the way I look. Idk what to say or to think",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4482,
        "date": "2019-07-11 02:15:50",
        "content": "Ready and tied up ",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4483,
        "date": "2019-07-12 02:50:06",
        "content": "Voltaire mocks Anti-Vaxxer I read Voltaires letters concerning the English Nation. He literally mocks French people in their for not \"Vaccinating\" (The form which was common at his days) their children. \"Do the French people really hate their lives that much\" he asked.  I found it so amusing that even in the 18th century people knew how important protection against sickness are",
        "label": [
            "0"
        ]
    },
    {
        "postid": 4485,
        "date": "2019-07-13 13:59:04",
        "content": "No motivation down af I have to redo a whole year of school cuz my school sucks. They told me this 2 weeks ago just out of nowhere. I feel so down and depressed don't know whether I should go to a clinic again to treat my pd and ed or just end it. I don't enjoy reading anymore although I want so. I barely do anything...",
        "label": [
            "S"
        ]
    },
    {
        "postid": 4486,
        "date": "2019-07-16 13:00:41",
        "content": "I'm ok I'm ok rn. I'm simply ok",
        "label": [
            "0"
        ]
    }
]