{
    "2r3gtk": {
        "title": "I generally consider myself cis, but \"being a man\" feels wrong to me sometimes.",
        "body": "This isn't necessarily a trans question, but about gender identity because I don't know how to label these feelings. When I'm super depressed I feel very rigid about conforming to stereotypical \"male\" gender norms. However, when I actually feel confident about myself I feel a sort of distance growing between my identity and the male gender. I also find myself in these times wishing I were born a cis woman. These feelings go away whenever my confidence diminishes, but I still do not feel that I am trans. The male side of my identity is still a very real thing.\n\nMy question is; is there a label for these feelings? I feel like I go back and forth from feeling masculine and feminine quite regularly.",
        "created_utc": 1420202080,
        "label": [
            "0"
        ]
    },
    "2r6gbz": {
        "title": "Any other introverts make better progress thinking things out vs. regular therapy?",
        "body": "Today I was able to lift myself out of a depression calmly and with stability mostly by being self aware and thinking things out clearly. I know what I'm feeling is nothing like a manic episode. I feel like I've improved myself a bit, however small it is. I feel much more open to change than I have in months. Is this something that others have experienced?",
        "created_utc": 1420263446,
        "label": [
            "0"
        ]
    },
    "2rdatk": {
        "title": "Personification of the internet as a woman.",
        "body": "Has anybody noticed there is a running theme throughout Death Grips' discography of personifying the internet as a woman?\n\n\nIn \"Culture Shock\", Ride is talking about technology and internet culture, while a woman's voice is sampled, and there are vague references to some woman being a \"satanic priestess\"\n\n\n\"This is Violence Now\" also uses a woman's voice to speak the phrase \"You have been banned from the channel\"\n\n\nI realize this is just a couple of examples, but I think it's possible that most if not all lyrics about women are really an esoteric way of talking about the internet's response to Death Grips. This would explain why NOTM (which seemed to say quite a bit about Death Grips' place in the world) is filled with Björk samples. It's Ride fighting back against the internet's interpretation of who he is, because of course he keeps his real self \"up his sleeves\".\n\n\nWe know that naming their first major album \"The Money Store\" (which is a bank) is an ironic reference to them selling out. But the cover seems to also be a reference if you look at it, because the individual on the leash has fake breasts and Death Grips scratched into the skin. This piece seems to be a statement about Epic trying to reframe DG's image to sell better on the internet. This would of course make the NLDW cover a direct defiance of that and of how the internet percieves them, because a penis represents the opposite of the internet, a woman.\n\n\nI'm not 100% on this, but I thought it'd be fun to write up a theory.",
        "created_utc": 1420431881,
        "label": [
            "0"
        ]
    },
    "2rm924": {
        "title": "Ghost Culture - Giudecca [Synthpop]",
        "body": "",
        "created_utc": 1420627454,
        "label": [
            "0"
        ]
    },
    "2rq5xx": {
        "title": "Being able to self examine my thoughts and behavior and evaluate what feels right and wrong has helped my keep my head clear.",
        "body": "I don't know how useful this may be to anybody else, but since I've decided to look inward and analyze my thought patterns, I feel like I have a grip on how to help myself move forward. Of course, I don't want to get ahead of myself, but I've had a much brighter outlook since I found a strategy for myself. I just recognize that making decisions takes a more complicated process for me when compared to someone who might be neurotypical.",
        "created_utc": 1420705980,
        "label": [
            "0"
        ]
    },
    "2tlwly": {
        "title": "[Title omitted] (Trigger warning: self harm)",
        "body": "Sorry for the vague title, but I couldn't figure out what I could put that wouldn't be triggering. Here is what the title would have been:\n\n\nI'm forever branded as mentally ill by my scar.\n\n\nTonight I had a bit of a meltdown, and in between crying fits I took some time to think about what really had me so upset. I can't really pin it on one thing, but my thoughts kept going back to my scar from when I cut myself 4 years ago. I know it was in January, so hell it may be close to the anniversary if I only knew the exact day. What I'm really getting at is that no matter what progress I may make as a person, whatever coping strategies and medication keeps me relatively level headed, as soon as someone notices my scar I know it will bring me back to square one.\n\n\nSo I'm having a bit of a crisis realizing that this will always be with me, nagging in the back of my head whenever I try to help myself. Someday it will be undone. No matter what. And one of these times, I might not come out alive.",
        "created_utc": 1422187757,
        "label": [
            "IE"
        ]
    },
    "2u0gi6": {
        "title": "Song skipping/Track unplayable bug with new iOS update.",
        "body": "I noticed a new bug today on my iPhone which will make whatever song I'm listening to either start skipping, or stop playing altogether with a \"Song unplayable\" message. Closing apps doesn't help.\n\n\nWhile I appreciate the nostalgia for scratched CDs this gives, I'm hoping a fix for this will be quick and simple.",
        "created_utc": 1422483349,
        "label": [
            "0"
        ]
    },
    "2uylhc": {
        "title": "[Film] [IIL] A Most Violent Year, Drive [WEWIL?]",
        "body": "",
        "created_utc": 1423203646,
        "label": [
            "0"
        ]
    },
    "2veg4a": {
        "title": "Protip: You can cancel the grappling hook at any time by tapping Circle/B.",
        "body": "Didn't realize this until today. Useful for precise landings or correcting mistakes.",
        "created_utc": 1423558631,
        "label": [
            "0"
        ]
    },
    "2vk4qo": {
        "title": "[Music][IIL] Can, Tuxedomoon, Zs, [WEWIL?]",
        "body": "",
        "created_utc": 1423678101,
        "label": [
            "0"
        ]
    },
    "2xjrwu": {
        "title": "[Music][IIL] Del/Deltron/Hieroglyphics, MF DOOM, Shabazz Palaces, Flying Lotus, Black Milk [WEWIL?] (Modern Rap)",
        "body": "",
        "created_utc": 1425202349,
        "label": [
            "0"
        ]
    },
    "2y9b7m": {
        "title": "New item idea: Toxic Shock Syndrome (Toxic damage plus new damage type: Electricity)",
        "body": "I was thinking of a way to make the idea of electric damage appealing, and I believe the best way would be a chain effect between enemies in close proximity. It'd have to be a slow building effect, you can't just have it trigger on the first shot.\n\n\nAlso thought that maybe we could have stationary objects spawn in rooms sometimes that deal this shock type damage: Tesla coils. They could be charged by firing tears into them (not necessarily shock tears, but it'd be faster with those).",
        "created_utc": 1425751308,
        "label": [
            0
        ]
    },
    "30ea6s": {
        "title": "People just tried to look at my apartment to assess the property on behalf of the owner.",
        "body": "I had to turn them away because our apartment is a mess and we have someone staying in our living room. The scary part of it is that there's an ashtray on our patio that is filled with butts and I don't know if they took a picture or not. Please help me to stop freaking out.",
        "created_utc": 1427392619,
        "label": [
            0
        ]
    },
    "30k6ak": {
        "title": "\"That's an ingenious way to steal everyone's nudes.\" [+702]",
        "body": "",
        "created_utc": 1427508063,
        "label": [
            0
        ]
    },
    "332xgt": {
        "title": "[IIL] Nick Cave, (early) Murder by Death, Voltaire, Current 93, Swans (&amp; other M. Gira/Jarboe), Iceage [WEWIL?]",
        "body": "",
        "created_utc": 1429403798,
        "label": [
            0
        ]
    },
    "333wan": {
        "title": "Who else would want a Chalice Dungeon Vita game? *Spoilers*",
        "body": "Given that smaller games work best on the Vita, I think a prequel based on the original group which explored the dungeons would be perfect. It would be a bit of a divergence as the main story would be specific characters with very different base stats (You would also start at a higher level). Limited co-op would be possible in the main story, but PVP and custom characters would only appear in a separate mode.\n\nI know that the Vita doesn't have nearly as many owners as the PS4, but with over a million sales of Bloodborne so far, I think this would be great for it.",
        "created_utc": 1429428528,
        "label": [
            0
        ]
    },
    "352m00": {
        "title": "[Music][IIL] Ratking, Shabazz Palaces, Young Fathers, To Pimp a Butterfly, FlyLo, Thundercat, Gonjasufi, Frank Ocean, Fetty Wap, FKA twigs, Kelela, [WEWIL?]",
        "body": "",
        "created_utc": 1430928649,
        "label": [
            0
        ]
    },
    "37ts8h": {
        "title": "[Anime] [IIL] Cowboy Bebop, FLCL, Serial Experiments Lain, Attack on Titan, [WEWIL?] (post 2001)",
        "body": "Preferably shows I may find on Netflix, Hulu or Crunchyroll.",
        "created_utc": 1432977754,
        "label": [
            0
        ]
    },
    "38hd57": {
        "title": "[PS1]['95-'99] 3rd person spaceship shooter with disturbing intro.",
        "body": "Platform(s): Playstation\n\nGenre: Arcade-y Shooter\n\nEstimated year of release: Some time in the late '90s, probably '98 or '99\n\nGraphics/art style: Color palette was mostly deep reds, purples, and greens. Not sure how to describe an art style for a PS1 game.\n\nNotable gameplay mechanics: You pilot a spaceship from a 3rd person perspective on a planet's surface, blasting away at aliens which were much larger than your ship. I believe most of them were based on Earth insects.\n\nOther details: So this is the most important part of it: The intro, which I believe was live action, was in a first person perspective as you're wheeled down the hallway of some sort of asylum or prison, until you're set in a room where a device with two needles is lowered in front of your face and both needles are inserted directly into your eyes. This is what I remember best about the game, because it scared the shit out of me.",
        "created_utc": 1433396198,
        "label": [
            0
        ]
    },
    "3ack51": {
        "title": "\"Transfinancial\" [+4,917]",
        "body": "",
        "created_utc": 1434673442,
        "label": [
            0
        ]
    },
    "3cn6ls": {
        "title": "This 2015 pair of designer Vans would very much be at home in the '90s.",
        "body": "",
        "created_utc": 1436418977,
        "label": [
            "0"
        ]
    },
    "3dlwje": {
        "title": "Alice Glass (formerly of Crystal Castles) shares first solo single \"Stillbirth\" along with a letter about an abusive relationship and a donation link to RAINN.",
        "body": "The single will be available on iTunes and Spotify starting July 18th. All proceeds from digital sales will go to RAINN and similar organizations.\n\nhttps://soundcloud.com/aliceglasss/stillbirth\n\n\nThe letter:\n\n\n&gt;Years ago I began the process of trying to remove myself from an abusive relationship that started when I was a teenager. Over the course of that relationship I was systematically cut off from anyone and everyone that I could truly be close to. I was talked down to, yelled at, locked into rooms and criticized daily about my abilities, my weight, my looks, my intelligence and almost every move I made. When I couldn't take it anymore and I wanted to end the relationship I was threatened, then I was told I was loved, and the cycle would begin again. \n\n&gt;I want young women and young men to understand that this kind of treatment of others can happen where it might be least expected. Even in environments that thrive on creativity and open-mindedness, that advocate artistic and counter-culture ideals. Sometimes people will use these things to camouflage themselves so that their abuse might go unnoticed. So that you wouldn't think to consider it could be happening right in front of you.\n\n&gt;The clarity I've gained since getting out of that situation has opened up my life in a way that I didn't imagine was possible. Although some of the pain and anger still lingers, my life finally feels as though it has value and meaning. I speak out now hoping that I can encourage other young women and young men to affirm their value within their relationships or get out. Abuse isn't always obvious and it doesn't have to involve black eyes, blood and broken bones. Emotional and psychological abuse can be just as damaging, and it is extremely difficult to remove yourself from. \n\n&gt;Those that have known me throughout my career might be surprised that someone who publicly gave the impression of being fearless and seemed as though they didn't take shit from anyone could find themselves being severely mistreated and manipulated by someone they were close to. This person nearly stripped me of myself. And for years I felt as though they were waiting for my life to end.\n\n&gt;Stillbirth was written by myself and Jupiter Keyes in our basement. There is no label involved. It will be available through iTunes, Spotify, etc. beginning July 18. All proceeds for digital purchases of this song will benefit organizations (like the nonprofit RAINN) that help survivors of domestic abuse, sexual violence and incest. You can donate directly to them at https://donate.rainn.org/ or via the link on my website at http://www.alice-glass.com/ \n\n&gt;There is a sister song to Stillbirth that I hope to release soon, she is a lullaby and she can't wait to meet you",
        "created_utc": 1437125762,
        "label": [
            "0"
        ]
    },
    "3f4avh": {
        "title": "[NPR First Listen] HEALTH - Death Magic",
        "body": "",
        "created_utc": 1438228403,
        "label": [
            "0"
        ]
    },
    "3f5c50": {
        "title": "Airplane! had this down in 1980.",
        "body": "",
        "created_utc": 1438254887,
        "label": [
            "0"
        ]
    },
    "3fhu5q": {
        "title": "I spoke barely more than a sentence out loud today. Things feel more and more \"over\" every day.",
        "body": "The worst thing about being alone for me is that I know objectively that it's easy to connect with people and maintain a rewarding life. But not doing any of that will always be easier so I can't make myself just change. I wake up every day feeling just exhausted enough that I can't make anything productive out of the day. I know it's supposed to be one day at a time, but all I do is walk just up to the precipice of meaningful change and turn around because I'd rather fall back into familiar comforts. I'm afraid that an active life will stress me out to the point of desiring suicide, so instead I've committed myself to running out the clock until I'm dead. I'm sick of people who only like me for who they think I am. I've never felt loved for who I really am, by family or anyone. On paper, I had a \"good\" childhood. But my dad is so relentlessly optimistic that it only feels hollow. Why does he say I'm good? Even he must see that isn't true. Every time he acts supportive I know he's masking disappointment. He just wants me to be better in whatever way doesn't neccessitate his direct involvement. I don't have the heart to tell him it's not possible.",
        "created_utc": 1438507663,
        "label": [
            "IS"
        ]
    },
    "3fup00": {
        "title": "Posting this while in a good mood, in hopes that I can sustain it.",
        "body": "I hope this isn't rule-breaking, I won't be offended or hurt if it needs to be removed. I'm not posting this seeking participation from anyone else, it's strictly for my own benefit because it feels helpful for me to unload these thoughts in a public space. I may or may not delete it myself depending on how I feel in the future. I just feel like posting it at the moment.\n\n\nWhenever I manage to break from depression, I tend to let myself fall back into old habits almost immediately and my progress is lost. I wanted to take a moment to write up a post I can look back on whenever I forget what got me here. Mostly it's not talking things out, because when I keep all my problems to myself they become overwhelming and I tend to make them seem bigger than they really are. I've noticed every time I've broken from my depression it's been through taking 3 easy steps: 1. Saying what's been on my mind in some sort of way where I know someone else could acknowledge it. 2. Changing my perspective. 3. Not allowing myself to become passive or inactive (this means making my own comfort a priority, and not putting things off unless I actually need to.).\n\n\nOne of the main reasons I let myself fall into my old habits is that I end up convincing myself that no matter what, feeling better is only temporary. Of course, it seems clear to me right now that the best thing I can do is find something productive to do each day to make myself feel better. Binge watching TV, eating junk and sitting on the computer can satiate me temporarily, but that usually leads me back into depression and it becomes a cycle. Maybe the best thing I can do is find something new each day or week, until the majority of my bad habits are replaced by new, better habits. Or maybe I don't have to do that. I don't need to have everything figured out at once. It's just nice to shake things up. That's one of my main problems, always thinking in terms of the future and not living in the moment. It leads to me believing I need to understand everything in absolutes, which encourages me to develop a routine, which causes me to stagnate and fall into depression again. Maybe that's because I just shut down and let myself get absorbed in doing next to nothing for way too long. Accepting things the way they are day in, day out is just not healthy for me. I need to take risks.",
        "created_utc": 1438762066,
        "label": [
            "0"
        ]
    },
    "3g6xo0": {
        "title": "What is going on with my upper lip? (white patches, mild burning when irritated)?",
        "body": "[M/25]\n\nhttp://i.imgur.com/HQtLJUb.jpg\n\nAbout two months ago these whitish patches started appearing on my upper lip. They've spread a little bit, but mostly stayed the same. I've been using lip balm, drinking more water and taking B vitamins, but it hasn't really gotten better. Any clue what this might be before I go to the doctor about it?",
        "created_utc": 1438993337,
        "label": [
            "0"
        ]
    },
    "3gp53j": {
        "title": "/u/gifs_SS posts about his good job as a pro skater, /u/technology_SS believes Ellen Pao never actually let go of her job.",
        "body": "",
        "created_utc": 1439365095,
        "label": [
            "0"
        ]
    },
    "3h25ba": {
        "title": "[Music][IIL] Cloud Nothings, Sunny Day Real Estate, Cap'n Jazz, Unwound, early Modest Mouse, WEWIL?",
        "body": "",
        "created_utc": 1439609067,
        "label": [
            "0"
        ]
    },
    "3hg98t": {
        "title": "Does anybody else want more characters in the intro?",
        "body": "I generally consider the intro to be flawless, and for the most part I'm very glad they haven't changed it in 3 seasons, but I can't help feeling it's time that it features more than just Sarah. There are so many characters who are vital to the story that it seems sorta weird to me that we don't at least see Allison, Cosima and Helena during the intro.",
        "created_utc": 1439908761,
        "label": [
            "0"
        ]
    },
    "3hjkzv": {
        "title": "/u/Earthporn_SS is satisfied with a photo it took, /u/ledootgeneration_SS predicts a repost.",
        "body": "",
        "created_utc": 1439958835,
        "label": [
            "0"
        ]
    },
    "3i2izq": {
        "title": "[IYL] Death Grips, Skinny Puppy, Throbbing Gristle, The Prodigy, '80s hardcore punk, [YML] L.O.T.I.O.N. - Digital Control And Man's Obsolescence LP",
        "body": "",
        "created_utc": 1440328961,
        "label": [
            0
        ]
    },
    "3ikkcl": {
        "title": "Lisa Kudrow Performed Smelly Cat Onstage with Taylor Swift.",
        "body": "",
        "created_utc": 1440659576,
        "label": [
            0
        ]
    },
    "3j791p": {
        "title": "Abbi and Ilana will be on Late Show with Stephen Colbert on Sept. 16th.",
        "body": "",
        "created_utc": 1441101050,
        "label": [
            0
        ]
    },
    "3j7b77": {
        "title": "How difficult is it really to catch up on the story?",
        "body": "I've only ever played MGS2 all the way through, and that was back around the time it was first rereleased on Xbox. I know there is always a lot of chatter about how dense and convoluted the story is, but is that all just hype? I guess what I want to know is how necessary it may be to actually play any games between MGS2 up to Ground Zeroes. I'm hoping it's more viable to get summarized and play the rest of the games after I get through MGSV.",
        "created_utc": 1441102623,
        "label": [
            0
        ]
    },
    "3leyy9": {
        "title": "[Music][IYL] Grimes, Nicole Dollanganger, Ariel Pink, [YML] Strawberry Switchblade/Rose McDowall's solo album",
        "body": "[Strawberry Switchblade](https://www.youtube.com/watch?v=x7QPBzAJ_io)\n\n\n[Rose McDowall - Cut with the Cake Knife](https://www.youtube.com/watch?v=u8K1UDOr9TY)",
        "created_utc": 1442571686,
        "label": [
            0
        ]
    },
    "3mtc06": {
        "title": "[Music] [IYL] Dirty Projectors, Lower Dens, Arcade Fire, [YML] U.S. Girls - Half Free",
        "body": "",
        "created_utc": 1443519339,
        "label": [
            0
        ]
    },
    "3nthwy": {
        "title": "What did I miss here? [Post Episode 43, so possible Spoilers]",
        "body": "Sometime after I finished Episode 43, my FOB was infiltrated. I resolved the situation and went about my business as usual. A little bit later, while the servers were under maintenance, Ocelot called me back to Mother Base saying there was an emergency. I get there and there's something about someone attacking one of the bases, and that they know who it was. Ocelot directed me to give the order via my iDroid, but nothing happened due to the servers being unavailable.\n\n\nI'm 99% sure that because this happened after the very first time my FOB got infiltrated that it was simply the game's way of introducing retaliation missions, but I want to be absolutely positive that my game didn't somehow glitch out. I've tried finding the cutscene on YouTube but I've had no luck.",
        "created_utc": 1444208253,
        "label": [
            0
        ]
    },
    "3nvpue": {
        "title": "[MGSV Spoilers] What did I miss here? [Post Episode 43] (x-post from r/metalgear)",
        "body": "Sometime after I finished Episode 43, my FOB was infiltrated. I resolved the situation and went about my business as usual. A little bit later, while the servers were under maintenance, Ocelot called me back to Mother Base saying there was an emergency. I get there and there's something about someone attacking one of the bases, and that they know who it was. Ocelot directed me to give the order via my iDroid, but nothing happened due to the servers being unavailable.\n\nI'm 99% sure that because this happened after the very first time my FOB got infiltrated that it was simply the game's way of introducing retaliation missions, but I want to be absolutely positive that my game didn't somehow glitch out. I've tried finding the cutscene on YouTube but I've had no luck.",
        "created_utc": 1444247633,
        "label": [
            0
        ]
    },
    "3opgka": {
        "title": "/u/all-top-today_SS gives an oversimplified synopsis of Metal Gear Solid V: The Phantom Pain, shares unrelated burrito picture.",
        "body": "",
        "created_utc": 1444818962,
        "label": [
            0
        ]
    },
    "3otbd6": {
        "title": "[Music][IYL] Future Islands, New Order, FFS, [YML] Rey Pila",
        "body": "",
        "created_utc": 1444880825,
        "label": [
            0
        ]
    },
    "3qxsap": {
        "title": "[Music] [IYL] Hotline Miami and HM2: Wrong Number's soundtracks, Skinny Puppy, early Nine Inch Nails, [YML] Pictureplane",
        "body": "",
        "created_utc": 1446271379,
        "label": [
            0
        ]
    },
    "3rvoek": {
        "title": "Thanks to trggr-wrnng on tumblr tweeting my fan edit to Grimes, this happened tonight.",
        "body": "",
        "created_utc": 1446896352,
        "label": [
            0
        ]
    },
    "3t4mgy": {
        "title": "Interview with new artist Gaika, + music video and mixtape Soundcloud embed",
        "body": "",
        "created_utc": 1447743315,
        "label": [
            0
        ]
    },
    "3v2a34": {
        "title": "Ivy and ____? (S2 fall finale spoilers)",
        "body": "Would anyone else like to see Ivy get adopted by Hugo Strange? She's been underused this season and I think it would be an interesting way to set her on the course to becoming Poison Ivy.",
        "created_utc": 1449010272,
        "label": [
            0
        ]
    },
    "3xbjqt": {
        "title": "Want to get into Old Hunters but I need a recap of main game story/lore.",
        "body": "Is there a good summary out there for this purpose? I was on top of all the lore and everything when I completed the game 8 months ago, but that is quite a bit of time so I don't want to go into this feeling like I need to catch back up with the story.",
        "created_utc": 1450425078,
        "label": [
            0
        ]
    },
    "3xxsmg": {
        "title": "[TV &amp; Film] [IIL] Jessica Jones, Requiem for a Dream, Donnie Darko, Gregg Araki films, [WEWIL?][Drama, no \"comic book heroes\"]",
        "body": "",
        "created_utc": 1450855786,
        "label": [
            0
        ]
    },
    "3z5py1": {
        "title": "[Music][IIL] Cocteau Twins, Strawberry Switchblade, My Bloody Valentine, The Cranberries, [WEWIL?] (Scottish &amp; Irish artists)",
        "body": "",
        "created_utc": 1451753690,
        "label": [
            0
        ]
    },
    "46p7ek": {
        "title": "Why Deadpool won't be hosting SNL (from Ryan Reynolds' YouTube channel)",
        "body": "",
        "created_utc": 1455954239,
        "label": [
            0
        ]
    },
    "485q7j": {
        "title": "Who else would love to see the PS1 classic Silent Bomber remade or ported to the Vita?",
        "body": "",
        "created_utc": 1456694211,
        "label": [
            0
        ]
    },
    "48w5my": {
        "title": "PSN notified me that my Uncharted 4 preorder had been automatically canceled and refunded. I got the refund, but the preorder appears to still be active. What can I do about this?",
        "body": "So with the delay that happened a few months back, Playstation sent me an email asking if I would like to keep my preorder by linking me to a page where I could confirm that. I said yes, and though that was it. A little while later they sent it to me again, and once again I said yes.\n\nToday, I get a notification on my PS4 that the preorder had been canceled and refunded, and I can place the preorder again if I wish to. However, when I go to the game page or check my library, it says I have the preorder still. Is it just going to take more time for the cancellation to work through the system?",
        "created_utc": 1457071399,
        "label": [
            0
        ]
    },
    "4dzeen": {
        "title": "What is CC?",
        "body": "Some of the gear I have mentions CC damage, and I have no clue what that means. I haven't seen anything in the game which says what CC is short for, and I'd like to know so I can tell how useful that gear might be to me.",
        "created_utc": 1460164831,
        "label": [
            0
        ]
    },
    "4h16sd": {
        "title": "Waiting for May 6th Club",
        "body": "Since this subreddit will probably be flooded with people eagerly dissecting the leaked songs, I thought it might be nice to have at least one thread available for people who are waiting, so that we can continue to discuss DG in general without being interrupted by discussion of unreleased music.",
        "created_utc": 1461959501,
        "label": [
            0
        ]
    },
    "4hr41t": {
        "title": "Anyone else want a full map view?",
        "body": "It would really help with strategizing my next move if I could get a view of the full map layout after dying while I wait out the respawn timer. Or maybe in the spawn base.\n\nDoes anyone else agree or would this be too much?",
        "created_utc": 1462315689,
        "label": [
            0
        ]
    },
    "4kml8f": {
        "title": "Artist photos/album covers from Spotify on my Facebook are all blank.",
        "body": "Is this issue affecting anybody else? Over the past week or so, all the artist photos/album covers have been disappearing from the Music page on my Facebook profile, leaving blank spaces. A few days before this my recently played artists on my Spotify profile stopped updating.\n\n\nI've already looked into the second issue and have seen that there's no fix for it, but is there anything I can do about my Facebook profile?",
        "created_utc": 1463983591,
        "label": [
            0
        ]
    },
    "4onegx": {
        "title": "So Rachel is... [FINALE SPOILERS]",
        "body": "Bluffing to the Neolution board at the end when she says the \"science is secure,\" right? Or was what Cosima grabbed just the cure and completely separate from the cell line needed to continue human cloning? Just a bit confused.",
        "created_utc": 1466230697,
        "label": [
            0
        ]
    },
    "4r7q56": {
        "title": "How can I get my hands on the Suicide Squad IMAX poster?",
        "body": "I've been wondering this since they first showed it off. I really want to be able to frame it and hang it on my wall if possible, but I haven't found even a clue as to how I might be able to obtain it. Is this something they might sell at IMAX screenings?",
        "created_utc": 1467646620,
        "label": [
            0
        ]
    },
    "4rfhyb": {
        "title": "[FRESH] Crystal Castles - Cement (video)",
        "body": "",
        "created_utc": 1467760703,
        "label": [
            0
        ]
    },
    "4senk7": {
        "title": "Blocked by Crystal Castles' SoundCloud?",
        "body": "Posting this here because I've already messaged their web admin and any time I post a comment about it on their forum it gets deleted without a word to me.\n\n\nI discovered today after Char came out that I'm unable to follow their SoundCloud page due to being blocked. I thought maybe they just weren't allowing people to follow them or something, but I was able to follow them under a new account.\n\n\nHas this happened to anybody else? I've never contacted their SoundCloud account or interacted with it in any way, so I have no clue why this is happening.",
        "created_utc": 1468289346,
        "label": [
            0
        ]
    },
    "56l14t": {
        "title": "circlejerk_ss puts forth an all star third party presidential candidate.",
        "body": "",
        "created_utc": 1475992593,
        "label": [
            0
        ]
    },
    "57kvi0": {
        "title": "Strategies for breaking procrastination cycle?",
        "body": "I've always had a tendency to oversimplify my day-to-day life to avoid stress, so that tends to mean I put off most things I want to accomplish in a day whether it's productive or not. Emphasis on anything that might involve uncertainty or stress. Pretty much the only time I allow myself to be motivated toward fixing this is at the very end of the day when there's nothing I can do about it. Then I wake up feeling too tired to do anything which allows the cycle to continue. The thought that keeps coming back when I try to figure out how to fix this is that I need to make sure I get out of bed immediately when I wake up rather than start the day by establishing a pattern of putting things off.\n\n\nSo what I've decided to try is writing myself a note reminding myself to get out of bed which I'll be putting on my laptop (the first thing I reach for in the morning). Hopefully this will at least start the day off right, but I'd like to have some more options to keep me going through the rest of the day.\n\nDoes anyone else have the same issue and can offer some strategies?\n\ntl;dr: Big procrastinator, only motivated to change at the end of the day and always unmotivated when I wake up. Would like some strategies to remedy this.",
        "created_utc": 1476511836,
        "label": [
            0
        ]
    },
    "5diy8q": {
        "title": "Spotify on my laptop is forgetting how to simply play an album start to finish.",
        "body": "This has been going on since probably the last update I installed (1.0.42). I'll have an album playing, and at some point in the tracklist, it will go back to the first song instead of whatever song is supposed to come next. Other times it may start the album over once it's done, even though repeat isn't turned on.\n\n\nIs anyone else having this problem?",
        "created_utc": 1479423317,
        "label": [
            0
        ]
    },
    "5gcpqo": {
        "title": "Volume warning for the PaRappa demo",
        "body": "If you're about to play the PaRappa demo, do yourself a favor and crank the volume way down before you load it up. It's incredibly loud. I was using Turtle Beaches, I can only imagine what it's like on a speaker system.",
        "created_utc": 1480811078,
        "label": [
            0
        ]
    },
    "5kfhth": {
        "title": "Government Plates vinyl in stock for $24.99 at Waterloo Records on North Lamar in Austin. 6 copies as of 2 PM.",
        "body": "",
        "created_utc": 1482782798,
        "label": [
            0
        ]
    },
    "5purlx": {
        "title": "Confused about the Kitchen demo.",
        "body": "When PSVR came out I was excited to play the Kitchen demo I'd heard so much about. Yet searching the Playstation Store yielded nothing. There was the Beginning Hour demo, but when I ran that I couldn't find an option to play in VR mode.\n\n\nCan anyone explain what the deal is with any of this? I can use VR in the Beginning Hour demo now, but as far as I can tell I'm still not getting the Kitchen demo. The only reason I care so much is that I want to be sure I'm not missing anything before I start the full game.",
        "created_utc": 1485241141,
        "label": [
            0
        ]
    },
    "5wtabn": {
        "title": "[Season 3 Spoilers] Sky Ferreira may have hinted at her role in Twin Peaks with this tweet.",
        "body": "https://twitter.com/skyferreira/status/836495112540573696\n\nIt seems Sky Ferreira may be playing the daughter of Carl Rodd. I don't know anything about his character outside of FWWM/TMP, so I'm not sure how likely this is. If it's true, then it would also seem Debbie Harry will be appearing in the new episodes.",
        "created_utc": 1488344653,
        "label": [
            0
        ]
    },
    "5y94d4": {
        "title": "[Black/Death] Succumb - Survival",
        "body": "",
        "created_utc": 1488992821,
        "label": [
            0
        ]
    },
    "5z8b00": {
        "title": "[IIL] Head Wound City, Gallows, Ceremony, Oozing Wound, Lightning Bolt, Hella [WEWIL?]",
        "body": "",
        "created_utc": 1489444661,
        "label": [
            0
        ]
    },
    "62npzh": {
        "title": "[FRESH] Sneaks - It's a Myth [Minimalist Post-Punk/No Wave]",
        "body": "",
        "created_utc": 1490990730,
        "label": [
            0
        ]
    },
    "63hnvo": {
        "title": "[IIL] Popcaan [WEWIL?]",
        "body": "",
        "created_utc": 1491346224,
        "label": [
            0
        ]
    },
    "64ke4f": {
        "title": "[IYL] Arca, Jenny Hval [YML] Sadaf",
        "body": "",
        "created_utc": 1491839479,
        "label": [
            0
        ]
    },
    "66qqy0": {
        "title": "[FRESH STREAM] Toby Driver - Madonnawhore",
        "body": "",
        "created_utc": 1492796416,
        "label": [
            0
        ]
    },
    "683sez": {
        "title": "[Media] The Town of Twin Peaks (New Footage)",
        "body": "",
        "created_utc": 1493397668,
        "label": [
            0
        ]
    },
    "69crfo": {
        "title": "[New Release] [Grind/Death] Full of Hell - Trumpeting Ecstasy",
        "body": "",
        "created_utc": 1493960727,
        "label": [
            0
        ]
    },
    "6aau2t": {
        "title": "[No Spoilers] Johnny Jewel's new album Windswept (featuring music from Season 3) is now available on Spotify",
        "body": "",
        "created_utc": 1494393064,
        "label": [
            0
        ]
    },
    "6clfr1": {
        "title": "[No Spoilers] PSA: Don't watch the new season on cable.",
        "body": "I don't know if anyone else noticed this, but the video quality is horribly compressed on Showtime's cable broadcast. When I switched over to episodes 3 &amp; 4 on Amazon, the difference was stark. I have to think Lynch himself would be disappointed with the quality they're showing it in on the channel.\n\n\nDo yourself a favor and only watch it on whatever digital service you can get the new episodes on.",
        "created_utc": 1495431646,
        "label": [
            0
        ]
    },
    "6cxrbu": {
        "title": "[S3E1-S3E4] Dale's FBI Pin",
        "body": "[removed]",
        "created_utc": 1495575536,
        "label": [
            0
        ]
    },
    "6cyfzk": {
        "title": "[S3E4] Dale's FBI Pin",
        "body": "Cooper didn't just lose his shoes in episode 3.\n\n\nFrom the first scene in the Red Room up until Cooper passes through the electrical socket, he still has his FBI pin on his suit. From that point on, it's missing. It's also missing in the scene with the Giant at the start of episode 1.\n\n\nCould this mean that scene was a flash forward?",
        "created_utc": 1495582664,
        "label": [
            0
        ]
    },
    "6cz4u0": {
        "title": "Possible ID of sample in Steroids",
        "body": "[removed]",
        "created_utc": 1495590293,
        "label": [
            0
        ]
    },
    "6ebfr7": {
        "title": "[S3E5] Remember the Laura Palmer missing posters from early March?",
        "body": "http://welcometotwinpeaks.com/news/missing-laura-palmer-posters-australia/\n\n\nI'm getting the feeling this may actually be relevant to Season 3, given her sudden disappearance at the start of the season as well as Leland telling Dale to find her.\n\n\nI suppose the question is where did she end up?",
        "created_utc": 1496190736,
        "label": [
            0
        ]
    },
    "6ex35i": {
        "title": "[FRESH ALBUM] Institute - Subordination",
        "body": "",
        "created_utc": 1496436710,
        "label": [
            0
        ]
    },
    "6f47wk": {
        "title": "[No Spoilers] Chrysta Bell - Falling (Cover) [Free Download]",
        "body": "",
        "created_utc": 1496532184,
        "label": [
            0
        ]
    },
    "6g6go1": {
        "title": "\"Recently Played Artists\" tab in user profiles has been ruined",
        "body": "I'm not sure when exactly it happened this week, but the behavior of the Recently Played Artists tab is totally different. It used to be a mostly static arrangement of artists that have been listened to with some frequency which only updated periodically and didn't have any certain order.\n\n\nNow it lists in chronological order whatever artist you played last. You don't even have to finish 1 song, simply pressing play on a track puts that artist on your profile. Essentially, you need to avoid even trying music you don't like if you care about having your profile represent your taste in music. It seems that this is a byproduct of the new \"Recently Played\" feature which appears underneath the Daily Mixes in the desktop application. Hopefully this change will be reverted.",
        "created_utc": 1496985913,
        "label": [
            0
        ]
    },
    "6gtsbi": {
        "title": "[S3E6] Theory about the Giant scene from Episode 1",
        "body": "When the first 4 episodes were released, I had believed the scene between Dale and the Giant was a flash forward. However, I now think this scene takes place simultaneously with Episode 6 and explains why Dale's been acting the way he has for the past 3 episodes.\n\n\nMy belief is that when Dale passed through the electrical socket, his spirit was diverted by the Giant in an effort to spare him should anything happen once he passes through. The Giant could be the one who's been guiding Mr. Jackpots through his journey, helping him win 30 jackpots in the casino in order to call attention to his existence and so on. The Dale that's out living Dougie's life still has traces of the real Dale, but for the most part he's an empty vessel.\n\n\nIn the scene we see at the beginning of Episode 1, the Giant tells Dale what is going on at the present moment in Twin Peaks. He also tells him that he's far away, indicating that not only is he physically far away being in Las Vegas but also that nobody from Twin Peaks has seen him in years. Dale then disappears because this is the moment that the Giant sends him to be woken up in his body.\n\n\nWhat interests me about this is that Dale in that scene seems much wiser about how the Lodge operates given that he simply takes the Giant's information without a hint of confusion. We may see a version of Dale that is now an expert on all the forces at play this season.",
        "created_utc": 1497289206,
        "label": [
            0
        ]
    },
    "6h29rx": {
        "title": "Looking to get back into music production with the \"right\" gear. Is this a good beginner's setup?",
        "body": "[removed]",
        "created_utc": 1497382496,
        "label": [
            0
        ]
    },
    "6i8zko": {
        "title": "[S3E6] The sleeve",
        "body": "This is a weird thing to realize 8 days later, but the reason Dale was tugging at his left sleeve at the start of Part 6 was because he was thinking about Mike. Did anyone else notice this?",
        "created_utc": 1497902874,
        "label": [
            0
        ]
    },
    "6jjlwg": {
        "title": "[S3E8] Part 8 confirms the red balloons we've seen are a nod to the song 99 Luftballons/99 Red Balloons",
        "body": "[removed]",
        "created_utc": 1498461176,
        "label": [
            0
        ]
    },
    "6jr1yj": {
        "title": "[S3E8] Thought about Briggs",
        "body": "After watching Part 8 and rewatching Part 7, I realized why Briggs was killed. Much like how Bob was in Evil Cooper's chest, I believe the golden orb used to manufacture Dougie was within Briggs (possibly a result of his visit to the White Lodge). His head was removed in order to prevent him from waking up in the same way that Evil Cooper did. What Evil Cooper didn't count on was Briggs' ability to jump through time. He learned of his fate and swallowed Dougie's wedding ring.\n\n\nThis adds to why Jeffries mentioned Evil Cooper's meeting with Briggs. He suspected Evil Cooper of manufacturing a decoy.",
        "created_utc": 1498547024,
        "label": [
            0
        ]
    },
    "6mxiag": {
        "title": "[IIL] [Record Labels] Sacred Bones, The Flenser, Dais, Cleopatra, Deathbomb Arc, Anticon, [WEWIL?]",
        "body": "",
        "created_utc": 1499898954,
        "label": [
            0
        ]
    },
    "6nzunr": {
        "title": "[S3E11] 253",
        "body": "So in Part 2 we had the Arm telling Dale \"Remember 253. Time and time again.\" This to me suggests that both instances of 2:53 (once in the Zone and also the time Frank, Hawk and Bobby are set to go out by Jack Rabbit's Palace) are significant to Dale.\n\n\nThe description for Part 11 is \"There's fire where you are going.\" Odds are we're going to see whatever events take place on 10/1 in this part, and it may affect more than just the trio from the Sheriff's Department. This second occurrence of 2:53 may be the one to wake Dale up, and what's found out by Jack Rabbit's Palace might possibly require his presence somehow.",
        "created_utc": 1500372972,
        "label": [
            0
        ]
    },
    "6pav64": {
        "title": "[S3E11] A thought about a certain place's significance.",
        "body": "So we know now that the place Cole glimpsed briefly was the same place Laura stepped into in FWWM after being given the picture by the Tremonds. We also know that the glimpse of Laura that Cole saw in Part 10 took place the same day she received that picture. Now think back to the scene where Laura saw herself in the picture.\n\n\nI believe passing through that zone is the key to living on inside the Lodges. This could be why Briggs hibernated there, and Cole was close to becoming a Lodge resident himself before Albert saved him. I don't think we've seen the last of Hastings. Maybe he's been reunited with Ruth.",
        "created_utc": 1500925663,
        "label": [
            0
        ]
    },
    "6qrga9": {
        "title": "[S3E11] Reminder: This season's \"Why killed Laura Palmer?\" is \"What's happening with Agent Cooper?\"",
        "body": "Back in April, the official Twin Peaks YouTube shared this video containing the phrase \"What's Happening with Agent Cooper?\":\n\n\nhttps://www.youtube.com/watch?v=VFfXuyC7Mt8\n\n\nMuch like how Frost/Lynch felt the question \"Who killed Laura Palmer?\" was meant to drive the original run, the question \"What's happening with Agent Cooper?\" is meant to drive this season. Everyone wants to know when Dale is going to wake up just like everyone wanted to know who killed Laura. This is why it's taken so long. Their belief seems to be that Dale returning to normal will end the narrative momentum that Season 3 is running on, and I would agree with that.\n\nDale is exceptionally lucky at solving mysteries and bringing disparate elements together. If he were an active player from the start, things would not be developing the way that they have been so far. It would have been too easy and it would've been too similar to how the original was paced and in effect a retread. Given how anti-nostalgia this season has been, it only makes sense. Dale was in some ways an audience insert, someone who existed to make sense of what was going on and guide us through the story. We're not meant to have anyone really solving the mysteries for us. This time around we're Agent Cooper figuring it out for ourselves whether it's through reddit posts or analysis videos on YouTube.\n\nAnother thing tying Laura in the original run to Dale in Season 3 is how in both we see the way each character has impacted the world around them. We saw the good and bad that Laura did, and we see the good that Coop did as well as the bad that Evil Coop has done. \n\nTheory time: [S3E12](/s \"I believe Laura is the key to inevitably waking Dale up. We don't know what she whispered to him in Part 2, but it seems reasonable to think that just as she told him who killed her it's probable that she told him she would have to be the one to wake him up. Because of that, she was removed by the Arm's doppelgänger and may have been sent to the same place that Dale was sent to (soon after, Leland tells Dale to 'Find Laura'). She could even be the 'Mother' that the American Girl character (played by the same person who was Ronette in the original run) referred to. Wouldn't be the first time that a Lodge entity claimed familial relation to Laura. In Part 10 she visited Cole, and Margaret told Hawk 'Laura is the one.' This could mean she is the one to bring Dale back. My best guess is that she will appear to Dale alongside the Giant who will return his FBI pin and lead him to the place where we saw him at the start of Part 1.\")",
        "created_utc": 1501535149,
        "label": [
            0
        ]
    },
    "6s8xle": {
        "title": "[No Spoilers] Cover of \"Just You\" by ST 37, because this song's always been cool",
        "body": "",
        "created_utc": 1502142864,
        "label": [
            0
        ]
    },
    "6sb9r7": {
        "title": "Enabling anxiety via avoidance",
        "body": "So I've got generalized anxiety, and probably my worst habit is the fact that I tend to \"manage\" my anxiety by avoiding anything that makes me feel anxious. It's been difficult acclimating myself to breaking that habit, but I'm starting to feel better than I did when I first developed it now that I'm trying to deal with the behavior directly.\n\nIs this a common experience among those with GAD? Does the feeling of anxiety subside or level out in any way after a while? I'm trying not to discourage myself now that I'm on this path. Procrastination has been a major issue for me the past couple years and this seems to be helping.",
        "created_utc": 1502167698,
        "label": [
            0
        ]
    },
    "6tcg8g": {
        "title": "I recently developed balance problems after days of prolonged stress",
        "body": "Not necessarily looking for answers, just want to vent about how frustrating it is to develop a new symptom. From last saturday up until wednesday I was stressing out about something and although I mostly got over that stress, on thursday I started to notice a sort of heavy head feeling. It's been getting a bit better since I started to relax about it, but I'm so annoyed that this happened at all. Not knowing that anxiety could cause this problem had me freaking out that it was something more serious. It's really ironic that anxiety causes conditions that cause more anxiety.",
        "created_utc": 1502588822,
        "label": [
            0
        ]
    },
    "6tk1hi": {
        "title": "[S3E14] Here's your new wallpaper.",
        "body": "",
        "created_utc": 1502683385,
        "label": [
            0
        ]
    },
    "6xriyg": {
        "title": "[S3E16] A sound and a photo.",
        "body": "Did anybody else notice that the same sound which occurs during the intro alongside Laura's photo also played when Diane's tulpa said that she \"remembered?\"\n\n\nMaybe Laura was guiding Diane's tulpa to reveal information about that night with Evil Coop to Cole/Tammy/Albert and send the coordinates to Evil Coop so that Good Coop can find him.",
        "created_utc": 1504417324,
        "label": [
            0
        ]
    },
    "6y1nvp": {
        "title": "[S3E18] Part 8's relation to Part 18",
        "body": "Up to now, it's been taken for granted that the events of Part 8 take place in the world we followed from FWWM up to Part 17. But is there a chance that this is actually the world Coop and Diane entered in Part 18?\n\n\nIt would explain why the Fireman sent out Laura in that orb. This world needed its Laura. I'm also thinking the frogmoth girl isn't Sarah Palmer, but is instead the mother of this version of Laura. New Mexico isn't too far from Odessa. Somehow Laura was diverted from Twin Peaks into the southwest.\n\n\nThink about the fact that we heard the Platters song again in Part 18. That may have been an indication to recall what happened in Part 8.",
        "created_utc": 1504545233,
        "label": [
            0
        ]
    },
    "6y5g67": {
        "title": "[S3E18] One simple reason to not stress too much about explanations.",
        "body": "Remember \"We live inside a dream.\"\n\n\nWhen was the last time you were able to understand everything that happened inside a dream?",
        "created_utc": 1504582961,
        "label": [
            0
        ]
    },
    "6ybhrh": {
        "title": "[S3E18] Is the manufacturing of tulpas affected by emotional states?",
        "body": "Specifically, I'm wondering if the emotional state of a person when a piece of them is taken to create a tulpa influences the personality of the resulting tulpa. This could be why Mr. C assaulted Diane and smiled when he saw she was afraid. He needed a tulpa that feared him and would thus obey him. Not to say it's 100% effective, because he had to send the \":-) ALL\" text and trigger her fear again so that she would send the rest of the coordinates. But her personality in general was different from the actual Diane.\n\n\nWe also see this with Dougie 1.0, who is based on a piece of Dale that Mr. C took when he grabbed him in the Black Lodge. Dale was scared, but he was also lost and confused. This created a tulpa that could never stand up to Mr. C and easily succumbed to vices. His tendency to get confused also likely caused his car accident which Bushnell mentioned in Part 9.\n\n\nFinally, the Dale who gave his hair to Mike in Part 16 was hopeful and optimistic. So the resulting Dougie 2.0 shared those qualities, as exemplified by the cheerful smile on his face.",
        "created_utc": 1504650569,
        "label": [
            0
        ]
    },
    "6zdrax": {
        "title": "[S3E8] The identity of the Dreamer.",
        "body": "Right now I'm thinking that finding a dreamer for Judy was the Woodsman's goal in Part 8. Once everyone who's listening to his broadcast has descended, the frogmoth finds its way to a victim and completes the process.\n\n\nIt's made pretty clear by the credits sequence. We see her eyes moving as in REM sleep, which is when you dream, and this is accompanied by the sound of electricity.\n\n\nIf she's not THE dreamer, she's at least one of them. There were quite a few eggs.",
        "created_utc": 1505112313,
        "label": [
            0
        ]
    },
    "70tbxh": {
        "title": "[IIL] Cowboy Bebop, FLCL, Attack on Titan, Kill la Kill, Yuri!!! on Ice, One-Punch Man/Mob Psycho 100, Parasyte, Erased, [WEWIL?]",
        "body": "Basically my problem is there's so much anime out there that I feel kinda lost trying to figure out what to watch next. I've always been a casual fan of anime, so I'm out of my depth in terms of sorting through all the various genres.",
        "created_utc": 1505717665,
        "label": [
            0
        ]
    },
    "76tmj3": {
        "title": "What is Lynch's history with Roman Polanski?",
        "body": "I found out today in the comments on another reddit post that [David Lynch was on a list](http://www.indiewire.com/2009/09/over-100-in-film-community-sign-polanski-petition-55821/) of people in Hollywood who signed a petition supporting Polanski as he faced extradition in 2009.\n\n\nThis led me to run a Google search to see if there's more between them. It seems they appeared together at events in the 2000's, but I've seen nothing else.\n\nI've been finding it hard to reconcile this information with how Lynch has portrayed sexual violence in his work. How can he seem to understand the severity of assault in his work yet he was unwilling to condemn Roman Polanski and even expressed support for him?\n\n\nI'm not posting this with the intention of attacking Lynch or anything like that, I'm just trying to process it.",
        "created_utc": 1508187904,
        "label": [
            0
        ]
    },
    "76twqt": {
        "title": "Is buying a 6S Plus now a bad idea?",
        "body": "I've had my 6 Plus since December 2014, and I'm hoping that with my next phone I will again be able to stick with it for 2+ years. My main concern is that new versions of iOS will be increasingly incompatible with the 6S and with app updates I won't be able to stick with iOS 10 going forward.\n\n\nGiven that Apple hasn't yet removed the 6S from their line of iPhones, should I be concerned at all about this? Newer models are outside the price range I want to pay, not to mention the headphone jack situation.",
        "created_utc": 1508190521,
        "label": [
            0
        ]
    },
    "78jg3s": {
        "title": "Weird things your anxiety convinces you of?",
        "body": "What are some weird things your anxiety convinces you must be true?\n\nToday I used a non-alcohol based disinfectant wipe on my iPhone and now I’m convinced there’s some invisible residue making my hands sticky after holding it.",
        "created_utc": 1508884760,
        "label": [
            0
        ]
    },
    "7ccl1l": {
        "title": "Don’t bring a backpack if you’re going to Gas Monkey tonight.",
        "body": "Security doesn’t allow backpacks for whatever reason. Had to get rid of mine at the door because I took an Uber to the venue.",
        "created_utc": 1510451258,
        "label": [
            0
        ]
    },
    "7fokhb": {
        "title": "Uniform on Instagram: \"We're working on a new record. More soon...\"",
        "body": "",
        "created_utc": 1511719778,
        "label": [
            0
        ]
    },
    "7gqthk": {
        "title": "First new post on cagedpillow IG since DG started “online” retweets back in September",
        "body": "",
        "created_utc": 1512085944,
        "label": [
            0
        ]
    },
    "7j30nr": {
        "title": "Has the sample at 2:10 in Steroids been identified?",
        "body": "It sounds like a song that's been manipulated heavily. Tried searching but didn't find any posts about it.",
        "created_utc": 1513007532,
        "label": [
            0
        ]
    },
    "7jun9x": {
        "title": "[SPOILER] Need some clarification on a certain decision made this season.",
        "body": "So Mr. Robot knew all along that they wouldn’t get the key by hacking the FBI, but he let them try anyway? Why? That was incredibly risky with no chance of payoff. It doesn’t make sense.\n\nI understand that he obviously didn't want 5/9 to be reversed, but he could've communicated that with Elliot similar to how they \"talked\" in Episode 6. They could've reached the same conclusion as they did in the subway scene in the finale, but without all the complications that occurred up to that point throughout episodes 9 &amp; 10.\n\nKinda makes the finale feel contrived.",
        "created_utc": 1513285359,
        "label": [
            0
        ]
    },
    "7ka4y3": {
        "title": "Andy is online.",
        "body": "",
        "created_utc": 1513464480,
        "label": [
            0
        ]
    },
    "7ls8ki": {
        "title": "Was the Jenny Death delay caused by TPTB’s physical release?",
        "body": "When DG announced they stopped as a band in 2014, they promised Jenny Death would still be out that year. Then it didn’t come out until March 2015. I think it’s possible they originally intended to release both parts of TPTB digitally in 2014 with the physical release to come later in 2015. Harvest may have prevented this, which led them to make sure they could release Bottomless Pit digitally first when working out the details of that release with Harvest (that deal probably included mandating they provide a preorder link for physical copies). BP came out physically 2 1/2 months after the digital release. Not that far off from the gap between Inanimate Sensation and when Jenny Death finally came out.\n\nThoughts? I’m not 100% sure that’s how label deals work, but it’s a theory.",
        "created_utc": 1514076675,
        "label": [
            0
        ]
    },
    "7mhwqo": {
        "title": "Alice Glass Files Docs in Response to Ethan Kath Defamation Suit, Mentions Other Victims",
        "body": "",
        "created_utc": 1514409884,
        "label": [
            0
        ]
    },
    "7nyriy": {
        "title": "Is anyone else seeing the TFN 3.2 beta on Galen's IG?",
        "body": "Has that been there since the teaser first came out or was it added back to his profile recently? I haven't seen it on there until today.",
        "created_utc": 1515022642,
        "label": [
            0
        ]
    },
    "7o56a5": {
        "title": "So, who’s working on a Black Butler AMV?",
        "body": "I’d do it myself but I can’t edit.\n\nWould recommend using Black Dice as the track.",
        "created_utc": 1515092495,
        "label": [
            0
        ]
    },
    "7q6j99": {
        "title": "Night Flight Plus has added Arise! + 6 other SubGenius videos",
        "body": "",
        "created_utc": 1515871196,
        "label": [
            0
        ]
    },
    "7qms3m": {
        "title": "An analysis on how touring might factor into the new album's release",
        "body": "First off, let's look at the band's release history:\n\nNLDW\n\nAnnounced: February 27th, 2012\n\nReleased: October 1st, 2012\n\nGap between announcement and release: 7 months, 5 days\n\n\n---\n\n\nGovernment Plates\n\nAnnounced: May 10th, 2013\n\nReleased: November 13, 2013\n\nGap between announcement and release: 6 months, 3 days\n\n\n---\n\n\nTPTB Disc 1\n\nAnnounced: January 19th, 2014\n\nReleased: June 8th, 2014\n\nGap between announcement and release: 4 months, 20 days\n\n\n---\n\n\nJenny Death\n\nAnnounced: June 8th, 2014\n\nReleased: March 31st, 2015\n\nGap between announcement and release: 9 months, 23 days\n\n\n---\n\n\nBottomless Pit\n\nAnnouncement: October 21st, 2015\n\nRelease: May 5th, 2016\n\nGap between announcement and release: 6 months, 15 days\n\n\n---\n\n\nJudging solely by that, it seems reasonable to expect the album would be released somewhere between roughly 6-7 months. Yet here we are 7 months and 24 days after the announcement with no album.\n\nThere's one simple reason for that: Tour dates. They can't really work on the album when they're not in the studio, so any time spent on the road is going to push the album further back.\n\n\nHere's a look at how much studio time DG potentially had for each album:\n\nNLDW\n\nThis one's easy, since they cancelled tour dates to work on the album. They had from late April until the end of September. A little over 4 months.\n\n\n---\n\n\nGovernment Plates\n\nHere they didn't have their first break to work on the album until between June 16th and July 12th, just under a month. Then they had about a week in mid-late July. Then they had only one date between the end of July and late August, so that's about a month. After their last August date they had 2 months and 20 days.\n\nIn total: Roughly 4.3 months\n\n\n---\n\n\nTPTB Disc 1\n\nNo touring during this period, so it's safe to assume they spent pretty much the full 4 months and 20 days working on the album.\n\n\n---\n\n\nJenny Death\n\nNo touring yet again, and they announced the album was complete on October 10th, 2014. Once again it's safe to assume they spent the full 4 months and 2 days working on the album.\n\n\n---\n\n\nBottomless Pit\n\n\nThere were 30 days between the announcement and their set at Day for Night, so that's about 1 month. Then they had 3 months and 25 days between that date and their April 14th show in Santa Cruz.\n\nIn total: 4 months and 24 days\n\n\n---\n\n\nThat leaves us with the new album. I can't be 100% sure when they started on it, but I'll assume it was when they announced it on May 22nd. They had about a week between then and their set at Primavera. After that they were on the road until June 11th. The next show they did was on July 29th, so they had roughly 1 month and 18 days to work on the album. Next they were on the road until August 24th, followed by a gap of 1 month and 20 days. So far it's been 2 months and 4 days since the tour ended.\n\nIn total: *5 months and 20 days*\n\n\n---\n\n\nEvery album so far has taken around 4 months to complete. This means we can be pretty sure the new one is finished as well.\n\nThe final question is, how long will they wait to release the new album?\n\nThat much I can't answer. With Bottomless Pit, they started doing shows 3 weeks before the album came out and they announced the tracklist/cover art 1 month and 18 days before the album came out. It's possible they actually finished BP the week they made that announcement (especially since they also revealed the cover art for TPTB when they announced that album was complete).\n\n\nSo given they usually take around 4 months to make an album and they waited roughly 1 month and 18 days to drop Bottomless Pit, the new album could be out any time in the next few weeks or so. My best guess is mid-to-late February.",
        "created_utc": 1516049822,
        "label": [
            0
        ]
    },
    "7r4pyl": {
        "title": "[New Single/Video] HIDE - Wildfire",
        "body": "",
        "created_utc": 1516226631,
        "label": [
            0
        ]
    },
    "7s2fc4": {
        "title": "Is anyone else watching Devilman Crybaby on Netflix?",
        "body": "Feel like this show fits some of DG’s themes with all the drugs, sex and demonic possession.\n\n\nPlus the music and animation are dope. Something to watch while waiting for the new album.",
        "created_utc": 1516586357,
        "label": [
            0
        ]
    },
    "7sc5hj": {
        "title": "Cease and Desist now available on Spotify!",
        "body": "",
        "created_utc": 1516684317,
        "label": [
            0
        ]
    },
    "7ti3my": {
        "title": "Seriously: Is \"Have a Sad Cum\" about Stefan getting caught masturbating?",
        "body": "Let's examine the evidence:\n\n1. \"Wasting time feels good\"\n\n2. \"N-n-no\"\n\n3. \"I'm busy, oooh\"\n\n4. \"Have a sad cum, bb!\"\n\nI think you'll find the evidence speaks for itself.",
        "created_utc": 1517113315,
        "label": [
            0
        ]
    },
    "7updfz": {
        "title": "Let's ask the Magic Conch when DG will release the new album",
        "body": "",
        "created_utc": 1517551846,
        "label": [
            0
        ]
    },
    "7x670w": {
        "title": "Speculation re: Nick Reinhardt and the new album",
        "body": "credit to /u/Scumtacular for pointing this out first.\n\nSo Tera Melos wrapped up their tour just days before that pic near Sunset Sound was posted last week. Andy posted those studio pics early sunday morning. Odds are they’ve been waiting this long so they could get Nick Reinhardt in for some finishing touches like they did with Bottomless Pit (based on the two versions of Hot Head).\n\nHoping this means the album will be out by the end of March.",
        "created_utc": 1518488896,
        "label": [
            0
        ]
    },
    "7xeakl": {
        "title": "Exmilitary shirt in stock, all sizes",
        "body": "",
        "created_utc": 1518570188,
        "label": [
            0
        ]
    },
    "7y50hu": {
        "title": "New article from The Daily Beast including stories about Claudio from several women and an interview with Alice",
        "body": "",
        "created_utc": 1518847930,
        "label": [
            0
        ]
    },
    "7y50qs": {
        "title": "New article including stories from several of Claudio's victims and an interview with Alice",
        "body": "",
        "created_utc": 1518848036,
        "label": [
            0
        ]
    },
    "7yc8zt": {
        "title": "Is Stefan saying \"one\" under his breath at 2:15 &amp; 2:18 in Voila?",
        "body": "https://youtu.be/qlJ_pjwBYxY?t=2m15s\n\nSure sounds like it.",
        "created_utc": 1518930126,
        "label": [
            0
        ]
    },
    "7z7027": {
        "title": "Have you ever had part of a song's production stick out to you long after the first time you heard it?",
        "body": "I've listened to Hot Head 130+ times and that snare hit that reverbs between the left and right channels during the \"hell's existence\" part of the track stuck out to me in a way that it hadn't really before.",
        "created_utc": 1519231946,
        "label": [
            0
        ]
    },
    "7zlltj": {
        "title": "STILLBIRTH (Zola Jesus Remix)",
        "body": "",
        "created_utc": 1519362452,
        "label": [
            0
        ]
    },
    "7zlp89": {
        "title": "[FRESH ALBUM] Tor Lundvall - A Dark Place",
        "body": "",
        "created_utc": 1519363420,
        "label": [
            0
        ]
    },
    "7zqe44": {
        "title": "The lawsuit against Alice has officially been dismissed",
        "body": "",
        "created_utc": 1519411678,
        "label": [
            0
        ]
    },
    "7zuzgt": {
        "title": "Alice Glass Triumphs in Ethan Kath’s Defamation Suit",
        "body": "",
        "created_utc": 1519454927,
        "label": [
            0
        ]
    },
    "7zv6sb": {
        "title": "For anyone who follows the Twin Peaks/DG connections, the 24th is Twin Peaks Day",
        "body": "See this post for a brief overview:\n\nhttps://www.reddit.com/r/deathgrips/comments/7i18ms/dgtwin_peaks_connections/\n\n\nBasically, there have been several instances of DG activity since May last year lining up with Twin Peaks. Each time, it’s been the day after. For example, Steroids came out the day after Season 3 premiered.\n\nThe 24th is Twin Peaks Day, celebrating the day Dale Cooper arrived in Twin Peaks (Feb. 24th, 1989).\n\nObviously, the bottle theory points toward the 25th.\n\nI think there might just be something here.",
        "created_utc": 1519457896,
        "label": [
            0
        ]
    },
    "80r2rh": {
        "title": "Alice’s lawyer confirms in new article that the lawsuit’s dismissal was due to lack of evidence, not a technicality",
        "body": "",
        "created_utc": 1519772787,
        "label": [
            0
        ]
    },
    "817eu8": {
        "title": "We Live/Public School No. 4?",
        "body": "Does anyone know what happened to these songs?\n\nAll traces of them seem to have disappeared. I'm fairly disappointed that I might not get to hear them again outside of getting the vinyl releases of Gentrification I &amp; II.",
        "created_utc": 1519928508,
        "label": [
            0
        ]
    },
    "821hjd": {
        "title": "In 2 weeks the wait for the new album will officially be longer than the wait for Jenny Death",
        "body": "Number of days between 6/8/2014 and 3/31/2015: 9 months, 23 days\n\nNumber of days between 5/22/2017 and 3/18/2018: 9 months, 24 days\n\n\nJenny Death/TPTB’s release date was announced 15 days before it came out.\n\nDiscuss.",
        "created_utc": 1520205518,
        "label": [
            0
        ]
    },
    "831qb8": {
        "title": "Let’s just get out all our wild guesses for album release dates",
        "body": "I think it’ll be out April 13th.\n\nThe Money Store was announced February 27th, then released April 24th.\n\nJenny Death’s completion was announced October 10th (with separate digital and physical releases mentioned), Inanimate Sensation was released December 9th.\n\nBottomless Pit’s cover art (with the release date tease) was revealed March 18th, the album was released May 6th\n\nAndy posted photos from the studio on February 11th.\n\nIf, taking the Jenny Death post into consideration, The Money Store and Bottomless Pit were completed around when those posts were made that would suggest they usually release albums around 2 months after completing them (I believe Jenny Death was originally intended to be released digitally December 9th).\n\nI’d like to assume Andy’s post coincided roughly with when they finished the album. If that’s the case, then the album will most likely be released April 13th. However, there’s also the chance he posted the photos late and they actually finished the album February 6th so it could be an April 6th release. Or it could be released on the earlier side like Bottomless Pit, which would be March 30th.\n\nSo, in the unlikely chance that I’m on to anything here, it could be between March 30th and April 13th. But ultimately I would lean more towards the later date.\n\nEDIT: They also tend to announce release dates two weeks in advance, so I’m keeping my eyes out between the 16th and the 30th.",
        "created_utc": 1520548855,
        "label": [
            0
        ]
    },
    "83oa5e": {
        "title": "Meaning of \"ER\" on TMS cover?",
        "body": "http://thirdworlds.net/sites/default/files/albums/the-money-store/tms-1200.jpg\n\nOn the hand holding the leash there are the letters \"ER.\" Is this part of the Sua Yoo original? If not, what do people think it means?",
        "created_utc": 1520790738,
        "label": [
            0
        ]
    },
    "841gd4": {
        "title": "It's kinda fucked up that",
        "body": "They went to Disneyland, then a few weeks later collaborated with the guy who mocked Disney in a multi-billion dollar franchise.\n\n\nI just don't know where their loyalties lie.",
        "created_utc": 1520914894,
        "label": [
            0
        ]
    },
    "864shq": {
        "title": "Deep Red (Mike Berdan of Uniform) - Night Warning EP",
        "body": "",
        "created_utc": 1521658948,
        "label": [
            0
        ]
    },
    "86ftte": {
        "title": "Andy Morin - Waterfowl [Songs Compilation]",
        "body": "",
        "created_utc": 1521758663,
        "label": [
            0
        ]
    },
    "86i2db": {
        "title": "HIDE - CASTRATION ANXIETY",
        "body": "",
        "created_utc": 1521779895,
        "label": [
            0
        ]
    },
    "86ibet": {
        "title": "Lana Del Rabies - Shadow World [Noise/Industrial]",
        "body": "",
        "created_utc": 1521782926,
        "label": [
            0
        ]
    },
    "86im9v": {
        "title": "Gost - Possessor [Synthwave] (2018)",
        "body": "",
        "created_utc": 1521786837,
        "label": [
            0
        ]
    },
    "87363p": {
        "title": "New music March 30th.",
        "body": "",
        "created_utc": 1522007214,
        "label": [
            0
        ]
    },
    "88bxb3": {
        "title": "Tonight/tomorrow morning is a blue moon. DG posted a photo of a book titled “Life” with a crucifix shape cut into it during the last blue moon.",
        "body": "https://instagram.com/p/Bem7a2Ij7jg/\n\nIt’s up to you to decide if this means anything.\n\nEdit: And again, Judas was a snitch.\n\nEdit 2: Keith Richards also snitched by writing a memoir.",
        "created_utc": 1522429590,
        "label": [
            0
        ]
    },
    "88rsn1": {
        "title": "Does anybody have the video from this old FB post rehosted? “Death Grips Drum Recording (Live from SO16)”",
        "body": "",
        "created_utc": 1522598470,
        "label": [
            0
        ]
    },
    "88wt2i": {
        "title": "Interview 2016 is no longer displayed at the top of their SoundCloud",
        "body": "Okay, I know most people probably weren't checking for this, but I've been on their SoundCloud quite a lot lately and Interview 2016 has been featured in the Spotlight at the top of their page for a while. Now, after thirdworlds has been down, it's no longer in the spotlight.\n\nI think they're getting ready to post something new.",
        "created_utc": 1522643445,
        "label": [
            0
        ]
    },
    "8931g1": {
        "title": "Wreck and Reference - Alien Pains [Electronic] (2018)",
        "body": "",
        "created_utc": 1522694151,
        "label": [
            0
        ]
    },
    "894heg": {
        "title": "[FRESH VIDEO] METZ - Live on The Chris Gethard Show",
        "body": "",
        "created_utc": 1522699463,
        "label": [
            0
        ]
    },
    "8abfhn": {
        "title": "[IYL] Xiu Xiu, [YML] Wreck and Reference",
        "body": "",
        "created_utc": 1523035805,
        "label": [
            0
        ]
    },
    "8ds78b": {
        "title": "Remixes EP Ltd. Edition Colored 12\" Vinyl available for preorder",
        "body": "",
        "created_utc": 1524269315,
        "label": [
            0
        ]
    },
    "8eliea": {
        "title": "YouTube says Death Grips has 308 videos?",
        "body": "",
        "created_utc": 1524585548,
        "label": [
            0
        ]
    },
    "8eow48": {
        "title": "The YOTS announcements so far have happened while Mercury was in retrograde (March 22-April 15)",
        "body": "Previously with TMS, DG did a video project called Retrograde which is uploaded to YouTube under the name mercury00retrograde.\n\nWhile Mercury is in retrograde, communication is thought to become more difficult. Communication seems to be a major theme with this album, considering all of their social media activity and the tracklist video which started with what may have been a poorly translated passage (at the very least there were those portugese autocomplete suggestions). And of course the cover, which features several mouths inside a table.\n\nThoughts?",
        "created_utc": 1524611550,
        "label": [
            0
        ]
    },
    "8gs0xf": {
        "title": "New Caged Pillows tease on Galen’s IG",
        "body": "",
        "created_utc": 1525367718,
        "label": [
            0
        ]
    },
    "8h9qw6": {
        "title": "Did Death Grips change the way you digest &amp; appreciate art?",
        "body": "Before Death Grips, I was much more passive in my appreciation of art and entertainment. But Death Grips would continuously deliver material that I just couldn't understand right off the bat. I had to actively think about what their art was doing and look at it from a deeper level in order to fully appreciate it. Now I find it a lot more difficult to just dismiss art or entertainment in general that I don't get at first. I'm much more interested in looking at things from different angles and understanding the broader context that they're created in.\n\nI feel like this feeds into the things they've said about acceleration and being above and beyond a band (hell, think about the words \"VERY SHALLOW LISTENING\" on the BP back cover). They've had such a transformative effect on me, and I feel like I'm not alone in that regard. DG have presented a lot of unconventional art throughout their career, and even within the fan community there's been a great deal of initial bafflement which is followed by a deep understanding and appreciation.\n\nThis is a big reason why I think there's a deep connection between DG and Lynch's art. Both tend to avoid explaining their art in favor of letting the audience put in the effort to draw their own meaning. This approach to art, in my opinion, is far more rewarding than something like what Aronofsky did with his last movie (telling people explicitly what it was about).\n\nWhat do you guys think?",
        "created_utc": 1525548191,
        "label": [
            0
        ]
    },
    "8hc686": {
        "title": "*record scratch* OH MY",
        "body": "Most underrated moment in Streaky.",
        "created_utc": 1525572573,
        "label": [
            0
        ]
    },
    "8i8gsl": {
        "title": "That sound at 2:47-2:48 in Streaky.",
        "body": "https://youtu.be/J32L6dgbA-U?t=2m47s\n\nIt's probably hard to hear without headphones, but there's a very low sound at this part of the track that almost sounds like some sort of ambient noise like a field recording or something. It seems really out of place with the rest of the song, and it only occurs once at this specific point.\n\nObviously it wasn't put there by mistake.\n\nSo why is it there?",
        "created_utc": 1525892108,
        "label": [
            0
        ]
    },
    "8icy8n": {
        "title": "Duplicate scrobbles?",
        "body": "So for a little while I've been having duplicate scrobbles show up when scanning and scrobbling through the Last.fm scrobbler app, but more recently it seems it's been happening with tracks scrobbled while listening on my laptop as well.\n\nIs this happening to anyone else? I was deleting these scrobbles manually, but I eventually realized it went back so far that going through and deleting would just be a waste of time.",
        "created_utc": 1525935581,
        "label": [
            0
        ]
    },
    "8ihtzg": {
        "title": "Stefan's new title after Streaky",
        "body": "",
        "created_utc": 1525982803,
        "label": [
            0
        ]
    },
    "8j5rrq": {
        "title": "So, uh... That \"WHY MEEE\" track length theory turned out to be accurate",
        "body": "https://www.reddit.com/r/deathgrips/comments/8hjilu/yots_track_length_expectation/\n\nI totally forgot to check on this until just now, but if you go and check the Streaky video the track ends at 2:56 just like this theory predicted.\n\nThis means we may now know the exact length of each track off of the album.",
        "created_utc": 1526235612,
        "label": [
            0
        ]
    },
    "8j5t8e": {
        "title": "Seems that track length theory turned out to be accurate",
        "body": "https://www.reddit.com/r/deathgrips/comments/8hjilu/yots_track_length_expectation/\n\nI totally forgot to check on this until just now, but if you go and check the Streaky video the track ends at 2:56 just like this theory predicted.\n\nThis means we may now know the exact length of each track off of the album.",
        "created_utc": 1526235947,
        "label": [
            0
        ]
    },
    "8jqg7y": {
        "title": "Andrew Adamson @ 2:25 in Black Paint?",
        "body": "",
        "created_utc": 1526429040,
        "label": [
            0
        ]
    },
    "8jwp0h": {
        "title": "Claudio's appeal attempt to reverse the dismissal of his lawsuit was denied today",
        "body": "",
        "created_utc": 1526491015,
        "label": [
            0
        ]
    },
    "8kqm2q": {
        "title": "FLCL Progressive Trailer",
        "body": "",
        "created_utc": 1526791935,
        "label": [
            0
        ]
    },
    "8l7034": {
        "title": "Johnny Jewel released Themes for Television - 21 songs taken from the 6 hours of material submitted for the Season 3 soundtrack",
        "body": "",
        "created_utc": 1526960768,
        "label": [
            0
        ]
    },
    "8lmunw": {
        "title": "The pic they tweeted on 4/24 hinted at each of the singles",
        "body": "https://twitter.com/bbpoltergiest/status/988684104605483008\n\nWoman in the photo - in the Streaky video\n\nShadows in the foreground/background - Black Paint (“soaked in shadow”)\n\nBubbles in the woman’s hair - Flies (bubbles blowing @ 2:25 in the video)",
        "created_utc": 1527108848,
        "label": [
            0
        ]
    },
    "8lz7sw": {
        "title": "Death Grips' track count on SoundCloud increased from 144 to 147 tonight",
        "body": "I've been checking their SoundCloud basically once a day at least since I know BP appeared on there a week before it dropped.\n\nFor as long as I've been doing this, the count has stayed at 144. See [this comment from March](https://www.reddit.com/r/deathgrips/comments/86j922/oops/dw5ivqb/) for reference.\n\nAs of tonight, [the count sits at 147](https://soundcloud.com/deathgrips/tracks).\n\nIt looks like we're probably getting official uploads of Streaky, Black Paint and Flies very soon.",
        "created_utc": 1527224620,
        "label": [
            0
        ]
    },
    "8oygpq": {
        "title": "The background noise @ 3:32 in Black Paint",
        "body": "Am I the only one still discovering sounds in these singles? The other day I noticed the sound that accompanies the \"I don't have enough power\" section, and tonight I noticed this background noise which definitely got past me when it was just the YouTube version.\n\nHas anyone else heard something in any of the singles that they haven't seen anyone mention?",
        "created_utc": 1528267382,
        "label": [
            0
        ]
    },
    "8phk5g": {
        "title": "Uniform &amp; The Body - Mental Wounds Not Healing [Industrial/Experimental] (2018)",
        "body": "",
        "created_utc": 1528437948,
        "label": [
            0
        ]
    },
    "8pl83n": {
        "title": "Photo of the test pressing on bbpoltergiest's IG",
        "body": "",
        "created_utc": 1528474657,
        "label": [
            0
        ]
    },
    "8pmc9c": {
        "title": "Second wave of Test Pressings? No longer \"Sold Out\"",
        "body": "",
        "created_utc": 1528482741,
        "label": [
            0
        ]
    },
    "8pqyfv": {
        "title": "Ha Ha Ha is going to be an absolute MONSTER live.",
        "body": "I’m getting the feeling off these singles that YOTS built to destroy in a live setting.\n\nThis won’t be a tour to miss.\n\nWhat kind of setlist are you hoping for? Which YOTS track should close the set?",
        "created_utc": 1528525577,
        "label": [
            0
        ]
    },
    "8qjce7": {
        "title": "Echo Beds - Still Body",
        "body": "",
        "created_utc": 1528813574,
        "label": [
            0
        ]
    },
    "8r883q": {
        "title": "Mine music video",
        "body": "",
        "created_utc": 1529036854,
        "label": [
            0
        ]
    },
    "8rl1s3": {
        "title": "Dilemma = Performing a ritual to finish the album?",
        "body": "Is anyone else getting this vibe? Andrew Adamson’s part seems like he’s there to preside over the ritual or witness it.\n\nThe dumping of the sharks outside, playing music in the style of rock n roll that would frequently be recorded at Sunset Sound, it all seems like it’s meant to invoke some sort of creative spirit or force.\n\nI think that’s what the woman in the video is. She’s a spirit being summoned by the ritual which can give them the power to win their dilemma.",
        "created_utc": 1529171797,
        "label": [
            0
        ]
    },
    "8rmwvo": {
        "title": "GREEN BRICKS",
        "body": "",
        "created_utc": 1529189274,
        "label": [
            0
        ]
    },
    "8rxmiq": {
        "title": "The specific singles they picked to drop may have been chosen to get as close to half the album as possible",
        "body": "Remember the closing track from Bottomless Pit had the line “I’ll fuck you in half.”\n\nIn total, the 6 singles add up to 18:32.\n\nThe rest of the album adds up to 18:42.\n\nSplitting the album in half this way might also be another element tying in with the 2 theme.\n\nI realize the album length has shown up most places as 37:06, but that’s due to several tracks being counted 1 second short.\n\nThe actual length is 37:14, and you can see all of the track lengths in [this post](https://www.reddit.com/r/deathgrips/comments/8po4zb/three_instrumentals_on_yots/).",
        "created_utc": 1529306676,
        "label": [
            0
        ]
    },
    "8s3gjk": {
        "title": "demons in my shoes",
        "body": "",
        "created_utc": 1529358996,
        "label": [
            0
        ]
    },
    "8spy2d": {
        "title": "Shitshow uploaded to Vimeo",
        "body": "",
        "created_utc": 1529566456,
        "label": [
            0
        ]
    },
    "8srzjc": {
        "title": "Uniform - The Walk",
        "body": "",
        "created_utc": 1529588773,
        "label": [
            0
        ]
    },
    "8sy0ae": {
        "title": "Does anyone else numb their feelings?",
        "body": "I'm not sure if this behavior stems from my anxiety or my chronic depression, but I find that most days I keep myself mostly numb meaning I have trouble being emotionally connected to events around me at least on a conscious level. This changes when I allow myself to cry and release my emotions.\n\nI think this ties into how guarded I am against judgment from others. I'm afraid to be vulnerable, because due to experiences from my childhood I expect criticism for my flaws and that cuts deep. Just yesterday I went to dinner with my family and my brother told my dad that he should get me to stop wearing graphic tees all the time. Now when I was a kid I would internalize a comment like that and feel like there was something wrong with me for wearing graphic tees. These days I'm mature enough to at least recognize that his behavior in that moment wasn't normal or okay. But it's that kind of behavior from him that became a voice in my head after dealing with him throughout my childhood. Him and my dad. I worry about every small problem because I expect judgment like his, and I worry about every big decision because my dad was always concerned with intervening in my future (he made me change schools when I was 14 because my anxiety was causing me to sleep in class and ignore my schoolwork).\n\nSo all of that leaves me feeling frozen and afraid to make decisions for myself. I'm always looking for some external sign of approval that realistically I can't and shouldn't expect. When I can't get approval from others I don't know what to do with myself.",
        "created_utc": 1529636736,
        "label": [
            0
        ]
    },
    "8tbpmh": {
        "title": "The way Little Richard transitions from DJ Swamp's scratch intro",
        "body": "So good.\n\nThat moment right there shows how valuable his contribution to the album was.",
        "created_utc": 1529776840,
        "label": [
            0
        ]
    },
    "8u2d2h": {
        "title": "Lynch shares new statement about Trump via FB: \"You are causing suffering and division.\"",
        "body": "",
        "created_utc": 1530037262,
        "label": [
            0
        ]
    },
    "8uxa50": {
        "title": "DG still haven't updated their SoundCloud and YouTube profile pics",
        "body": "I guess they just really like the BP cover?\n\nKinda like how this subreddit is still using the BP theme.",
        "created_utc": 1530311334,
        "label": [
            0
        ]
    },
    "8wo5l3": {
        "title": "[IIL] [Music] [Metal] Succumb, Full of Hell, Nails, Sarcófago, Weakling - Dead as Dreams, [WEWIL?]",
        "body": "Mostly looking for artists that are in the realm of thrash, sludge, black metal and grindcore.\n\nAnything that sounds raw and dirty as opposed to slick and crisp studio production.",
        "created_utc": 1530914695,
        "label": [
            0
        ]
    },
    "8wwpxp": {
        "title": "Galen + his GF are live on IG",
        "body": "",
        "created_utc": 1531000825,
        "label": [
            0
        ]
    },
    "90ifmp": {
        "title": "Can this be a fecal stain?",
        "body": "https://i.imgur.com/6NCgo6B.jpg\n\nSo around sunday I noticed 3 bumps along my waistline that started to itch a day or two later. I looked around my bed thoroughly and found no signs of bedbugs. Then a day later I had a few more bumps around the same area, though one was pretty far from the others and the newer ones didn't show up in groups of 3 at all.\n\nThen this morning I found one bump by itself on my leg and this stain.\n\nLike I said, no other physical evidence of bedbugs. No eggs/shells, no skins.\n\nHow concerned should I be at this point? I'm struggling to find any other logical explanation for where these bumps are coming from. However, I'm also struggling to figure out how I could have bedbugs at all. I haven't had any visitors to my apartment since December, and the only place I stayed outside of my apartment in the last 8 months was on an air mattress while on vacation with my family by the beach just over a month ago and none of them have said anything about bedbugs. I live in an apartment building and there hasn't been any word of a bedbug infestation going around either.",
        "created_utc": 1532111004,
        "label": [
            0
        ]
    },
    "938q11": {
        "title": "Year of the Snitch’s use of the cursed_images aesthetic is a modern day answer to the fear of subliminal messaging in rock/metal",
        "body": "- The album art &amp; visual art they posted leading up to the album’s release are cursed\n\n- The “low quality” mixing of the album represents the low res aspect of the cursed_images aesthetic, as many cursed images contain artifacting (in fact the cover itself has some artifacting)\n\n- Dilemma, the most rock ‘n roll track has a direct reference this aspect of cursed images: “low res mega evil patina” (patina = “an impression or appearance of something“)\n\n- Little Richard immediately follows Dilemma, and it could be about someone being affected by a cursed image to commit a shooting/bombing on a college campus (“little richard/took a picture/he got triggered/by the clicka/he got meaner/he got bigger”). The lyric “in the horn section/they hide weapons” references that track being cursed. “bottom of a white bic/chewed up like a pig’s dick” could reference the cursed image which set off Little Richard. Zach posted these photos to his instagram: https://instagram.com/p/BjzDR4LHe0D/ https://instagram.com/p/BjzDeeeHGZg/ (the bottom isn’t visible, but still)",
        "created_utc": 1532989610,
        "label": [
            0
        ]
    },
    "967qez": {
        "title": "Official Streaky lyrics",
        "body": "Made this its own post because I thought it'd be obnoxious to leave this in the comments for the post with the YOTS packaging photos due to its length.\n\nstreaky streaky streaky streaky\n\nstreaky streaky streaky streaky\n\nstreaky on the outside\n\nstand by\n\ndealer holding franchise\n\nsouthside\n\ndo me cause it sounds tight\n\nstreaky on the outside\n\noh my yah\n\noh my yah\n\nbooty on the outside\n\nstand by\n\ndealer holding franchise\n\nsouthside\n\ndo me cause it sounds tight\n\nbooty on the outside\n\noh my yah\n\noh my yah\n\nflag full of backslide\n\nbye bye\n\ndo me cause it sounds tight\n\nstreaky on the outside\n\noh my yah\n\noh my yah\n\nstreaky on the outside\n\nstand by\n\ndealer holding franchise\n\nbye bye\n\ndo me cause it sounds tight\n\nbooty on the outside\n\noh my yah\n\noh my yah\n\noh my\n\ndon’t throw it on the ground\n\nyah\n\ntake me to the bank\n\ncertified amount\n\nhow i heard about\n\nshe’s a walkabout\n\ndream time announced\n\ndon’t leave your shit around\n\nwhat\n\ntake me to the bank\n\ncertified amount\n\nhow i heard about\n\nshe’s a walkabout\n\ndream time announced\n\nbooty on the outside\n\ncan’t double back\n\ndouble stack triple stack\n\njet pack\n\nlow crack\n\nlow cal\n\ngrand prize peng\n\ngrand prix lac\n\nmight pay to feed that\n\nspeed gap\n\nlost highway\n\nspeed neck deep jane\n\non deck with no grease trap\n\nhigh stakes that\n\none take track\n\ncan’t fake that\n\nkind of back go bang bang\n\nstay strapped\n\nflag full of backslide\n\nbye bye\n\ndo me cause it sounds tight\n\nstreaky on the outside\n\noh my yah\n\noh my yah\n\nstreaky on the outside\n\nstand by\n\ndealer holding franchise\n\nbye bye\n\ndo me cause it sounds tight\n\nbooty on the outside\n\noh my yah\n\noh my yah\n\noh my yah\n\ncarriage in a pinstripe\n\ngood to paraglide\n\nclarify\n\nserving dual tailpipes\n\nstick shift stunt drive\n\nturning on her tail lights\n\nsail like\n\nlearn you how to did right\n\nbounce with no downside\n\ndown for that joy ride\n\nghost ride\n\nbout it do it low ride\n\nbuddha like a cheetah fly\n\nbonafide creep or die\n\nstreaky on the outside\n\nstand by\n\ndealer holding franchise\n\nsouthside\n\ndo me cause it sounds tight\n\nstreaky on the outside\n\noh my yah\n\noh my yah\n\nbooty on the outside\n\nstand by\n\ndealer holding franchise\n\nsouthside\n\ndo me cause it sounds tight\n\nbooty on the outside\n\noh my yah\n\ndon’t throw it on the ground\n\nyah\n\ntake me to the bank\n\ncertified amount\n\nhow i heard about\n\nshe’s a walkabout\n\ndream time announced\n\ndon’t leave your shit around\n\nwhat\n\ntake me to the bank\n\ncertified amount\n\nhow i heard about\n\nshe’s a walkabout\n\ndream time announced\n\nstreaky on the outside\n\nflag full of backslide\n\nbye bye\n\ndo me cause it sounds tight\n\nstreaky on the outside\n\noh my yah\n\noh my yah\n\nstreaky on the outside\n\noh my yah\n\noh my yah\n\nstreaky on the outside\n\nstand by\n\ndealer holding franchise\n\nbye bye\n\ndo me cause it sounds tight\n\nbooty on the outside\n\noh my yah\n\noh my yah\n\noh my yah\n\nbooty on the outside",
        "created_utc": 1533913653,
        "label": [
            0
        ]
    },
    "971t5r": {
        "title": "Grimes is featured on a track from Jimmy Urine's (Mindless Self Indulgence) new album EURINGER, out October 19th",
        "body": "",
        "created_utc": 1534191765,
        "label": [
            0
        ]
    },
    "97vi20": {
        "title": "[Pre-Release Stream] Echo Beds - Buried Language",
        "body": "",
        "created_utc": 1534448732,
        "label": [
            0
        ]
    },
    "97zfso": {
        "title": "[New Album] Uniform - The Long Walk",
        "body": "",
        "created_utc": 1534481476,
        "label": [
            0
        ]
    },
    "984oee": {
        "title": "Three Demos by Julee Cruise out now",
        "body": "",
        "created_utc": 1534530199,
        "label": [
            0
        ]
    },
    "984r25": {
        "title": "[No Spoilers] Three Demos + The Voice of Love reissue by Julee Cruise, and new album from Uniform (featured in Season 3's soundtrack) out now",
        "body": "Three Demos:\n\nhttps://juleecruisesb.bandcamp.com/album/three-demos\n\nhttps://www.sacredbonesrecords.com/collections/frontpage/products/sbr3027-julee-cruise-three-demos\n\nThe Voice of Love:\n\nhttps://www.sacredbonesrecords.com/collections/frontpage/products/sbr3026-julee-cruise-the-voice-of-love\n\nUniform - The Long Walk:\n\nhttps://www.sacredbonesrecords.com/collections/frontpage/products/sbr204-uniform-the-long-walk\n\nhttps://unifuckingform.bandcamp.com/album/the-long-walk",
        "created_utc": 1534530713,
        "label": [
            0
        ]
    },
    "98oerc": {
        "title": "[IIL] [Music] Deafheaven, Thou, Bosse-de-Nage, Weakling, [WEWIL?] [Metal only]",
        "body": "",
        "created_utc": 1534719484,
        "label": [
            0
        ]
    },
    "98v2me": {
        "title": "Street Sects announce new album The Kicking Mule, release first single In for a World of Hurt",
        "body": "",
        "created_utc": 1534782457,
        "label": [
            0
        ]
    },
    "9ds1fe": {
        "title": "Conan with gaming legend Hideo Kojima",
        "body": "",
        "created_utc": 1536306261,
        "label": [
            0
        ]
    },
    "9dwhlk": {
        "title": "Brief review of the Berlin show via Crack Magazine",
        "body": "",
        "created_utc": 1536340982,
        "label": [
            0
        ]
    },
    "9e0nje": {
        "title": "Andy’s using Ableton in Brussels",
        "body": "",
        "created_utc": 1536371926,
        "label": [
            0
        ]
    },
    "9fmx1z": {
        "title": "If you have a Collapse EP download code, it can now be redeemed",
        "body": "Thought it might be a good idea to make this post in case people were waiting for midnight EST in the US.",
        "created_utc": 1536880848,
        "label": [
            0
        ]
    },
    "9fu8f1": {
        "title": "[Music][IYL] Ariel Pink, Tame Impala, [YML] The Holydrug Couple",
        "body": "",
        "created_utc": 1536947868,
        "label": [
            0
        ]
    },
    "9j5cin": {
        "title": "SRSQ - Cherish",
        "body": "",
        "created_utc": 1537987876,
        "label": [
            0
        ]
    },
    "9jsqr0": {
        "title": "Got my test pressing today, never received shipping confirmation.",
        "body": "",
        "created_utc": 1538184853,
        "label": [
            0
        ]
    },
    "9k41t0": {
        "title": "Macbook keeps getting interrupted when trying to sleep once the touch bar stops working",
        "body": "I've been having issues with the play button on my touch bar for a while, but having it prevent me from being able to put the Macbook to sleep is new.\n\nI can get it working again if I restart, but eventually whatever's causing the touch bar to malfunction happens again.\n\nAre there any known causes for this issue aside from Chrome? Because I've tried closing Chrome to fix the issue but that doesn't help.",
        "created_utc": 1538287072,
        "label": [
            0
        ]
    },
    "9nfohf": {
        "title": "Is anyone filming the festival sets this weekend?",
        "body": "There was some great footage from the EU tour.\n\nHope there's some people out there doing the same for Afropunk Atlanta and Desert Daze.",
        "created_utc": 1539305208,
        "label": [
            0
        ]
    },
    "9ni0c7": {
        "title": "HEALTH x Perturbator - BODY/PRISON",
        "body": "",
        "created_utc": 1539326993,
        "label": [
            0
        ]
    },
    "9pp3bd": {
        "title": "[IIL] [Film] Mandy, Hereditary, Halloween (2018), [WEWIL?] (2018 movies only)",
        "body": "",
        "created_utc": 1539991370,
        "label": [
            0
        ]
    },
    "9rhfpi": {
        "title": "YOTS instrumental version no longer available in the US on SoundCloud",
        "body": "https://soundcloud.com/deathgrips/death-grips-year-of-the-snitch-instrumental-version\n\nLuckily I already have it downloaded.\n\nAnyone have any idea why this happened? Was it automatic or did DG deliberately make it unavailable?",
        "created_utc": 1540526496,
        "label": [
            0
        ]
    },
    "9tgxj3": {
        "title": "Thought Gang - S/T out now on Spotify",
        "body": "",
        "created_utc": 1541132576,
        "label": [
            0
        ]
    },
    "9vm1pc": {
        "title": "HEALTH x Youth Code - Innocence",
        "body": "",
        "created_utc": 1541782153,
        "label": [
            0
        ]
    },
    "9xpvde": {
        "title": "Demolition shirt just shipped",
        "body": "For anyone worried the shirts might be late, looks like they're going out today.",
        "created_utc": 1542400107,
        "label": [
            0
        ]
    },
    "9zqs7g": {
        "title": "Grindfeld - 5 Songs About Nothing out now",
        "body": "Not on Spotify or YouTube at the moment, but it’s only $5 on Bandcamp.\n\nhttps://grindfeld.bandcamp.com/album/5-songs-about-nothing",
        "created_utc": 1542998237,
        "label": [
            0
        ]
    },
    "a1y3ky": {
        "title": "[IYL] [Music] Die Antwoord, Danny Brown, JPEGMAFIA, [YML] Tommy Cash - ¥€$",
        "body": "Few songs to sample:\n\n[X-Ray](https://www.youtube.com/watch?v=K5kD_vYnbe4)\n\n[Mona Lisa](https://www.youtube.com/watch?v=INm_AzneoX8)\n\n[Black Jeans, White T-Shirt](https://www.youtube.com/watch?v=8hPxBGgTq-k)",
        "created_utc": 1543623681,
        "label": [
            0
        ]
    },
    "a2bhm3": {
        "title": "OMG inspired",
        "body": "",
        "created_utc": 1543737025,
        "label": [
            0
        ]
    },
    "a54uau": {
        "title": "[IIL][Music][Noise] Merzbow, Prurient, Pharmakon, Whitehouse/Consumer Electronics, Wolf Eyes, Dreamcrusher, [WEWIL?]",
        "body": "Particularly looking for artists that lean towards harsh noise rather than noise rock (such as Melt-Banana or Lightning Bolt), but artists with some rhythmic elements like Pharmakon, Wolf Eyes and Dreamcrusher are also welcome.",
        "created_utc": 1544514815,
        "label": [
            0
        ]
    },
    "aec2u2": {
        "title": "Alligator Blood (Original Version) has been added to Bandcamp",
        "body": "",
        "created_utc": 1547072096,
        "label": [
            0
        ]
    },
    "aga4u5": {
        "title": "Venereology remaster (with 20+ minutes of unreleased material) coming March 1st",
        "body": "",
        "created_utc": 1547569026,
        "label": [
            0
        ]
    },
    "amae2j": {
        "title": "Boy Harsher - Careful (Full Album)",
        "body": "",
        "created_utc": 1549079081,
        "label": [
            0
        ]
    },
    "an6m45": {
        "title": "Vatican Shadow - Kneel Before Religious Icons (Remastered) | available now digitally via Bandcamp",
        "body": "",
        "created_utc": 1549315850,
        "label": [
            0
        ]
    },
    "anilbe": {
        "title": "Drug Apts debut album announced for 3/23 - Zach and Andy produced their first EP, their guitarist guested on Bodyguard",
        "body": "",
        "created_utc": 1549400156,
        "label": [
            0
        ]
    },
    "aoepuj": {
        "title": "HEALTH - THE MESSAGE",
        "body": "",
        "created_utc": 1549616394,
        "label": [
            0
        ]
    },
    "at5h3u": {
        "title": "[IIL] [Music] Gravediggaz, Three 6 Mafia, Hieroglyphics/Del, Wu-Tang, MF DOOM, [WEWIL?] ['80s - early '00s]",
        "body": "",
        "created_utc": 1550768403,
        "label": [
            0
        ]
    },
    "atdgd2": {
        "title": "HEALTH x JPEGMAFIA - HATE YOU",
        "body": "",
        "created_utc": 1550812341,
        "label": [
            0
        ]
    },
    "aw11p2": {
        "title": "GTA Online: Arena War soundtrack out now",
        "body": "",
        "created_utc": 1551417775,
        "label": [
            0
        ]
    },
    "b0blqx": {
        "title": "Physical Wash (Susan Subtract of High-Functioning Flesh) - Deprived [2019]",
        "body": "",
        "created_utc": 1552417328,
        "label": [
            0
        ]
    },
    "b1jz6c": {
        "title": "Elizabeth Colour Wheel - Hide Behind (Emmett's Song)",
        "body": "",
        "created_utc": 1552682755,
        "label": [
            0
        ]
    },
    "b1k9vd": {
        "title": "Automelodi - Les Métros Disparus (feat. Liz Wendelbo of Xeno &amp; Oaklander)",
        "body": "",
        "created_utc": 1552684303,
        "label": [
            0
        ]
    },
    "b1v22r": {
        "title": "Crown fell off of very short tooth (second molar, lower left), can’t see dentist until monday",
        "body": "So I’ve accepted at this point that I need gum surgery due how little tooth there is above the gumline for a crown to even attempt to bond to. I originally had this crown put in at the beginning of October, and it came off two weeks into February. I had it back on until last night.\n\nMy question is, is there anything I should do until I get in to see the dentist on monday? The crown is fully intact, but I’m sure that if I used over-the-counter dental cement it wouldn’t take longer than a day for it to come off again.\n\nShould I just try to keep the area clean and not chew with that side of my mouth? It doesn’t seem all that likely that my teeth would shift in only a couple of days if I don’t put the crown back on.",
        "created_utc": 1552758191,
        "label": [
            0
        ]
    },
    "b1xjg2": {
        "title": "Crown fell off my root canal-ed tooth, again. Can't see a dentist until monday.",
        "body": "So I’ve accepted at this point that I need gum surgery due how little tooth there is above the gumline for a crown to even attempt to bond to. I originally had this crown put in at the beginning of October, and it came off two weeks into February. I had it back on until last night.\n\nThankfully it's 100% intact and my gums didn't even bleed this time. But now I have to deal with not being able to fix the situation until monday at the earliest. I could try getting some dental cement, but it's hard for even professionals to keep this thing on with maximum strength cement. I'd imagine this over-the-counter stuff would probably be about as effective as the cement they used for the temporary crown, and that didn't even last for a day before it came off the first time.\n\nSo with no way of getting reassurance from my dentist, I have to sit here and hope there's no complication from having no crown on this tooth.",
        "created_utc": 1552771526,
        "label": [
            0
        ]
    },
    "b312mi": {
        "title": "Lust for Youth - Great Concerns",
        "body": "",
        "created_utc": 1553020620,
        "label": [
            0
        ]
    },
    "b3tbmt": {
        "title": "Vale - Final Flesh",
        "body": "",
        "created_utc": 1553189217,
        "label": [
            0
        ]
    },
    "b53tmj": {
        "title": "[IIL] [MUSIC] The Body, Gnaw Their Tongues, Godflesh/JK Flesh, [WEWIL?]",
        "body": "Similar artists I'm already into:\n\nStreet Sects, Author &amp; Punisher, Lingua Ignota, HIDE, Uniform, Echo Beds, Prurient, Merzbow, Pharmakon, Xiu Xiu",
        "created_utc": 1553473985,
        "label": [
            0
        ]
    },
    "b6fdlu": {
        "title": "Just feel like posting this somewhere for accountability's sake",
        "body": "Tomorrow I'm taking (relatively) huge steps towards getting my life back together, and I'm really looking forward to finally putting myself on a path to real progress after months and months of talking to my therapist about ways to motivate myself.\n\nFor the past 18+ months I've been feeding my anxiety and depression through endless procrastination. Letting messes pile up around my apartment that I only occasionally clean up (pretty much just the bare minimum) and wasting money ordering out because I'm just too lazy to make my own meals.\n\nThis is all due to me convincing myself that it would just be too hard to fix any of my problems at this point. I just put myself in a smaller and smaller box where I feel less and less capable. It gets to the point where I have trouble thinking of any positive change as a good thing. I'd much rather give myself the temporary comfort of putting off for some other day. The problem is I just end up back at square one when the comfort I've provided myself runs out again. It's a self-perpetuating cycle.\n\nSo tomorrow I'm breaking that cycle. I'm not looking at it as a negative, or the consequence of poor choices. It's the first steps on the path to who I want to be, because I've waited long enough. I might not get it perfect tomorrow, but I want to start somewhere.",
        "created_utc": 1553754667,
        "label": [
            0
        ]
    },
    "ba01jg": {
        "title": "New art from Zach",
        "body": "",
        "created_utc": 1554519568,
        "label": [
            0
        ]
    },
    "baxz08": {
        "title": "Spotify reopening itself after closing [2017 MacBook Pro w/ Touch Bar]",
        "body": "This has been happening off and on for a couple of weeks, and seems to have happened with iTunes as well at least once. No other apps have exhibited this behavior.\n\nWhat can I do to fix this?",
        "created_utc": 1554751587,
        "label": [
            0
        ]
    },
    "be3th7": {
        "title": "HEALTH x Ghostemane - JUDGEMENT NIGHT",
        "body": "",
        "created_utc": 1555476687,
        "label": [
            0
        ]
    },
    "be3tlg": {
        "title": "HEALTH x Ghostemane - JUDGEMENT NIGHT",
        "body": "",
        "created_utc": 1555476713,
        "label": [
            0
        ]
    },
    "beq4u4": {
        "title": "Thou on Audiotree Live (Full Session)",
        "body": "",
        "created_utc": 1555618257,
        "label": [
            0
        ]
    },
    "bgyrup": {
        "title": "Rainforest Spiritual Enslavement - Panama Canal Left-Hand Path available on Bandcamp",
        "body": "",
        "created_utc": 1556133658,
        "label": [
            0
        ]
    },
    "bkas8p": {
        "title": "[FRESH STREAM] Metal Swim 2 comp. featuring Baroness, Sunn O))), Eyehategod, The Body, Alien Weaponry and more",
        "body": "",
        "created_utc": 1556902887,
        "label": [
            0
        ]
    },
    "bref0k": {
        "title": "[FRESH] Drab Majesty - Long Division",
        "body": "",
        "created_utc": 1558465379,
        "label": [
            0
        ]
    },
    "brfrih": {
        "title": "Does anyone else get grossed out by Julia Roberts’ character going barefoot in the men’s restroom?",
        "body": "She was definitely standing in piss.\n\nHonestly, I’m not sure why she took them off in the forst place when she knew she’d be leaving before anything happened.",
        "created_utc": 1558472065,
        "label": [
            0
        ]
    },
    "brm2au": {
        "title": "gottagoogle just posted a video",
        "body": "",
        "created_utc": 1558513063,
        "label": [
            0
        ]
    },
    "btved2": {
        "title": "Ho99o9 x Ghostemane - TWIST OF FATE / COBRA",
        "body": "",
        "created_utc": 1559015803,
        "label": [
            0
        ]
    },
    "bu7s5u": {
        "title": "Prurient - Garden of the Mutilated Paratroopers 2x Cassette available for preorder",
        "body": "",
        "created_utc": 1559089303,
        "label": [
            0
        ]
    },
    "bwzgun": {
        "title": "[Music] [IIL] Hospital Productions' catalog, Pharmakon, Merzbow, Puce Mary, [WEWIL?] [Ambient/Noise/Experimental]",
        "body": "",
        "created_utc": 1559716313,
        "label": [
            0
        ]
    },
    "bx45qt": {
        "title": "Prurient - Screaming Eagles Airborne Graveyard [Noise] (2019)",
        "body": "",
        "created_utc": 1559750060,
        "label": [
            0
        ]
    },
    "bzevh6": {
        "title": "Street Sects - Goodbye Recidivist Road",
        "body": "",
        "created_utc": 1560271662,
        "label": [
            0
        ]
    },
    "bzv52q": {
        "title": "HIDE - Chainsaw (Official Video)",
        "body": "",
        "created_utc": 1560365777,
        "label": [
            0
        ]
    },
    "c22mmc": {
        "title": "[FRESH VIDEO] Drab Majesty - Oxytocin",
        "body": "",
        "created_utc": 1560866587,
        "label": [
            0
        ]
    },
    "c2a8aa": {
        "title": "You're doing great! 👍",
        "body": "",
        "created_utc": 1560904608,
        "label": [
            0
        ]
    },
    "c3hw2a": {
        "title": "Follow NTS Radio's Mixcloud if you're waiting for an archive of the broadcast",
        "body": "",
        "created_utc": 1561158296,
        "label": [
            0
        ]
    },
    "c3kcvg": {
        "title": "A certain part of Bottomless Pit's back cover seems a lot more relevant now",
        "body": "",
        "created_utc": 1561172146,
        "label": [
            0
        ]
    },
    "c4kj56": {
        "title": "Is it still depression if I don't consciously \"feel\" depressed all the time?",
        "body": "Some context:\n\nI was diagnosed with chronic major depression and generalized anxiety a little over 9 years ago after I had a nervous breakdown and stayed in the hospital long enough to be deemed stable. Before that I also had in-school guidance/therapy sessions in middle school and high school. I've been doing therapy off and on for the past 6-7 years with mixed results. I feel like I can gain some perspective, but at the same time not a lot of progress is made in terms of real life changes.\n\nNow on paper, I think my life sounds like it could be fairly depressing. I live alone, I have 0 friends, my apartment is almost always a mess and I spend most of my time either overthinking and stressing out due to my anxiety, or listening to music and ignoring my problems instead of doing something productive. The irony is that although I seem like an introvert, I actually thrive on socialization if I can actually get myself to talk to people. But I have an avoidant personality disorder as a result of my anxiety and the fact that I grew up with an older brother that constantly insulted and criticized me. So it's hard to feel like I deserve to be around other people. My self-esteem is just way too low.\n\nWhen I think about all of that, it makes me think I probably am depressed.\n\nThe thing is, I've always understood depression to mean that you can't enjoy anything at all. But there are things I do enjoy. I like music, movies, food and occasionally video games. I can still laugh and smile at things and it doesn't feel forced. So how can I call myself depressed if I only occasionally break down in tears?\n\nIt pretty much wasn't until I saw the last Avengers movie and how Thor was depicted and described as depressed that I thought I could accept that I'm usually more depressed than I think I am. Aside from the cause of his depression, I actually found his situation very relatable.\n\nSo I guess what I'm wondering is if it's common to not \"feel\" like you're depressed the way it's usually described/depicted, but still actually be depressed.\n\nCan anyone else relate?",
        "created_utc": 1561367257,
        "label": [
            0
        ]
    },
    "c4yleo": {
        "title": "Might have mysophobia?",
        "body": "[removed]",
        "created_utc": 1561420751,
        "label": [
            0
        ]
    },
    "c60sfs": {
        "title": "[FRESH] Lingua Ignota - Do You Doubt Me Traitor",
        "body": "",
        "created_utc": 1561608431,
        "label": [
            0
        ]
    },
    "c62b6f": {
        "title": "[IYL] Deafheaven, [YML] Loss of Self - Twelve Minutes",
        "body": "",
        "created_utc": 1561618866,
        "label": [
            0
        ]
    },
    "c7a64y": {
        "title": "Did he just say \"Turlington exits?\"",
        "body": "",
        "created_utc": 1561877209,
        "label": [
            0
        ]
    },
    "c7a8i8": {
        "title": "Presented without comment, from Bryan Cranston's Instagram (Potential Spoilers)",
        "body": "",
        "created_utc": 1561877763,
        "label": [
            0
        ]
    },
    "c7ab7h": {
        "title": "Presented without comment, from Bryan Cranston's Instagram (Potential Spoilers)",
        "body": "",
        "created_utc": 1561878362,
        "label": [
            0
        ]
    },
    "cb0irj": {
        "title": "Pharmakon - Self-Regulating System",
        "body": "",
        "created_utc": 1562676986,
        "label": [
            0
        ]
    },
    "cb3hkg": {
        "title": "Pharmakon - Self-Regulating System [Power Electronics]",
        "body": "",
        "created_utc": 1562691334,
        "label": [
            0
        ]
    },
    "cb563b": {
        "title": "Body of Light - Don't Pretend",
        "body": "",
        "created_utc": 1562698733,
        "label": [
            0
        ]
    },
    "cccmpz": {
        "title": "Prurient - Garden of the Mutilated Paratroopers | out now on Bandcamp",
        "body": "",
        "created_utc": 1562946835,
        "label": [
            0
        ]
    },
    "cccnfg": {
        "title": "Prurient - Garden of the Mutilated Paratroopers [Noise]",
        "body": "",
        "created_utc": 1562946933,
        "label": [
            0
        ]
    },
    "cch4ky": {
        "title": "[No Spoilers] Is there anyone who loved Hereditary but disliked Midsommar? Trying to decide if I should make seeing it a priority.",
        "body": "I would have posted this in the discussion thread, but I'm trying to avoid spoilers.\n\nHereditary was my 3rd favorite movie last year after Mandy and Suspiria, but after seeing some mixed opinions I'm not so sure if I should see Midsommar now or wait to rent it when it'll be cheaper.\n\nThe trailers didn't thrill me, but neither did the trailer for Hereditary and that turned out great. I am worried there won't be anything as interesting as the concept behind Hereditary. From what I can tell the premise seems to be way more straightforward, and if that's the case I'm not so sure I'll be able to enjoy it as much.\n\nWithout giving anything away, is there more to the movie beyond relationship drama and ritualistic violence?",
        "created_utc": 1562967976,
        "label": [
            0
        ]
    },
    "cd02so": {
        "title": "I hate my “heavy head feeling” headaches",
        "body": "Started getting them as my anxiety and depression worsened after moving out on my own without roommates a couple years ago.\n\nHad no idea what it was for a while because it doesn’t seem to come up as frequently as other anxiety symptoms.\n\nNot as freaked out about them as I used to be, but still annoying because they’re pretty distracting.",
        "created_utc": 1563087313,
        "label": [
            0
        ]
    },
    "ce35tf": {
        "title": "Does the \"last pound\" scene irritate anyone else?",
        "body": "The fact that Chandler picks at every one of Monica's insecurities (including her issues with her parents) all with the specific purpose of making her depressed (even remarking how impressed he is that she can even get out of bed) until she finally shuts down to take a nap on the couch. It just feels really shitty. And he only did it because he didn't want to exercise anymore. It was totally selfish and meanspirited.",
        "created_utc": 1563311665,
        "label": [
            0
        ]
    },
    "ce3i34": {
        "title": "A timeline feature similar to social media apps for new releases?",
        "body": "Would anyone else find this useful? I realize Bandcamp sends out emails for new releases from artists you follow, but I would find it very convenient to have a continuous list of these releases all in one tab/page on the site.",
        "created_utc": 1563313265,
        "label": [
            0
        ]
    },
    "cf012r": {
        "title": "Wreck and Reference - Absolute Still Life [Electronic] (2019)",
        "body": "",
        "created_utc": 1563492871,
        "label": [
            0
        ]
    },
    "cf4l7g": {
        "title": "Zach w/ Mark Mothersbaugh",
        "body": "",
        "created_utc": 1563521719,
        "label": [
            0
        ]
    },
    "chiv7d": {
        "title": "[IIL] [Music] Orville Peck, Roy Orbison, Jeff Buckley/Tim Buckley, Chris Isaak, [WEWIL?]",
        "body": "",
        "created_utc": 1564028389,
        "label": [
            0
        ]
    },
    "ci6j0z": {
        "title": "Vatican Shadow - Byzantine Private CIA (Remastered)",
        "body": "",
        "created_utc": 1564165571,
        "label": [
            0
        ]
    },
    "cia6zx": {
        "title": "Just a friendly warning to avoid the post titled \"I Learned 14 Creepy And Strange Facts That Have Literally Had My Jaw On The Floor All Day Long\" on BuzzFeed",
        "body": "There are a few health-related entries on the list that are better left alone.",
        "created_utc": 1564183743,
        "label": [
            0
        ]
    },
    "cmjh2w": {
        "title": "[IIL] [Metal] ‘80s, ‘90s, ‘00s metal playlists, [WEWIL?]",
        "body": "Specifically looking for playlists that include:\n\nDeath\n\nBlack\n\nThrash\n\nSludge\n\nGrindcore\n\nDoom",
        "created_utc": 1565051571,
        "label": [
            0
        ]
    },
    "cmjii7": {
        "title": "[IIL] [Music] ‘80s, ‘90s, ‘00s metal playlists on Spotify, [WEWIL?]",
        "body": "Specifically looking for playlists that include:\n\nDeath\n\nBlack\n\nThrash\n\nSludge\n\nGrindcore\n\nDoom",
        "created_utc": 1565051784,
        "label": [
            0
        ]
    },
    "cnyvlp": {
        "title": "[FRESH EP] Mamaleek - Cadejos",
        "body": "",
        "created_utc": 1565334966,
        "label": [
            0
        ]
    },
    "cu9700": {
        "title": "Vatican Shadow - Pakistan Military Academy (Remastered)",
        "body": "",
        "created_utc": 1566536413,
        "label": [
            0
        ]
    },
    "cyyci0": {
        "title": "[IIL] [Music] Metal, Industrial, Noise, IDM, Darkwave, Post-Punk and the following artists/labels, [WEWIL?]",
        "body": "Favorite labels:\n\nThe Flenser\n\nDais\n\nHospital Productions\n\nSacred Bones\n\nProfound Lore\n\nDeathbomb Arc\n\nPosh Isolation\n\n---\n\nArtists:\n\nDeath Grips, Aphex Twin, Björk, HEALTH, Street Sects, Uniform, Youth Code, Zola Jesus, Arca, Lingua Ignota, Devil Master, Thou, Nicole Dollanganger, Alice Glass, Merzbow, Prurient/Vatican Shadow, The Body, Full of Hell, Pissgrave, Vale, HIDE, Alberich, Pharmakon, Wreck and Reference, Type O Negative, Eyehategod, Power Trip, Oozing Wound, Elizabeth Colour Wheel, Deafheaven, Portrayal of Guilt, Succumb, Chelsea Wolfe, Them Are Us Too/SRSQ, Boy Harsher, TR/ST, Drab Majesty, Pictureplane, 3Teeth, JPEGMAFIA, Ghostemane, IC3PEAK, Author &amp; Punisher, Godflesh, Skinny Puppy/ohGr, Big Black, Nine Inch Nails, My Bloody Valentine, Cocteau Twins, Joy Division\n\n---\n\nOther artists I've listened to a lot the past couple years:\n\nHave a Nice Life, All Your Sisters, Body of Light, Mamaleek, Primitive Man, Xiu Xiu, Crowhurst, dälek, Cult Leader, Echo Beds, Vein, Nails, The Soft Moon, Cold Cave, Statiqbloom, Coil, Ghost, Choir Boy, Wolf Eyes, Ho99o9, Atari Teenage Riot, Front 242, SPELLLING, Blanck Mass, Daughters, Bosse-de-Nage",
        "created_utc": 1567475114,
        "label": [
            0
        ]
    },
    "czh01t": {
        "title": "Portrayal of Guilt - Sacrificial Rite",
        "body": "",
        "created_utc": 1567577814,
        "label": [
            0
        ]
    },
    "dan80p": {
        "title": "The problem with BL3’s plot [FULL SPOILERS]",
        "body": "The main problem with BL3’s plot is that there was no reason for us to open the vaults. Lilith claims that it’s “more complicated” than just fighting the Calypsos directly, but is it really? Nothing about opening the vaults makes taking down the Calypsos any easier. If anything, it just makes them *more* powerful (since Troy and Tyreen get Maya and the Rampager’s powers). Even the device to contain the Destroyer gets us nowhere since Tyreen sabotages it before it could be put to use. After everything we just end up fighting the Calypsos anyway.\n\nContrast this with BL2’s plot:\n\n- We can’t kill Jack right away because we don’t have access to Helios\n\n- Next best thing is getting the vault key back\n\n- Due to bad intel we end up with a power cell that gets Sanctuary’s defenses compromised\n\n- Now we have to go the bunker for the key\n\n- After defeating BNK3R and killing Angel, Jack kills Roland and takes Lilith to the vault to finish charging the key\n\n- We have to find out where the vault is and defeat Jack &amp; the Warrior\n\n\nTechnically we could have found out where the vault was first and just waited for Jack, but the easier option at the beginning of the plot was to follow the intel on the vault key being transported. After that we find out where the vault key is actually located and that becomes the more obvious choice rather than going to the vault and risking the possibility of Jack opening the vault with a fully charged key.\n\nI don’t think this affects BL3’s quality, but it is weird to think how unnecessary the plot ended up being.",
        "created_utc": 1569711743,
        "label": [
            0
        ]
    },
    "dbp6ra": {
        "title": "Lilith’s default expression",
        "body": "Why did they choose to have Lilith smile constantly by default? Makes it kinda difficult to feel the gravity of her more serious dialogue moments when she goes right back to smiling once she finishes each line.",
        "created_utc": 1569910925,
        "label": [
            0
        ]
    },
    "ddhww6": {
        "title": "Prurient - Noise for Halloween Night [Noise / Electronic] (2019)",
        "body": "",
        "created_utc": 1570245802,
        "label": [
            0
        ]
    },
    "ddi6h8": {
        "title": "Vatican Shadow - Church of All Hallows' Eve [Techno / Industrial / Ambient] (2019)",
        "body": "",
        "created_utc": 1570247425,
        "label": [
            0
        ]
    },
    "djacb6": {
        "title": "Street Sects - \"Fourteen Frames\" (feat. Nick Sadler &amp; Lingua Ignota) (Official Video directed by Seth Sher of HIDE)",
        "body": "",
        "created_utc": 1571336279,
        "label": [
            0
        ]
    },
    "dpbag6": {
        "title": "[IIL] [Music] [Industrial / Noise / Experimental] [Record Labels] Hospital Productions, Total Black, No Rent, [WEWIL?] [Bandcamp Only]",
        "body": "If you have some pre-2010s artists (beyond Merzbow, Throbbing Gristle, Whitehouse, etc.) to recommend, that would also be appreciated.",
        "created_utc": 1572462899,
        "label": [
            0
        ]
    },
    "dy6v4s": {
        "title": "Street Sects - If Life is a Gift, It's in Very Poor Taste",
        "body": "",
        "created_utc": 1574100535,
        "label": [
            0
        ]
    },
    "dzwfoe": {
        "title": "SRSQ - Temporal Love",
        "body": "",
        "created_utc": 1574399969,
        "label": [
            0
        ]
    },
    "e69iu7": {
        "title": "Painjerk - Mission Invisible (recorded in 1997, unreleased until now)",
        "body": "",
        "created_utc": 1575508827,
        "label": [
            0
        ]
    },
    "ec0kvw": {
        "title": "I realized today that the idea people genuinely want me around is a concept I’ve never fully considered",
        "body": "I’ve always felt kindness from others is either an obligation or simply based on the “fake” version of myself I try to present to protect my deeper thoughts and feelings.\n\nSo my perception is totally warped to fit this conclusion. People only try to include me because they feel obligated, this person wouldn’t like me if I really opened up, they must have some ulterior motive, etc.\n\nI’ve pushed away friendships, potential relationships and so many opportunities to feel better because everything has to conform to this belief that nobody wants me around. It’s the reason I keep myself isolated. Because I don’t want to burden others with my presence.\n\nI’ve really wasted so much of my life believing this shit.",
        "created_utc": 1576610945,
        "label": [
            0
        ]
    },
    "efj2va": {
        "title": "[IIL] [Music] [Power Electronics] Deathpile, Slogun, BLOODYMINDED, Whitehouse/Consumer Electronics, [WEWIL?] (artists originating in the '90s-'00s)",
        "body": "",
        "created_utc": 1577294598,
        "label": [
            0
        ]
    },
    "eg6411": {
        "title": "[help] Chrome is blocking the download of one specific album on Bandcamp",
        "body": "I have downloaded literally hundreds of releases from Bandcamp over the years (some of which I was the first to download) without any problems up until now. But there's 1 album I just bought which Chrome is warning me could be malicious due to it being an uncommon download and I'm baffled. The other album I bought from the *same artist* at the *same time* downloaded just fine. I tried re-downloading other albums and I also tried restarting Chrome. Same result. It's just this specific album.\n\nWhat exactly is the criteria for Chrome to decide an uncommon download is potentially malicious? Does it matter that the artist lives in the UK?",
        "created_utc": 1577419847,
        "label": [
            0
        ]
    },
    "ekoxlv": {
        "title": "deathbed tapes - R.I.P. GUTS PAIN SCREAM \"12 tracks plus 5 bonus tracks, all recorded with a Death Metal pedal as the only effect.\"",
        "body": "",
        "created_utc": 1578285624,
        "label": [
            0
        ]
    },
    "eoei4h": {
        "title": "[IIL] [Music] [Electronic] Vatican Shadow, Regis, Arca, Blanck Mass, Squarepusher, Muslimgauze, Aphex Twin (+ more listed in post), [WEWIL?]",
        "body": "E-Saggila\n\nFilmmaker\n\nVenetian Snares\n\nFire-Toolz\n\nJK Flesh\n\nOil Thief\n\nArca\n\nHiro Kone\n\nYves Tumor\n\nLSDXOXO\n\nNinos du Brasil\n\nCroatian Amor\n\nFuck Buttons\n\nMachine Girl\n\nGuilt Attendant / Nathaniel Young\n\nOcto Octa\n\nKelly Moran\n\nμ-Ziq",
        "created_utc": 1578967678,
        "label": [
            0
        ]
    },
    "epmppe": {
        "title": "Mamaleek - Eating Unblessed Meat",
        "body": "",
        "created_utc": 1579196663,
        "label": [
            0
        ]
    },
    "eqm9ue": {
        "title": "[TOMT] [Game] [PS1] 3rd person alien shooter with disturbing intro cinematic",
        "body": "[removed]",
        "created_utc": 1579381249,
        "label": [
            0
        ]
    },
    "erlbp1": {
        "title": "Meeting a psychiatrist to be evaluated for meds and I’m worried about minimizing my condition",
        "body": "About 10 years ago I had a mental breakdown (closest thing it could be compared to is a manic episode) which lasted for about a week and a half. I spent a few days under observation at the hospital and saw a psychiatrist as an outpatient. I was diagnosed with GAD, chronic major depression and pervasive developmental disorder. I was given two non-refill prescriptions which I felt no effect from after taking them for two weeks.\n\n\nAfter relying solely on seeing therapists for the past 10 years with minimal progress I’m trying to get myself out of this rut I’ve been in for the past 4 years by trying medication again.\n\n\nThe problem is that I have a real issue with imposter syndrome when it comes to my mental health. I feel guilty even describing myself as suffering from anxiety and depression because I don’t get panic attacks and technically I can get myself out of bed and out of the apartment. I can have conversations. I can interact with people when I have to. And it’s not like I’m sad 24/7. I enjoy music, movies/TV and food. It’s more like I just have negative thoughts about myself and I don’t really have strong feelings about much of anything anymore. It’s just easier to not care rather than get my hopes up and be disappointed. I often notice other people be passionate about things and I just can’t relate, aside from maybe with music and movies. But even then people find ways to talk about stuff with so much passion and I just have nothing to say.\n\n\nSo it’s that kind of thing I deal with. Just the comfort of not caring. I do get overwhelmed with sadness on occasion, but usually it’s more like background noise or just a general feeling of negativity that drags me down and keeps me from feeling good enough about myself.\n\n\nBut while I can technically get myself through conversations, I barely ever let myself be an active participant. And I definitely don’t open up. I never feel like the real me when I’m with other people. I’d rather edit myself to the most agreeable version possible. Generally I just feel like my presence is a burden on others.\n\n\nI also of course deal with a lot of second guessing and jumping to conclusions. I overestimate risks and avoid really having a life at all because of it. I’m completely isolated with no friends. And I’ve had plenty of opportunities to change this. I just can’t convince myswlf I’m good enough.\n\n\nBut one of the most frustrating things overall is that I can fully understand what I’m doing wrong and how I should fix it, but the next day I can’t follow through and just end up falling into my usual habits. This is the main problem I’ve been having with therapy. It doesn’t matter what strategies my therapist and I come up with. My dysfunctional brain will just ignore it the next day because I wake up feeling like it’s impossible to start the day. Then once I do start the day I do nothing productive because I feel like I need to do stuff like eat, listen to music and browse the internet as a way to stave off feeling miserable about myself. I mean basically I just spend every day trying to avoid thinking about myself for as long as possible because it always just makes me overwhelmed with sadness again.\n\n\nSo this is why I think I need medication. I have this huge roadblock to progress that no amount of talking or coming up with plans of action will help. It’s not something I can reason with. And doing things like keeping my phone out of the bedroom are only good enough for getting me out of bed.",
        "created_utc": 1579561163,
        "label": [
            0
        ]
    },
    "etcd8i": {
        "title": "How's this for failing? Day 1 of a new prescription and I dropped all the tablets on my dirty kitchen floor.",
        "body": "Already called for a replacement, but damn do I feel stupid.\n\nGuess this is what happens when I try to do things before I'm fully awake. Trying to stay positive and laugh about it.",
        "created_utc": 1579881984,
        "label": [
            0
        ]
    },
    "ew0d5t": {
        "title": "Uniform - Awakening",
        "body": "",
        "created_utc": 1580361770,
        "label": [
            0
        ]
    },
    "ewji7w": {
        "title": "Pink Gloves - Where is Your Love",
        "body": "",
        "created_utc": 1580448376,
        "label": [
            0
        ]
    },
    "f31tna": {
        "title": "Cursed Earth Cassettes have had their Bandcamp page unceremoniously deleted",
        "body": "",
        "created_utc": 1581556596,
        "label": [
            0
        ]
    },
    "f7v921": {
        "title": "[IIL] [Music] [Metal] Full of Hell, Portrayal of Guilt, Thou, Devil Master, Pissgrave, Eyehategod, Oozing Wound, Primitive Man, Tomb Mold, Death, Mayhem, Witch Vomit, Gatecreeper, Power Trip, Nails, Sarcófago, Mortician, Cult Leader, Mystifier, Wolves in the Throne Room, Crowhurst, Ildjarn, [WEWIL?]",
        "body": "",
        "created_utc": 1582390925,
        "label": [
            0
        ]
    },
    "fgo223": {
        "title": "Stress Orphan - Block Captain",
        "body": "",
        "created_utc": 1583885809,
        "label": [
            0
        ]
    },
    "fgpqeo": {
        "title": "Ro - On",
        "body": "",
        "created_utc": 1583892777,
        "label": [
            0
        ]
    },
    "fm57kz": {
        "title": "AGFA (American Genre Film Archive) is starting a video series on various movies while theaters are closed called AGFA Secret Society. Episode 1 is Sorority House Massacre.",
        "body": "",
        "created_utc": 1584747338,
        "label": [
            0
        ]
    },
    "fnw4n1": {
        "title": "Laureate - Eurekaphilia",
        "body": "",
        "created_utc": 1585012572,
        "label": [
            0
        ]
    },
    "fp0vhf": {
        "title": "Harsh Noise Support Network is live until 10:30 PM EDT with Spreaders, niku daruma, JHK and Many Blessings",
        "body": "",
        "created_utc": 1585179537,
        "label": [
            0
        ]
    },
    "fpg6nt": {
        "title": "Limbs Bin &amp; Friends - L.I.M.B.S. B.I.N. (Loving Intervention Mid-Breakout Shock - Blasting Immolates Nightmares)",
        "body": "",
        "created_utc": 1585245390,
        "label": [
            0
        ]
    },
    "fs88s1": {
        "title": "Terror Cell Unit - Psalm 137:9",
        "body": "",
        "created_utc": 1585638048,
        "label": [
            0
        ]
    },
    "fshrhp": {
        "title": "Prurient - Casablanca Flamethrower",
        "body": "",
        "created_utc": 1585677657,
        "label": [
            0
        ]
    },
    "ftyyo9": {
        "title": "[IIL] [Music] ‘90s Crust Punk, Sludge, Grindcore, Powerviolence, [WEWIL?]",
        "body": "Looking for bands within these genres from the ‘90s (though late ‘80s and early ‘00s work too).\n\nBands I already know:\n\nNapalm Death\n\nLeftöver Crack\n\nCrass\n\nEyehategod\n\nDischarge\n\nSpazz\n\nAnti Cimex\n\nDisrupt\n\nDystopia\n\nAcid Bath\n\nHis Hero is Gone\n\nDropdead",
        "created_utc": 1585877226,
        "label": [
            0
        ]
    },
    "fvlrfj": {
        "title": "Andy posted that a2b2 image from a couple years ago to his IG story",
        "body": "",
        "created_utc": 1586122052,
        "label": [
            0
        ]
    },
    "g5b7f8": {
        "title": "Sonic Warfare II - New compilation from Black Ring Rituals",
        "body": "",
        "created_utc": 1587456359,
        "label": [
            0
        ]
    },
    "gb23gp": {
        "title": "Painjerk has joined Bandcamp",
        "body": "",
        "created_utc": 1588273855,
        "label": [
            0
        ]
    },
    "ggb86b": {
        "title": "Defaced Creation - Baptised in Fire",
        "body": "",
        "created_utc": 1589010298,
        "label": [
            0
        ]
    },
    "ggwzdj": {
        "title": "Choir Boy - Shatter",
        "body": "",
        "created_utc": 1589095435,
        "label": [
            0
        ]
    },
    "gsd0oh": {
        "title": "Dropdead Premiere “Nothing Remains” Single Via the Decibel Flexi Series",
        "body": "",
        "created_utc": 1590694362,
        "label": [
            0
        ]
    },
    "gt1p48": {
        "title": "Eric Clapton's \"It's in the Way That You Use It\" is referenced as a montage song in this random R&amp;M video from 2016",
        "body": "",
        "created_utc": 1590787680,
        "label": [
            0
        ]
    },
    "gy5vq3": {
        "title": "Gnawed - Subterranean Rites",
        "body": "",
        "created_utc": 1591504210,
        "label": [
            0
        ]
    },
    "hdzwzl": {
        "title": "It's officially been 1 year since Death Grips' last social media post",
        "body": "",
        "created_utc": 1592857021,
        "label": [
            0
        ]
    },
    "ht62r6": {
        "title": "[IIL] [Music] Bandcamp labels for electronic music, [WEWIL?]",
        "body": "I'm looking for labels that primarily operate on Bandcamp/bigcartel and mostly have electronic artists in their discography/on their roster.\n\nHere are two examples:\n\nhttps://biterecords.bandcamp.com/music\n\nhttps://liesrecords.bandcamp.com/",
        "created_utc": 1595027412,
        "label": [
            0
        ]
    },
    "i4ebv5": {
        "title": "[IIL] [Music] Psychedelic rock like Christine 23 Onna and Religious Knives (examples in the post), [WEWIL?]",
        "body": "[Christine 23 Onna](https://www.youtube.com/watch?v=ZIc-yTFfwcU)\n\n[Religious Knives](https://www.youtube.com/watch?v=XWUSNFsP8VY)",
        "created_utc": 1596663074,
        "label": [
            0
        ]
    },
    "iqlf3o": {
        "title": "Uniform - Life in Remission",
        "body": "",
        "created_utc": 1599806335,
        "label": [
            0
        ]
    },
    "jwrq83": {
        "title": "New Pro Unlimited subscription by DG SoundCloud account",
        "body": "",
        "created_utc": 1605744200,
        "label": [
            0
        ]
    },
    "kk8djz": {
        "title": "Songs in certain album repeat the final second of audio when played in the Music app. iPhone mini 12, iOS 14.3",
        "body": "I have this .mp3 album (downloaded outside the iTunes store/Apple Music ecosystem) which after switching to my new phone now repeats the final second at the end of each track. My previous phone was an iPhone 7 Plus and was on the previous music app from an older iOS (might have been 13). I had no problem with this album on that phone. The same files still play fine in iTunes on my Macbook, and I’ve tried removing the tracks from the phone and re-syncing as well as updating the system software. Other albums are fine on my phone, I’m thinking this might have something to do with the album’s tracks being designed to play seamlessly. Somehow that must be doing something w/ the app.",
        "created_utc": 1608939727,
        "label": [
            0
        ]
    },
    "n95urv": {
        "title": "Reminder that today isn't Stefan's birthday",
        "body": "[Tweet from his brother in 2016](https://twitter.com/swankfyre/status/730100082138222593?s=19)",
        "created_utc": 1620656720,
        "label": [
            0
        ]
    },
    "o4nemp": {
        "title": "Industrial Hazard - Harsh Lashings",
        "body": "",
        "created_utc": 1624251188,
        "label": [
            0
        ]
    },
    "p2vwh2": {
        "title": "Morty might run away to live at the Citadel in the Season 5 finale [S5E8 spoilers]",
        "body": "We know that Morty feels like he doesn’t belong and that nobody listens to him from the Planetina episode. The rift between Rick and Morty has also been growing lately and will be confronted in the finale.\n\nI think Rick will reveal to Morty that they’re not from the same dimension (C-137 Rick is from a dimension that never had a Morty), so for that reason he “doesn’t care” about him.\n\nThis will leave Morty realizing he’s not the “Mortyest Morty” and feeling like he has no reason to stay. So he’ll go somewhere he at least knows there are other Mortys he can relate to.\n\nThis could also potentially lead to him catching the attention of Evil Morty who could take him under his wing and fully corrupt him against the rest of his family.\n\nRick would then have to go to the Citadel to get Morty back, but may not have an easy time doing so because Evil Morty could remove any tracking device he might have planted on Morty.\n\nI could be (and probably am) way off with this, but it’s the finale I’d like to see and would justify the double length of the episode.",
        "created_utc": 1628758128,
        "label": [
            0
        ]
    },
    "piturv": {
        "title": "Do you think the real reason C-137 Rick... [S5E10 FINALE SPOILERS]",
        "body": "And the Council of Ricks had a falling out was over him hunting the Rick that killed his family?\n\nThis could also be why they were so quick to believe he was the one killing Ricks in Close Rick-counters. They knew he had a history of killing Ricks.",
        "created_utc": 1630909499,
        "label": [
            0
        ]
    },
    "q2ddqq": {
        "title": "Skvm - Voidwailer (raw black metal/rabm)",
        "body": "",
        "created_utc": 1633495875,
        "label": [
            0
        ]
    },
    "qmysh6": {
        "title": "New Merzbow remaster - Noisembryo / Noise Matrix",
        "body": "",
        "created_utc": 1636071697,
        "label": [
            0
        ]
    },
    "qocjlg": {
        "title": "Of Agony - Grim Existence (D-Beat) (2021)",
        "body": "https://ofagony.bandcamp.com/album/grim-existence",
        "created_utc": 1636243088,
        "label": [
            0
        ]
    },
    "qxrjw5": {
        "title": "Torn between libramasc, librafluid and libranonbinary",
        "body": "Sometime after figuring out that I'm agender, I found out about libramasc, etc. Given that I knew I have some attachment to masculinity despite not having gender, libramasc made sense to me.\n\nBut it still didn't *quite* feel right to me. Some of me also feels neither masculine or feminine, while a smaller part of me is drawn to femininity. It doesn't feel all the same at all times though. In some contexts I feel more masculine, in others I'd rather be expressing a more neutral or feminine energy.\n\nDoes this sound closer to librafluid or libranonbinary?",
        "created_utc": 1637362004,
        "label": [
            0
        ]
    }
}