{
    "8rcbbm": {
        "title": "Working in fresh sick",
        "body": "I'm scheduled today in produce (I'm in meats) and I'm pretty sick.  They can't make me work in foods right if I'm sick?  I'm going to try to weasel my way out of work with my ASM because I feel like crap.  Can't they try to make me work in Cap or non food areas?  Do y'all know the rules or do you have any experience",
        "created_utc": 1529080369,
        "label": [
            "0"
        ]
    },
    "8sw22l": {
        "title": "I swear if they play the Jurassic Park theme song one more time I will murder a child",
        "body": "",
        "created_utc": 1529619120,
        "label": [
            "0"
        ]
    },
    "8tbwm1": {
        "title": "The Toilets at my store flush underneath you without consent. I feel so violated (and it splashes my bum)",
        "body": "",
        "created_utc": 1529778550,
        "label": [
            "0"
        ]
    },
    "8zbh1z": {
        "title": "Transfer question",
        "body": "So I am transferring to a store and I’m pretty sure they will put me into fresh cap, but this store isn’t 24-7 like the one I’m in now. The store opens at 6 so do any of you know what time the cap one shift starts? Is it 6-3? That would be so much more funky fresh than 4-1",
        "created_utc": 1531752332,
        "label": [
            "0"
        ]
    },
    "9efbbc": {
        "title": "Violating Roommate Trust",
        "body": "**TL;DR I ate my roommates ice cream before I met her don't know how to mend broken trust**\n\nI feel horrible, I need advice.  I just moved in to my apartment Friday and still haven't met my roommate because she is coming back from a trip today.  In a really low anxiety driven moment I ate the rest of her pint of tillamook ice cream (which was about 1/8th of the container, not much at all) so I bought her a new tub.  Now I have no idea how to explain to her what happened.  I feel like I have violated her trust before I have even met her.  She is coming back in about 4 hours and I am panicking.  I might be overreacting but I need help.",
        "created_utc": 1536518401,
        "label": [
            "0"
        ]
    },
    "9obw1l": {
        "title": "Is this a woooosh? Seriously asking I’m not that smart",
        "body": "",
        "created_utc": 1539603511,
        "label": [
            "0"
        ]
    },
    "9of65p": {
        "title": "Old story time haha goteem",
        "body": "When I first started working at Walmart the summer of 2016 these boys that I can assume were college freshman shopping for the first time came up to me and asked if we had any basil. I was in produce so I showed them the fresh basil. They were unimpressed and asked me where the basil was that looked like weed. I showed them to the dry stuff and they ended their shopping trip thoroughly fulfilled. It’s not too interesting of a story but I’m wondering if y’all have some juicy stories with idiots at Walmart.",
        "created_utc": 1539626996,
        "label": [
            "0"
        ]
    },
    "9t5m19": {
        "title": "One image to arouse them all",
        "body": "",
        "created_utc": 1541039547,
        "label": [
            "0"
        ]
    },
    "9ueztv": {
        "title": "I love pooping so much I can't stop thinking about it",
        "body": "I drop a hot fat one, and for the next thirty minutes, I think about how much I enjoyed it.  When I feel one coming on I get excited and prepare myself for the highlight of my day.  I need help",
        "created_utc": 1541435435,
        "label": [
            "0"
        ]
    },
    "9uf3w6": {
        "title": "I love pooping so much I can't stop thinking about it",
        "body": "When I drop a hot fat one for the next thirty minutes I think about how much I enjoyed it. When I feel one coming on I get excited and prepare myself for the highlight of my day. I need help ",
        "created_utc": 1541436205,
        "label": [
            "0"
        ]
    },
    "9vvx5h": {
        "title": "Sorry boys, still planning on winning the furry war though",
        "body": "",
        "created_utc": 1541869618,
        "label": [
            "0"
        ]
    },
    "9wmwpa": {
        "title": "I wish nobody cared about me so I could chuck myself off a rock and be done with it all",
        "body": "I wish nobody cared so I wouldn’t be disappointing anyone. I wish I didn’t seem needy I wish I could just stop existing I’m so close",
        "created_utc": 1542093536,
        "label": [
            "0"
        ]
    },
    "9x3wmj": {
        "title": "Lol when recruiters tell you that you’ll be rakin in the dough. That is way worse than McDonald’s",
        "body": "",
        "created_utc": 1542228062,
        "label": [
            "0"
        ]
    },
    "9xp1g0": {
        "title": "Mr Beast is the patron saint of the Swisstian religion",
        "body": "",
        "created_utc": 1542394614,
        "label": [
            "0"
        ]
    },
    "9xtklb": {
        "title": "Stop deleting descent mods",
        "body": "Seriously it’s ok to have a conversation even Ethan said that.",
        "created_utc": 1542429403,
        "label": [
            "0"
        ]
    },
    "9xuziz": {
        "title": "H3H3 fan base becoming toxic",
        "body": "Whatever you believe about Ethan or stuff he has said he is not above criticism. He has depression, but that doesn’t mean that stuff he has done in the past can’t be criticized. It’s like the point that idubbbz made about rice gum: you can pick and chose what you are criticized for. People that defend Ethan often defend him to ridiculous ends. If you don’t see anything wrong with what he did that’s fine but attacking other people for just criticizing him is stupid.",
        "created_utc": 1542445082,
        "label": [
            "0"
        ]
    },
    "9yaxqx": {
        "title": "Mistborn is a fantastic book to review, it’s a wonderful read and has some interesting laws in it. I know Felix goes for classics but Brandon Sanderson is a legend",
        "body": "",
        "created_utc": 1542583083,
        "label": [
            "0"
        ]
    },
    "9ydsbh": {
        "title": "Recovering slowly",
        "body": "I went to the hospital on Tuesday because my mom threatened to call the cops if I didn’t check myself in to stay safe. After the lowest night of my life I am slowly coming out of a fog that has been covering me for the last two years. I still hate myself, but I’m accepting help more readily and I’m glad for my angel of a mother and roommates who understand and are willing to help. I think maybe God is giving me strength in my time of need. Whatever it is I am willing to pursue it. I’m proud to say that  I left my apartment every day this week of my own free will. It’s not much but I’m happy for this little victory.",
        "created_utc": 1542605089,
        "label": [
            "0"
        ]
    },
    "9yon5q": {
        "title": "I just want to have a good cry with someone, but I don’t want to impose on anyone",
        "body": "[removed]",
        "created_utc": 1542687895,
        "label": [
            "0"
        ]
    },
    "9zh2vs": {
        "title": "When your thanksgiving break is filled with nothing but homework because your professors think only their class matters",
        "body": "",
        "created_utc": 1542914772,
        "label": [
            "0"
        ]
    },
    "a032kv": {
        "title": "Pewdiepie is the tee meaning of Christmas. Hope he sees this, it took me 1.32 billion hours to make",
        "body": "",
        "created_utc": 1543099527,
        "label": [
            "0"
        ]
    },
    "a1bm95": {
        "title": "They should redo this scene in the 2018 rewind with Pewds and 🅱️series but have Pewds stab t series (protecting his virginity and swisstian honor) and then have Logan Paul film the dead body lol goteem",
        "body": "",
        "created_utc": 1543447310,
        "label": [
            "0"
        ]
    },
    "a1bq43": {
        "title": "Will the new Disney Star Wars ever notice KOTOR or do anything about it?",
        "body": "I know they recently made it available on mobile, and shut down the apeiron mod that was coming out. Also Rian Johnson said KOTOR wouldn’t be the subject of some of the new movies coming out. However it’s just too good a game and story to throw away. I wish they would revive the game series or remake it. I wish they would sell it to BioWare at least. What do you think? Is there any hope or no",
        "created_utc": 1543448029,
        "label": [
            "0"
        ]
    },
    "a1x5gr": {
        "title": "Credits to U/ashuscifi for uncovering this lawbreaking maniac",
        "body": "",
        "created_utc": 1543616660,
        "label": [
            "0"
        ]
    },
    "a1xlv2": {
        "title": "We have connections in team 10. Infiltration 100",
        "body": "",
        "created_utc": 1543619935,
        "label": [
            "0"
        ]
    },
    "a20cmg": {
        "title": "Help! I’m stuck!",
        "body": "I’m playing KOTOR 1 and I did all the dialogue options with Mission and I’m walking around the Dantoine spaceport all over. I’ve played this a million times what am I doing wrong?",
        "created_utc": 1543642207,
        "label": [
            "0"
        ]
    },
    "a2av94": {
        "title": "I love how you can tell Juhani you love her on top of the Jedi temple on the star forge system and then 10 minutes later you can tell Carth you love him right in front of her face. It’s a nice “you got pranked bro” moment for Juhani",
        "body": "",
        "created_utc": 1543730145,
        "label": [
            "0"
        ]
    },
    "a2hpx9": {
        "title": "It’s happening!",
        "body": "",
        "created_utc": 1543787373,
        "label": [
            "0"
        ]
    },
    "a2u5tt": {
        "title": "My sister sent this to me today. This guy doesn’t look like my dad or his other grandpa, so sweet",
        "body": "",
        "created_utc": 1543877522,
        "label": [
            "0"
        ]
    },
    "a2vd0f": {
        "title": "Class choice in KOTOR 2",
        "body": "I’m wondering what class you chose when you play KOTOR 2. I used to play guardian only and then switched to Sentinel only because of the need of skills for xp and conversations. What do y’all use?",
        "created_utc": 1543885245,
        "label": [
            "0"
        ]
    },
    "a391ty": {
        "title": "What? Mira?",
        "body": "",
        "created_utc": 1543986157,
        "label": [
            "0"
        ]
    },
    "a3l21i": {
        "title": "Glitch help!",
        "body": "Playing KOTOR two and it won’t let me talk to bad dur on or off the Ebon Hawk. And I tried turning it off and on again",
        "created_utc": 1544074898,
        "label": [
            "0"
        ]
    },
    "a3qjc2": {
        "title": "Pewdiepie’s chair was in Youtube Rewind!",
        "body": "",
        "created_utc": 1544119998,
        "label": [
            "0"
        ]
    },
    "a44y8g": {
        "title": "Being kicked out",
        "body": "My roommates all went to my university today because they wanted to kick me out.  The oldest one (the only non freshman) is convinced I am stressing them out with my depression. I spend 90 percent of my time outside of the apartment and I never talk to them. I’m leaving tomorrow morning and they are going to the university right now.  I know it’s a really complex situation and all but I’ve been living in a hell of people who hate me. I would understand if I was moving around the apartment all day but the ring leader is just a controlling psycho. I’ve taken their abuse for too long and I am excited to leave ",
        "created_utc": 1544222282,
        "label": [
            "0"
        ]
    },
    "a6m92x": {
        "title": "I’m so far defat he’s from myself I’m beginning to wonder if I’m evil",
        "body": "I’ve lied so much, hurt so many people, taken advantage so much, and have been so detached that I don’t know what redeems me anymore",
        "created_utc": 1544934801,
        "label": [
            "0"
        ]
    },
    "a6ma64": {
        "title": "I’m so far down the road I’m beginning to wonder if I’m evil",
        "body": "I’ve lied so much, hurt so many people, taken advantage so much, and have been so detached that I don’t know what redeems me anymore. I don’t know who I am anymore",
        "created_utc": 1544935085,
        "label": [
            "0"
        ]
    },
    "acz3mq": {
        "title": "The dress code for shoes is basically anything that isn’t open toed right?",
        "body": "",
        "created_utc": 1546727417,
        "label": [
            "0"
        ]
    },
    "afglv6": {
        "title": "Calling someone “Honey” or “Sweetie” can be endearing when in a pleasant conversation but is always condescending when used in an argument",
        "body": "",
        "created_utc": 1547359953,
        "label": [
            "0"
        ]
    },
    "ag4eo2": {
        "title": "Good evening from store 1412",
        "body": "",
        "created_utc": 1547524555,
        "label": [
            "0"
        ]
    },
    "agayk1": {
        "title": "Brad, master thief and deceiver.",
        "body": "",
        "created_utc": 1547573663,
        "label": [
            "0"
        ]
    },
    "ahdfrh": {
        "title": "My mother got this text from an elderly woman in her church using speech to text",
        "body": "",
        "created_utc": 1547836263,
        "label": [
            "0"
        ]
    },
    "ahdm3j": {
        "title": "My mom got this from an old lady in her church using some reach to text",
        "body": "",
        "created_utc": 1547837252,
        "label": [
            "0"
        ]
    },
    "ahdt9i": {
        "title": "My mom offered to paint an old lady in her church’s cabinets and got this speech to text response",
        "body": "",
        "created_utc": 1547838377,
        "label": [
            "0"
        ]
    },
    "ahdxie": {
        "title": "My mom got this text- to-speech response from an old lady in her church.",
        "body": "",
        "created_utc": 1547839087,
        "label": [
            "0"
        ]
    },
    "aheu64": {
        "title": "Text to speech is hard granny",
        "body": "",
        "created_utc": 1547844526,
        "label": [
            "0"
        ]
    },
    "ahofui": {
        "title": "An old lady in my moms church is having trouble with speech to text",
        "body": "",
        "created_utc": 1547921089,
        "label": [
            "0"
        ]
    },
    "ahq7av": {
        "title": "My wife has cerebral Palsy, drank a bottle of lavender essential oil and is cured, and ready for her bikini weightlifting competition ❤️ Edit 1: thanks for all the likes and support Reddit! Edit 2: Thanks for gold niccagethot3 wowowowowow",
        "body": "",
        "created_utc": 1547931601,
        "label": [
            "0"
        ]
    },
    "aodcs4": {
        "title": "Thought this news story was pretty funny (article in comments)",
        "body": "",
        "created_utc": 1549604000,
        "label": [
            "0"
        ]
    },
    "auda0i": {
        "title": "A reddit with babies and puppies together specifically. Or kids and dogs, not r/aww",
        "body": "",
        "created_utc": 1551046274,
        "label": [
            "0"
        ]
    },
    "aug5w0": {
        "title": "9th grade was a very awkward time for me...",
        "body": "",
        "created_utc": 1551064033,
        "label": [
            "0"
        ]
    },
    "avmv17": {
        "title": "Some bakery associate in Arizona must have not seen this little guy before the oven rip",
        "body": "",
        "created_utc": 1551328141,
        "label": [
            "0"
        ]
    },
    "awuerw": {
        "title": "Help I’m in need of it",
        "body": "I’m recently awakened to the truth of Wyoming’s nonexistence. I’ve lived in “Wyoming” for 8 years now. I even attended the University of Wyoming for a bit and so many people I know are from Wyoming. Where am I? Who are my friends? Am I even real? Is my dog even alive or has she just been sleeping for a week straight? Why do I always smell sulfur? \nHellp pls",
        "created_utc": 1551623091,
        "label": [
            "0"
        ]
    },
    "awupt8": {
        "title": "Speech to text is very hard",
        "body": "",
        "created_utc": 1551625257,
        "label": [
            "0"
        ]
    },
    "azuky4": {
        "title": "Hey what was the overnight shift like when daylight savings changed? Did you just get a seven hour shift or did you work until 8?",
        "body": "",
        "created_utc": 1552317255,
        "label": [
            "0"
        ]
    },
    "b0h68a": {
        "title": "Send help, only five rpcs of beef in the cooler. 3 boxes of ground beef. 100,000 customers preparing for a storm. Help",
        "body": "",
        "created_utc": 1552447524,
        "label": [
            "0"
        ]
    },
    "b1faii": {
        "title": "A reddit for people that hate politics?",
        "body": "Pretty straightforward, just subs that like crapping over political obsession and idiocy on either side",
        "created_utc": 1552658375,
        "label": [
            "0"
        ]
    },
    "b31f3y": {
        "title": "Help does anyone have the number to call in?? I can’t get on one wire!!",
        "body": "",
        "created_utc": 1553022364,
        "label": [
            "0"
        ]
    },
    "bb38l7": {
        "title": "Institute Love Rap- Performed at the Laramie Institute",
        "body": "",
        "created_utc": 1554781406,
        "label": [
            "0"
        ]
    },
    "bb8ttt": {
        "title": "This sweet old lady was walking around with her groceries waiting for one of the drivers to move their car. How can people be so apathetic?",
        "body": "",
        "created_utc": 1554821368,
        "label": [
            "0"
        ]
    },
    "beewj9": {
        "title": "Five hours into my shift and I’m taking my first break.",
        "body": "I want to die. Also I wore horrible shoes and they are block of pain",
        "created_utc": 1555545649,
        "label": [
            "0"
        ]
    },
    "bfaqwd": {
        "title": "Is there a subreddit for recommendations of media?",
        "body": "A subreddit where you can ask something like, I’m feeling sad what’s a good show to watch. Or what’s a good movie to watch on a first date or something like that.",
        "created_utc": 1555755191,
        "label": [
            "0"
        ]
    },
    "bfrzsf": {
        "title": "Can you be scheduled for six days a week if the total hours is equal or less than 40 hours? Or is there a limit to days worked",
        "body": "",
        "created_utc": 1555871685,
        "label": [
            "0"
        ]
    },
    "bgcqhy": {
        "title": "Help with Mobile Swoop racing",
        "body": "I am trying mobile kotor for the first time and swoop racing is super hard (for me at least) any tips?",
        "created_utc": 1555998534,
        "label": [
            "0"
        ]
    },
    "bgn62c": {
        "title": "Triggering quests on mobile help",
        "body": "I know how much you need to talk to Carth and I know about his son and wife and death and all, but I can’t come across Jordo anywhere. Has this happened to anyone on mobile? Also Bastillas quest isn’t popping up either",
        "created_utc": 1556061333,
        "label": [
            "0"
        ]
    },
    "boclj7": {
        "title": "Does anybody know about this? Found on mobile",
        "body": "",
        "created_utc": 1557799016,
        "label": [
            "0"
        ]
    },
    "bot1ro": {
        "title": "We have four people now in fresh Cap 2 down from ten.",
        "body": "We have two or three people coming in a day. If someone is sick and can’t come in we’re all screwed. We come in every day and can’t finish half the tasks we’re supposed to do. Our monthly products have dropped -12000 from last year in produce. I have worked in fresh cap for three years now and this is the worst it’s ever been. Even worse the managers get mad at us when everything fails. I am sick of being treated with such disrespect and I want to quit so bad. I have never thought this until two months ago, but I hate my job more than anything right now",
        "created_utc": 1557892875,
        "label": [
            "0"
        ]
    },
    "bpiunf": {
        "title": "Chädcake the swœl, killer of cholesterol",
        "body": "",
        "created_utc": 1558044360,
        "label": [
            "0"
        ]
    },
    "bqo9vf": {
        "title": "Jake Paul clearly has more “hate in his heart” against Cody, than Cody has for anyone. What a total asshole",
        "body": "Also the only kids I remember Cody and Noelle ever making fun of are Marty fuckin smokes and the Hot problems thing.",
        "created_utc": 1558312056,
        "label": [
            "0"
        ]
    },
    "bu5gm7": {
        "title": "Can you use normal pto as protected pto?",
        "body": "",
        "created_utc": 1559077142,
        "label": [
            "0"
        ]
    },
    "bujjac": {
        "title": "Does anyone know what this is? My mom found it in her storage room and gave it to me. It says “Cavaco Natural” on the side.",
        "body": "",
        "created_utc": 1559160807,
        "label": [
            "0"
        ]
    },
    "bwku8c": {
        "title": "Chest Pain",
        "body": "21F 5’5” 184 pounds. Caucasian. It’s been going on for a week and a half in about 1-2 hour bouts. Has happened 3-4 times. Pain is located right under my boobs and  about three inches back. The size is about as big as a quarter. Pain stays mostly constant but pulses and tightens. Sometimes feels like holding in an air bubble but like 5x worse.  I take 100mg of sertralie for depression. I don’t smoke or do any recreational drugs.",
        "created_utc": 1559624523,
        "label": [
            "0"
        ]
    },
    "bwqweg": {
        "title": "I’m having an unknown chest pain",
        "body": "21F 5’5” 184 pounds. Caucasian. It’s been going on for a week and a half in about 1-2 hour bouts. Has happened 3-4 times. Pain is located right under my boobs and  about three inches back. The size is about as big as a quarter. Pain stays mostly constant but pulses and tightens. Sometimes feels like holding in an air bubble but like 5x worse.  I take 100mg of sertralie for depression. I don’t smoke or do any recreational drugs.",
        "created_utc": 1559666614,
        "label": [
            "0"
        ]
    },
    "byyadj": {
        "title": "Hmmm",
        "body": "",
        "created_utc": 1560175689,
        "label": [
            "0"
        ]
    },
    "c3u6cb": {
        "title": "[Help] are there any avatars in vrchat that are similar to the r/imsorryjon imagery?",
        "body": "[removed]",
        "created_utc": 1561234186,
        "label": [
            "0"
        ]
    },
    "c5s6ox": {
        "title": "My favorite lyric from the Mean Girls musical",
        "body": "",
        "created_utc": 1561567787,
        "label": [
            "0"
        ]
    },
    "c6ee52": {
        "title": "Is a 7 hour shift(6-1) ok with a thirty minute lunch? Or does it have to be an hour at that point",
        "body": "",
        "created_utc": 1561688230,
        "label": [
            "0"
        ]
    },
    "c836yt": {
        "title": "While it’s frustrating that the website crashes every night, it’s keeping me productive tonight.",
        "body": "",
        "created_utc": 1562031982,
        "label": [
            "0"
        ]
    },
    "c89pvl": {
        "title": "The second recommended story for me was ImJayStation wtf YouTube (posted here because I saw another post on here about him)",
        "body": "",
        "created_utc": 1562076854,
        "label": [
            "0"
        ]
    },
    "ccsen8": {
        "title": "Justice for Jeb, RIP",
        "body": "",
        "created_utc": 1563041361,
        "label": [
            "0"
        ]
    },
    "ccsf5o": {
        "title": "JEB NOOOO!",
        "body": "",
        "created_utc": 1563041432,
        "label": [
            "0"
        ]
    },
    "ccsmaq": {
        "title": "Rest in peace, we will continue the worship after your passing",
        "body": "",
        "created_utc": 1563042423,
        "label": [
            "0"
        ]
    },
    "cczfqf": {
        "title": "I am so sorry to ask but I am dumb and I’ve been looking at this for an hour I can’t find the second constellation in the altador quest thing",
        "body": "",
        "created_utc": 1563082138,
        "label": [
            "0"
        ]
    },
    "cdkf50": {
        "title": "What battledome opponent drops the best items?",
        "body": "I've noticed that the **S750 Kreludan Defender Robot** drops a bunch of codestones and neocola tokens, but I'm intrigued to see if anyone else has found good items from specific battledome opponents",
        "created_utc": 1563211534,
        "label": [
            "0"
        ]
    },
    "chsqvh": {
        "title": "The lab ray Just turned my neopet Faerie!!! I love Faerie Xweetoks!",
        "body": "",
        "created_utc": 1564084980,
        "label": [
            "0"
        ]
    },
    "cjvis8": {
        "title": "The subreddit about virtually unknown YouTube videos that are amazing",
        "body": "I saw it one before but I can’t remember what it’s called",
        "created_utc": 1564509729,
        "label": [
            "0"
        ]
    },
    "cshpgc": {
        "title": "Do dresses or skirts fall under the dress code?",
        "body": "",
        "created_utc": 1566224349,
        "label": [
            "0"
        ]
    },
    "cszwuh": {
        "title": "How do I apply my associate discount on OGP?",
        "body": "",
        "created_utc": 1566311918,
        "label": [
            "0"
        ]
    },
    "cszypo": {
        "title": "hmmm",
        "body": "",
        "created_utc": 1566312110,
        "label": [
            "0"
        ]
    },
    "ct055b": {
        "title": "Joel and Dave spotted at Felix’s and Marzia’s wedding",
        "body": "",
        "created_utc": 1566312793,
        "label": [
            "0"
        ]
    },
    "d4e6eg": {
        "title": "Usually I hate reddit ads but I guilded sexy Bernie man’s ad because I would suck that pp. AITA?",
        "body": "",
        "created_utc": 1568511356,
        "label": [
            "0"
        ]
    },
    "decgtk": {
        "title": "I I love this Person’s monkey office for the Office Life competition (not mine)",
        "body": "",
        "created_utc": 1570410784,
        "label": [
            "0"
        ]
    },
    "dk6ici": {
        "title": "“You have been chosen” my submission for get dark. I would love some tips this is my third room",
        "body": "",
        "created_utc": 1571504664,
        "label": [
            "0"
        ]
    },
    "dojsnm": {
        "title": "My Elle Woods costume for Halloween. Nobody screws somebody who’s Legally Blond 🎶",
        "body": "",
        "created_utc": 1572316945,
        "label": [
            "0"
        ]
    },
    "dq94kp": {
        "title": "I have high cholesterol and I’m scared I might have diabetes.",
        "body": "I (21F)found out I have high cholesterol and my big toe feels numb, and I’m freaking out that I might be developing type 2 diabetes am I overreacting. What should I do?",
        "created_utc": 1572636850,
        "label": [
            "0"
        ]
    },
    "dvod3p": {
        "title": "Why won’t this meme die",
        "body": "",
        "created_utc": 1573630933,
        "label": [
            "0"
        ]
    },
    "e13bs1": {
        "title": "My Small Vs Large Submission “Dance Battle”. (I would love suggestions I’m not sure if it’s too busy or not)",
        "body": "",
        "created_utc": 1574624092,
        "label": [
            "0"
        ]
    },
    "e76oe6": {
        "title": "I made this dumb igloo after I found out there is a premade igloo in the holiday pack. Dang it",
        "body": "",
        "created_utc": 1575676219,
        "label": [
            "0"
        ]
    },
    "e988jq": {
        "title": "nonononononono",
        "body": "",
        "created_utc": 1576076828,
        "label": [
            "0"
        ]
    },
    "ecj6y2": {
        "title": "Crazy mom gives son Coal (Naughty List) I would greatly appreciate tips for better looking coal",
        "body": "",
        "created_utc": 1576705651,
        "label": [
            "0"
        ]
    },
    "efb8cg": {
        "title": "Me beast giving away 10,000 presents to people in need (present Delivery) advice welcome 😊",
        "body": "",
        "created_utc": 1577243808,
        "label": [
            "0"
        ]
    },
    "ej5xet": {
        "title": "Ya girl just bought out the entire Christmas store. (This took so long it was unholy)",
        "body": "",
        "created_utc": 1578006046,
        "label": [
            "0"
        ]
    },
    "ekh3x1": {
        "title": "Parking where there’s no spot, with open spots ten feet away",
        "body": "",
        "created_utc": 1578249996,
        "label": [
            "0"
        ]
    },
    "elh034": {
        "title": "Either back me the f*** up, or shut the f*** up",
        "body": "",
        "created_utc": 1578428116,
        "label": [
            "0"
        ]
    },
    "evx2ji": {
        "title": "Found on r/pewdiepiesubmissions",
        "body": "",
        "created_utc": 1580347188,
        "label": [
            "0"
        ]
    },
    "foiy3k": {
        "title": "My brother in law killed it",
        "body": "",
        "created_utc": 1585105238,
        "label": [
            "0"
        ]
    },
    "ftf6c7": {
        "title": "My hamster are from my hand today! ☺️☺️",
        "body": "This is my first time owning a hamster at 21. I got Mahi for emotional support reasons. I’ve been stressing that I’m scaring him, and I’ve been reading up on how to help him acclimate to his new enclosure.  I’m really happy that he’s starting to feel better and this first step helped me out so much, there’s no little plop of fur I’d rather quarantine with than him ❤️",
        "created_utc": 1585798623,
        "label": [
            "0"
        ]
    },
    "gr9zqf": {
        "title": "One of these things is not like the other...",
        "body": "",
        "created_utc": 1590542404,
        "label": [
            "0"
        ]
    },
    "hhng8l": {
        "title": "Blackstone buttons and walls make for a good medieval door",
        "body": "",
        "created_utc": 1593381803,
        "label": [
            "0"
        ]
    },
    "hib9hq": {
        "title": "My giant ass underwire came out at work today (hand for size)",
        "body": "",
        "created_utc": 1593472522,
        "label": [
            "0"
        ]
    },
    "hrgry4": {
        "title": "My Brother in law’s nephew from Cheyenne",
        "body": "",
        "created_utc": 1594786083,
        "label": [
            "0"
        ]
    },
    "hs1u0e": {
        "title": "Hero boy saves sister from dog attack, Captain America responds",
        "body": "",
        "created_utc": 1594868027,
        "label": [
            "0"
        ]
    },
    "ht9zxg": {
        "title": "W H Y H A S G O D A B A N D O N E D U S",
        "body": "",
        "created_utc": 1595043522,
        "label": [
            "0"
        ]
    },
    "hv0l87": {
        "title": "Paranoid of losing my job",
        "body": "My boss has been very passive aggressive lately and in my opinion harsh. My job is the highest functioning thing in my life and I can’t stop freaking out that I’m going to get fired. I’ve had stress dreams about it every night. Anyone else felt like this before? I think I might be hitting a depressive cycle",
        "created_utc": 1595304525,
        "label": [
            "0"
        ]
    },
    "hxrtmx": {
        "title": "Forbidden tornado potatoes",
        "body": "",
        "created_utc": 1595702556,
        "label": [
            "0"
        ]
    },
    "hzpdjp": {
        "title": "I can’t stop seeing it everywhere",
        "body": "",
        "created_utc": 1595978192,
        "label": [
            "0"
        ]
    },
    "i3q3ea": {
        "title": "I want to murder apple bobbing Bart",
        "body": "",
        "created_utc": 1596569749,
        "label": [
            "0"
        ]
    },
    "i6k7yp": {
        "title": "Behold, my krispy monster",
        "body": "",
        "created_utc": 1596983300,
        "label": [
            "0"
        ]
    },
    "ifemz2": {
        "title": "My laptop keeps doing this, I’m trying to start it up and it has cycled like this for an hour. I force shut it down and nothing helps",
        "body": "",
        "created_utc": 1598228557,
        "label": [
            "0"
        ]
    },
    "jcnlbu": {
        "title": "If you read both together as a sentence",
        "body": "",
        "created_utc": 1602903054,
        "label": [
            "0"
        ]
    },
    "jq5dga": {
        "title": "Difficulty Running game",
        "body": "I have a month old gaming laptop and I am having a lot of trouble playing the game.  I'm really bad at tech but I was wondering if anyone has any tips for better performance.  It crashes with the terrain manipulator semi frequently and its just overall very laggy.  If anyone has any tips they would be much appreciated :)",
        "created_utc": 1604809139,
        "label": [
            "0"
        ]
    },
    "jwxi4d": {
        "title": "After years of putting it off (and also being an emotional wreck) I finally started doing standup . I’m so happy",
        "body": "",
        "created_utc": 1605766437,
        "label": [
            "0"
        ]
    },
    "jzxkrs": {
        "title": "In this season I am so thankful for medication and therapy that has gotten me to a better adjusted life with bipolar. I am so blessed to live and know so many great people that are not my family but support me beyond anything I could have asked for ♥️ happy Friendsgiving",
        "body": "",
        "created_utc": 1606189937,
        "label": [
            "0"
        ]
    },
    "k0jhxk": {
        "title": "Made this and posted on Facebook marketplace, can’t wait to see the average Utahns’response",
        "body": "",
        "created_utc": 1606272049,
        "label": [
            "0"
        ]
    },
    "kcjqko": {
        "title": "Order of planets question",
        "body": "For the secret shop on korriban I’ve had problems unlocking it before, does anyone know the best order of planets to go in to unlock this?",
        "created_utc": 1607896561,
        "label": [
            "0"
        ]
    },
    "kcp77e": {
        "title": "This “vegetable placenta” mask",
        "body": "",
        "created_utc": 1607915097,
        "label": [
            "0"
        ]
    },
    "kdf53d": {
        "title": "This one is so cute https://vm.tiktok.com/ZMJbuCHDH/",
        "body": "",
        "created_utc": 1608008084,
        "label": [
            "0"
        ]
    },
    "kjnyo9": {
        "title": "I am terrible at drawing but I love my nieces and nephews so much. Took me forever and the look like shit but I’m happy with them",
        "body": "",
        "created_utc": 1608848233,
        "label": [
            "0"
        ]
    },
    "kr56rp": {
        "title": "Help with Emulator setup",
        "body": "I downloaded [this emulator](https://www.myabandonware.com/game/the-hobbit-cc0) and it’s not working for me on my new gaming laptop and I was wondering if anyone can help out? I’m so bad at technology and I can post specs and stuff",
        "created_utc": 1609873510,
        "label": [
            "0"
        ]
    },
    "kr5kyj": {
        "title": "I need help with an emulator!",
        "body": "I downloaded \\[this emulator\\]([https://www.myabandonware.com/game/the-hobbit-cc0](https://www.myabandonware.com/game/the-hobbit-cc0)) for The Hobbit 2003 and it’s not working for me on my new gaming laptop and I was wondering if anyone can help out? I’m so bad at technology so help would be much appreciated\n\nHere are my \\[specs\\]([https://imgur.com/gallery/pFxlyX9](https://imgur.com/gallery/pFxlyX9)) \n\nLet me know if you need to know anything else",
        "created_utc": 1609874632,
        "label": [
            "0"
        ]
    },
    "l3kvmv": {
        "title": "When a survivor knows where you’re hiding and specifically leads the killer to you, so they can get away",
        "body": "",
        "created_utc": 1611436930,
        "label": [
            "0"
        ]
    },
    "l6m3y1": {
        "title": "Bipolar medication makes me starving.",
        "body": "I know we all meme about seroquel making us fat but I’m so fed up with it tonight. After I got back from work today I’ve eaten half a box of macaroni, two granola bars, a bunch of pistachios and a glass of milk and I’m so fucking hungry. I’ve been on seroquel for a year and I’ve been very happy and confident because of it but I’ve gained like 50 pounds or something.  I also can’t do intermittent fasting because I get hungry after three hours. I know I need to start eating better food and more fats, once I get my tax refund and have more cash I’m going to start eating better. Does anyone have any good meals, snacks, or tips to help? Something low calorie that fills you up?",
        "created_utc": 1611802335,
        "label": [
            "0"
        ]
    },
    "n3qmcb": {
        "title": "Help with sublingual tinctures",
        "body": "I just recently got my medical cannabis card though I’ve been using cannabis for about four months. I’ve been using edibles but I hate how long they last and how groggy I feel the next morning. A month ago I bought a tincture and have been trying to use it sublingually. Every time I try it I  barely feel it. I just drop it under my tongue and hold it there for 2 minutes. Then I swallow. Is there a possibility that the tincture is just bad? I bought it from a legal dispensary  in Nevada, and now that I’m buying from a local medical dispensary I’m considering buying a vape because I want something that doesn’t last as long as an edible. Are there tips to take the tincture better? Smoking is illegal where I’m at even with a cannabis card.",
        "created_utc": 1620027985,
        "label": [
            "0"
        ]
    },
    "ne66rw": {
        "title": "To the guy on the bike who saw me smoking in my car in Utah",
        "body": "And then came up to tell me it was awesome and then asked for a toke... God bless you.\n\n(I’m an asshole and was too afraid to give a stranger a toke in an illegal state lol. God bless you anyway)",
        "created_utc": 1621224164,
        "label": [
            "0"
        ]
    },
    "ngq7w3": {
        "title": "I just read The first line of the email while high and It sounded like a murderer",
        "body": "",
        "created_utc": 1621483414,
        "label": [
            "0"
        ]
    },
    "ngqce9": {
        "title": "I’m a baby stoner so I’m just coming to my first stoner revelations. I’m growing",
        "body": "",
        "created_utc": 1621483800,
        "label": [
            "0"
        ]
    },
    "nqtaz2": {
        "title": "I want to get high with my mom",
        "body": "My mother and I have always had a bad relationship, and in February I cut contact with her after she tried manipulating my sister into not getting a divorce. Over the past few months it has been better for me to stay out of contact, but occasionally I miss her. She was toxic and manipulating it sometimes we would have a stress free hang, and lately I’ve been imagining us hanging out high. I obviously would never give her an edible without telling her what it is. I would love if she would be willing to get high with me and have an afternoon where we stopped being so pretentious and stressed out, and just hung out. She’s very religious and I’m 99.9 percent positive that it will never happen but I can’t stop thinking about it. Just wanted to share,",
        "created_utc": 1622660156,
        "label": [
            "0"
        ]
    },
    "ntucuj": {
        "title": "Banjolele journey, end of one week tolerance break",
        "body": "",
        "created_utc": 1623010053,
        "label": [
            "0"
        ]
    },
    "nvid7j": {
        "title": "Eating a ghost pepper. Twitch.tv/isaboble, tip jar Venmo @Isabel-Brewer-2",
        "body": "",
        "created_utc": 1623196872,
        "label": [
            "0"
        ]
    },
    "nvkpiq": {
        "title": "I’m coming down",
        "body": "",
        "created_utc": 1623204512,
        "label": [
            "0"
        ]
    },
    "nwb8jq": {
        "title": "Practicing my mediocre ukulele skills",
        "body": "",
        "created_utc": 1623287061,
        "label": [
            "0"
        ]
    },
    "nwtqvt": {
        "title": "I tried on my old swimsuit from 30 pounds ago and it fits everywhere except my boobs. RIP",
        "body": "",
        "created_utc": 1623347233,
        "label": [
            "0"
        ]
    },
    "nx3mzi": {
        "title": "One sided",
        "body": "",
        "created_utc": 1623373692,
        "label": [
            "0"
        ]
    },
    "nx5blx": {
        "title": "I took an edible tonight [OC]",
        "body": "",
        "created_utc": 1623379166,
        "label": [
            "0"
        ]
    },
    "o0obyc": {
        "title": "I got a little injured",
        "body": "",
        "created_utc": 1623790436,
        "label": [
            "0"
        ]
    },
    "o271uh": {
        "title": "Watching it’s always sunny bloopers",
        "body": "",
        "created_utc": 1623961871,
        "label": [
            "0"
        ]
    },
    "o27clt": {
        "title": "Watching it’s always sunny bloopers",
        "body": "",
        "created_utc": 1623962612,
        "label": [
            "0"
        ]
    },
    "o27krn": {
        "title": "Watching it’s always sunny bloopers and chilling",
        "body": "",
        "created_utc": 1623963192,
        "label": [
            "0"
        ]
    },
    "o2xg2t": {
        "title": "Religion",
        "body": "",
        "created_utc": 1624042637,
        "label": [
            "0"
        ]
    },
    "o770gl": {
        "title": "My apartment is renovating every unit and charging an extra 180 dollars. I just moved in to a renovated apartment and they are shit. This happened last night",
        "body": "",
        "created_utc": 1624559636,
        "label": [
            "0"
        ]
    },
    "o7ch1q": {
        "title": "Looking for some people for a SWF",
        "body": "[removed]",
        "created_utc": 1624580329,
        "label": [
            "0"
        ]
    },
    "o7cjt5": {
        "title": "[PC] [US] 4 players for a KWF game",
        "body": "I’m zooted right now and I am looking for people who want to play a SWF on discord voice chat. I’m not wanting to play super seriously and have fun. I still like competition just much less than on a public match. Message me if you are ok with playing with me because I am high and bad. I don’t have a lot of friends who play video games RIP",
        "created_utc": 1624580586,
        "label": [
            "0"
        ]
    },
    "o7zf65": {
        "title": "Come tour my crappy “renovated” apartment",
        "body": "",
        "created_utc": 1624664693,
        "label": [
            "0"
        ]
    },
    "o8244j": {
        "title": "Bubba Kush",
        "body": "I have a bubba kush indica that is like 16 percent thc and a watermellon zkittles hybrid that is 25 percent thc but for some reason the bubba lush just gives me a salient high. Is that possible? Is there a possibility that bubba kush is just a supreme strain? I’m super pumped",
        "created_utc": 1624675058,
        "label": [
            "0"
        ]
    },
    "o8f0rg": {
        "title": "Playing at the farmers market Venmo @Isabel-Brewer-2",
        "body": "",
        "created_utc": 1624728034,
        "label": [
            "0"
        ]
    },
    "o9y9zl": {
        "title": "Listening to my dumb ass playlist and painting my nails. What’s on your mind?",
        "body": "",
        "created_utc": 1624930756,
        "label": [
            "0"
        ]
    },
    "o9ygrt": {
        "title": "Listening to my dumbass playlist and painting my nails… I’m back lol",
        "body": "",
        "created_utc": 1624931460,
        "label": [
            "0"
        ]
    },
    "oa1emd": {
        "title": "Lol sorry the stream crashed",
        "body": "My phone died haha. Thank you guys for all the support and the comments. Have a good night!",
        "created_utc": 1624942691,
        "label": [
            "0"
        ]
    },
    "oalolp": {
        "title": "Playing Surgeon simulator and eating a snow cone",
        "body": "",
        "created_utc": 1625013942,
        "label": [
            "0"
        ]
    },
    "oalorm": {
        "title": "Playing Surgeon simulator and eating a snow cone",
        "body": "",
        "created_utc": 1625013959,
        "label": [
            "0"
        ]
    },
    "oamnrk": {
        "title": "Playing Dead By Daylight and eating a snow cone",
        "body": "",
        "created_utc": 1625017239,
        "label": [
            "0"
        ]
    },
    "oc1kon": {
        "title": "Give me your song recommendations! Chilling doing my nails",
        "body": "",
        "created_utc": 1625195473,
        "label": [
            "0"
        ]
    },
    "ocp0zb": {
        "title": "Am I creepy enough?",
        "body": "",
        "created_utc": 1625278819,
        "label": [
            "0"
        ]
    },
    "odb4ev": {
        "title": "Give me your music suggestions! And counting farmers market money",
        "body": "",
        "created_utc": 1625364269,
        "label": [
            "0"
        ]
    },
    "odxodj": {
        "title": "Hiding from my family…",
        "body": "",
        "created_utc": 1625450511,
        "label": [
            "0"
        ]
    },
    "odzcfn": {
        "title": "Watching the fireworks and chilling",
        "body": "",
        "created_utc": 1625457693,
        "label": [
            "0"
        ]
    },
    "odzee5": {
        "title": "Watching the fireworks and hiding from family,",
        "body": "",
        "created_utc": 1625457919,
        "label": [
            "0"
        ]
    },
    "oelm6s": {
        "title": "Working on my social skills… give me your song recommendations!",
        "body": "",
        "created_utc": 1625537678,
        "label": [
            "0"
        ]
    },
    "oggncn": {
        "title": "Having trouble with adding sources",
        "body": "My RPAN is having issues with adding sources.  I know my computer is set up properly for my obs because streamlabs works fine.  Whenever I add a source a red dot appears in the top right corner but when I drag it around nothing really happens.  I can't add any type of source.  I'm going to uninstall and then reinstall and see if that works, but has anyone else had this type of problem?",
        "created_utc": 1625778878,
        "label": [
            "0"
        ]
    },
    "ogol8o": {
        "title": "Back Pains and Dead by Daylight",
        "body": "",
        "created_utc": 1625806893,
        "label": [
            "0"
        ]
    },
    "oh9n64": {
        "title": "G O O D V I B E S O N L Y . . . Dead By Daylight",
        "body": "",
        "created_utc": 1625882164,
        "label": [
            "0"
        ]
    },
    "ohud26": {
        "title": "Do you have to take more mg thc sublingually vs an edible?",
        "body": "I find that when I use thc oil tinctures 20 mg barely hits me but an edible 20 mg is perfect. I’m trying to see if I can use tinctures sublingually so I don’t have to smoke but I don’t have to feel the effects for hours. Any advice?",
        "created_utc": 1625963540,
        "label": [
            "0"
        ]
    },
    "ohvosa": {
        "title": "Eating Jalepenos and Dead by Daylight",
        "body": "",
        "created_utc": 1625968894,
        "label": [
            "0"
        ]
    },
    "oik22n": {
        "title": "Part Time Nerds with friends",
        "body": "",
        "created_utc": 1626064347,
        "label": [
            "0"
        ]
    },
    "okjk79": {
        "title": "Baked playing octodad",
        "body": "",
        "created_utc": 1626316445,
        "label": [
            "0"
        ]
    },
    "okjka5": {
        "title": "Baked playing octodad",
        "body": "",
        "created_utc": 1626316453,
        "label": [
            "0"
        ]
    },
    "olqfto": {
        "title": "Playing my Ike at the farmers market Venmo @Isabel-Brewer-2",
        "body": "",
        "created_utc": 1626470825,
        "label": [
            "0"
        ]
    },
    "omduxp": {
        "title": "Doing your song requests",
        "body": "",
        "created_utc": 1626559697,
        "label": [
            "0"
        ]
    },
    "omdvhx": {
        "title": "Doing your song requests",
        "body": "",
        "created_utc": 1626559755,
        "label": [
            "0"
        ]
    },
    "on5xfe": {
        "title": "Part-Time Nerds Ep II: A Wolf in the Fold",
        "body": "",
        "created_utc": 1626665403,
        "label": [
            "0"
        ]
    },
    "oni1hd": {
        "title": "My friends and I do a podcast about Star Trek for RPAN and about 10 percent of our comments look like this. Women on the internet folks",
        "body": "",
        "created_utc": 1626713536,
        "label": [
            "0"
        ]
    },
    "ours4c": {
        "title": "Zooted Shrek the musical sing a long",
        "body": "",
        "created_utc": 1627673316,
        "label": [
            "0"
        ]
    },
    "ouzj8m": {
        "title": "I made a tik tok that I think you all can relate to. Big boob memes are my fav",
        "body": "",
        "created_utc": 1627700445,
        "label": [
            "0"
        ]
    },
    "ow688v": {
        "title": "Part time nerds ep 3",
        "body": "",
        "created_utc": 1627873572,
        "label": [
            "0"
        ]
    },
    "oy2zrj": {
        "title": "Raising money for my job interviews and moving",
        "body": "",
        "created_utc": 1628113009,
        "label": [
            "0"
        ]
    },
    "oz0wbh": {
        "title": "My apartment has a lot of flies",
        "body": "How many flies is too many flies before I call my apartments emergency number? But if I call then they might charge me money if it’s not a real emergency. But I can’t get the flies out of my room what if they make babies! I seriously have a fly in my room right now that I can’t get out",
        "created_utc": 1628230233,
        "label": [
            "0"
        ]
    },
    "p3bz4c": {
        "title": "Playing the Wii High School musical sing it and chilling",
        "body": "",
        "created_utc": 1628812434,
        "label": [
            "0"
        ]
    },
    "p3c07x": {
        "title": "Playing the Wii High School musical sing it and chilling",
        "body": "",
        "created_utc": 1628812537,
        "label": [
            "0"
        ]
    },
    "p3vyms": {
        "title": "trying to distract myself while waiting to hear back from a job: Music review",
        "body": "",
        "created_utc": 1628894465,
        "label": [
            "0"
        ]
    },
    "p3vz7m": {
        "title": "trying to distract myself while waiting to hear back from a job: Music review",
        "body": "",
        "created_utc": 1628894516,
        "label": [
            "0"
        ]
    },
    "p4inn7": {
        "title": "My last pre-roach made with the last of my weed before I move to Colorado. I’m off to *greener* pastures",
        "body": "",
        "created_utc": 1628984262,
        "label": [
            "0"
        ]
    },
    "p8k806": {
        "title": "I’m new to town, looking to donate plasma, if anyone knows of some type of buddy bonus where when I donate we both get 50 bucks or something let me know so being a new donor doesn’t go to waste",
        "body": "",
        "created_utc": 1629516817,
        "label": [
            "0"
        ]
    },
    "pagp4m": {
        "title": "Will he take over the world in 2040?",
        "body": "",
        "created_utc": 1629781249,
        "label": [
            "0"
        ]
    },
    "pbp6f3": {
        "title": "Give me a subject to freestyle rap about",
        "body": "",
        "created_utc": 1629940989,
        "label": [
            "0"
        ]
    },
    "pdzyci": {
        "title": "Writing down my stories and playing the banjo",
        "body": "",
        "created_utc": 1630259188,
        "label": [
            "0"
        ]
    },
    "pga776": {
        "title": "Does anyone know where to buy raw cones in bulk?",
        "body": "If all else fails I’ll buy them on Amazon but I’d rather do it in person",
        "created_utc": 1630555134,
        "label": [
            "0"
        ]
    },
    "pguefg": {
        "title": "Zooted and maybe playing the banjo",
        "body": "",
        "created_utc": 1630629451,
        "label": [
            "0"
        ]
    },
    "plyq5r": {
        "title": "Beauty in the beast Sing along!",
        "body": "",
        "created_utc": 1631326603,
        "label": [
            "0"
        ]
    },
    "pmla3b": {
        "title": "Smoke away the sadness with me",
        "body": "",
        "created_utc": 1631417521,
        "label": [
            "0"
        ]
    },
    "pqdlez": {
        "title": "Positivity dance party! Blowing off the work week steam",
        "body": "",
        "created_utc": 1631930304,
        "label": [
            "0"
        ]
    },
    "q4nf0q": {
        "title": "Halloween Costume: Sally from Nightmare before Christmas. Don’t tell my sister though! It’s a surprise for our costume contest",
        "body": "",
        "created_utc": 1633792922,
        "label": [
            "0"
        ]
    },
    "q4y4kq": {
        "title": "Positivity only :) cleaning my hypo manic bedroom",
        "body": "",
        "created_utc": 1633828052,
        "label": [
            "0"
        ]
    },
    "q7tad5": {
        "title": "Tinnitus has kept me in a hypomanic state where I am incredibly high functioning but paranoid and emotionally unstable",
        "body": "I am holding it together well. I am doing well in my job and I even got a pay raise today, but my emotions are in shambles. I am writing and performing comedy more frequently than ever, I have a plan for my life.  I have been able to think through my emotions logically on occasion but the majority of my emotional state is anxious. I will do well. I am going to set my alarm for work, I haven’t been late except for two days when I had car troubles.  My healthcare is kicking in soon, I’m so close and my tinnitus may be getting fixed. I just have so much calamity at work that my personal life is drained.",
        "created_utc": 1634189586,
        "label": [
            "0"
        ]
    },
    "q7tevo": {
        "title": "Impacted cerumen tinnitus.",
        "body": "[removed]",
        "created_utc": 1634190147,
        "label": [
            "0"
        ]
    }
}