{
    "30xzmz": {
        "title": "Dissociation",
        "body": "Told my coworker to have a nice day as she walked out the door for lunch or did I? Empty echo in my head. Did I just think it or say it out loud? Erie creepy feeling.",
        "created_utc": 1427820792,
        "label": [
            "0"
        ]
    },
    "33mpss": {
        "title": "SO asks if I get bored with her every once in a while",
        "body": "It's not you, it's me.\n\nAnd life in general.\n\nProbably just the lithium.\n\nNothing is amusing anymore, even spending time with my SO.\n\nChoking on melancholy.",
        "created_utc": 1429818569,
        "label": [
            "0"
        ]
    },
    "35k9x4": {
        "title": "At a .4 (lithium)",
        "body": "My P-doc wasn't too concerned really; I mean, we were planning to reduce my medication to 0mg per day over the course of this year. \n\nThe back story involves myself being quite sick for 10-14 days(the lithium causes days to bleed together). I had not seen my P-doc in 3 and 1/2 months, and suddenly with this sickness, I decided to have my levels checked. At first, my P-doc was concerned I had floated above a 1(lithium), but after I got my blood results, I emailed him back stating that perhaps I was having withdrawal symptoms, with such a low score .4 . I'm fine where I'm at, but not looking forward to the withdrawals from .4 all the way down to 0.0\n\nAnyone else experienced lithium withdrawals?\n\nIt is very unpleasant. ",
        "created_utc": 1431318051,
        "label": [
            "0"
        ]
    },
    "35sdws": {
        "title": "If it wasn't for a few people, I wouldn't even remember I had this disorder.(Positive Medication)",
        "body": "I take a low dosage of lithium. If it weren't for a few people, my P-doc included, I wouldn't even realize/recognize I still had an illness. I actual feel 100% again. Truly.\n\nGive medication a chance!\n\nHope everyone is doing well.",
        "created_utc": 1431485196,
        "label": [
            "0"
        ]
    },
    "35ua86": {
        "title": "Accrediting a productive day to hypomania",
        "body": "Takes the achievement out of the day for me. I just feel like I did for years before my first episode. I was hypomanic for years and functioned successfully. \n\nAnyone else riding the hypo-train?\n\nGood feeling, just got to make sure the attendant keeps track of how many drinks I have(stressors, tasks, i.e. not overwhelm myself or over indulge).",
        "created_utc": 1431532208,
        "label": [
            "0"
        ]
    },
    "35xt0i": {
        "title": "Give occlumency a shot",
        "body": "Meditation is very helpful with intrusive and racing thoughts. I like to think of it as occlumency(Harry Potter Series).\n\nYou must learn to close one's mind.\n\n:) Happy Thursday Everyone",
        "created_utc": 1431606200,
        "label": [
            "0"
        ]
    },
    "36da2n": {
        "title": "Be honest, how much water do you drink everyday?",
        "body": "Me: I try to drink between 100-150 fluid ounces a day.\n\nDon't forget folks: Medication requires water and so does regular daily maintenance, not to mention physical exercise. \n\nPlease, please make sure you are staying hydrated. \n\nYou might even see some of your problems improve if not drift away.\n\nDuring my darkest hour, I had an anagram(sure, let's call it this and be wrong lol).\nWALTZ\nWater\nAppetite\nLithium\nTime\nZyprexa.\n\nWATER IS THE UTMOST IMPORTANT. \n\nThoughts? You are staying hydrated, and does your medication make it difficult to retain fluids? :-)",
        "created_utc": 1431957032,
        "label": [
            "0"
        ]
    },
    "36yfu4": {
        "title": "P-doc is playing hard to get",
        "body": "So, I know my lithium level is .4, and my P-doc knows that it is .4 . I've sent him the lab results.\n\nSaw him the other day, and he made no mention of it. Didn't say we should increase dosage. Nothing.\n\nI last saw him 3-4 months ago, and now I won't see him again until mid-August.\n\nSeems to me like he's \"testing the waters\" and seeing if my stability will last. \n\nThe range for effective medication is .46 to 1.\n\nSo, I'm not far off, but if my P-doc wants to start the decent of medication, I wish he'd be more vocal about it. We had planned on coming off it; I suppose this is the first test.\n\nThoughts? :) Have you ever come off medication? Should I be concerned that he didn't want to increase the dosage to get me back to .5-.6, the range I have been around for the past 6 months.\n",
        "created_utc": 1432354757,
        "label": [
            "0"
        ]
    },
    "378105": {
        "title": "A short BP Poem",
        "body": "To be or not to be Bipolar?\n\nHas my Ego regained control,\n\nOr am I up in the clouds?\n\nDo I lay upon the floor of the ocean?\n\nDo I walk through the valley of death?\n\nWhen will my Ego regain control?\n\nCan I pull through?\n\nTo be or not to be bipolar?",
        "created_utc": 1432573825,
        "label": [
            "0"
        ]
    },
    "37t1i3": {
        "title": "Getting Downvoted for supporting walking...",
        "body": "Like what. lololololol\n\nI guess walking is depressing.\n\nRant over.\n\n",
        "created_utc": 1432958182,
        "label": [
            "0"
        ]
    },
    "38590y": {
        "title": "Team CBD for the win!",
        "body": "A vape shop near me just started stocking CBD oils. I got a strawberry flavor.\n\n\nI am in heaven :-D just had the best nap of my life. Woke up vibrating. Man, some good stuff!\n\n\nHope everyone is bypassing the Monday Blues today!",
        "created_utc": 1433200368,
        "label": [
            "0"
        ]
    },
    "38jofy": {
        "title": "Creativity put to good use. I'm now starting concept art off my abstract art. I'm really excited. I know when I come a little down from my hypo today, I can be more critical on the designs, but for now I am just loving the colors and shapes :) Who else does art?!?! :-D",
        "body": "",
        "created_utc": 1433440214,
        "label": [
            "0"
        ]
    },
    "3911ku": {
        "title": "LittleRedShrooms: Photography and Peace",
        "body": "",
        "created_utc": 1433771363,
        "label": [
            "0"
        ]
    },
    "395znc": {
        "title": "I'll Never Accept That My Mind Is Degrading(Poem)",
        "body": "I'm too grandiose to let a board of doctors play God with my sanity.\n\nI'd bask in the pits of hell and shine in the glory of Heaven, \ntrade this so called 'sanity' for a pittance. \n\nThe mind is the master; the brain can degrade to oblivion, I'll never loose who I am, keep feeding the drugs. \n\nIf anything:\n\n\nI'll find myself sooner.",
        "created_utc": 1433860300,
        "label": [
            "0"
        ]
    },
    "39ok1a": {
        "title": "SO doesn't understand the disorder and attacks my pride",
        "body": "I mean, I can't just take this shit any more.\n\nIt makes me feel like shit when it's not my fault. I've tried time and time again to get her to research the illness and read on this sub-reddit, and she hasn't done it.\n\nShe doesn't understand, and I know if I shove it in her face, she's just going to break it off.\n\nDamned if I do her, Damned if I don't.\n\nFuck.",
        "created_utc": 1434178239,
        "label": [
            "0"
        ]
    },
    "39olwm": {
        "title": "So long, and thanks for all the fish",
        "body": "It's been one hell of a ride. Can't face it anymore, I'll let someone else fight.\n\nI'm going back to my normal, selfish self.\n\nI wish you all well, never forget your towel.\n\nMaybe I'll filter back one day, but I can't face it anymore.\n\nTo the depths I go, and this time, I welcome the depression.\n\nInto solitude, may your souls find rest.\n\n\nBest Regards,\n\n\n\nLittleRedBugs\n\n\np.s. InMyBlood\n\nEDIT: https://www.youtube.com/watch?v=ojydNb3Lrrs\n\nI'll keep responding to comments, thanks everyone for your encouragement.",
        "created_utc": 1434179572,
        "label": [
            "0"
        ]
    },
    "3aiy7w": {
        "title": "The Savage and Trump Disclosure",
        "body": "",
        "created_utc": 1434820864,
        "label": [
            "0"
        ]
    },
    "3blj0d": {
        "title": "So, 16 days and I'm back baby.",
        "body": "Ello BP community,\n\n\n\nSurely, I missed you.\n\n\nTonight I have the most dreary tale to tell.\n\n\nIndeed, whilst my friend and I ventured to the den of smoke and coal, we encountered quite the unsettling proposition.\n\n\n\nAs such, my friend(also BP) took matters into his own hands and further dwindled our chance of an enjoyable evening.\n\n\n\nI have entered a situation in which my friend's actions have now caused me legal trouble. He was given four counts of reckless endangerment(with a vehicle) and four counts of aggravated assault. Myself being passenger in the car and unwilling to testify without subpoena or before trial of my friend, was charged with aiding and abetting in the crime.\n\n\n\nWhile I may or may not have seen the crime, I was also under deep stress, on my medications, and on pain medication for a physical injury. \n\n\nI was curious if anyone had had dealings in such matters, and if the voice of my private P-doc had weight in the matter.\n\n\n\nMy testimony against him(in my view) is erroneous due to my current mental state of the procedings.\n\n\n\nHow am I to know what I saw, what I didn't see, what I may have seen, what I may have thought I saw, or even so the memories I may have fabricated in self fear and protection of my own well-being as the same my friend.\n\n\n\nAny advice would be greatly appreciated. As it stands, I am charged with a mere misdomeaner crime for simple being a passanger in the car and refusing to give testimony unless I had a lawyer or was under arrest(which I would still require a lawyer before giving testimoney).\n\n\n\nThanks for reading my story,\nIt's good to be back,\nI look forward to hearing from you all.\n\n\n\nBest Regards,\nLittleRedBugs",
        "created_utc": 1435640183,
        "label": [
            "0"
        ]
    },
    "3buepy": {
        "title": "I'm back(and with update), thanks for the support yous guys.",
        "body": "So, in my last post I conjectured my legal troubles.\n\nI have gotten a lawyer, received gag order from said lawyer, and now just wait for him to work his magic. He says I should have the charges(hopefully) dropped before court.\n\n\n\nThanks for the support guys, I really needed it. Meeting with my P-doc tomorrow.\n\n\nTL;Didn'tKnow: My friend did something stupid, and I happened to be a passenger with him, so I was falsely arrested. \n\nEDIT: And I refused to testify against my friend without consulting a lawyer.",
        "created_utc": 1435817211,
        "label": [
            "0"
        ]
    },
    "3c1wco": {
        "title": "Last one guys(update on my situation) Thanks for the Support",
        "body": "Well, my friend's attorney said that his client(my friend) will testify that I in no way influenced or encourage whatever my friend was accused of doing. \n\n\n\nSo, basically, I will get the charges dropped. \n\n\nThanks for your kind words, in a time when I really needed somebody that could relate.\n\n\nTLDR: I was accused of a crime, protected my friend by pleading the 5th, was charged, jailed, not given medication, bonded out, saw my lawyer, saw my P-doc, and I'm aye-okay now. Should have the charges dropped.",
        "created_utc": 1435968940,
        "label": [
            "0"
        ]
    },
    "3h6xr2": {
        "title": "Guys, summon up your 'alter's. You have unknown powers!(satire and ignorant buffoon exposed)",
        "body": "",
        "created_utc": 1439726018,
        "label": [
            "0"
        ]
    },
    "3hrh83": {
        "title": "Pdoc says another 1.5 years",
        "body": "So, I've been stable for a little over a year sitting at a .4 toxicity on lithium. Doc said after another 18 months he'd consider recommending coming off the medication. I don't know if I should believe him or trust him. I've been anti-medication since my diagnosis and have been trying to come off it.\n\nWhat are the odds I will actually get off it?\n\nI'm skeptical.\n\nAs always,\nBest Regards,\nLittleRedBugs",
        "created_utc": 1440102427,
        "label": [
            "0"
        ]
    },
    "3juyc2": {
        "title": "A line, a poem, a riddle. Enjoy. :)",
        "body": "Title: The Doctor, the Pharmacist\n\n\n* He knows as I, We know it's low.\n* Would he not raise it? Woe is Woe\n* But what shall I do, this balance is torturous!?\n* He says one year must pass, Indeed, quite fortuitous.\n* Whose lost his mind? The Doctor or the Pharmacist\n* I found my psyche, shattered sound I did resist.\n* In a land of Bizarre, all thoughts lingering, opened from the jar.\n* One by one, return them there.\n* Or vanquish them, I solemnly swear.\n* And in and out of this land do I fly,\n* return I must for purpose, why?\n* I hold the balance in my hand, I teeter the scale.\n* One day the noon roost, one day the sunrise.\n* Can I wait a whole year, all bets on this ratio?\n* He knows as I, we know it's low.\n* With this hand I take liberty, of this I know.\n* I am the Pharmacist.",
        "created_utc": 1441550023,
        "label": [
            "0"
        ]
    },
    "3kzc1o": {
        "title": "So, I asked my Philosophy Professor, \"What is happiness\"?",
        "body": "Yep. This guy. This BP mother fucker. ;)\n\nI'll post back when I've discovered its truest meaning. So far I have gotten it down to this: Pleasure in the fulfillment of your desires.\n\n",
        "created_utc": 1442277094,
        "label": [
            "0"
        ]
    },
    "3l3ury": {
        "title": "So, the charges got dismissed. It was a good day.",
        "body": "So, encase many don't remember the back story, I can now legally disclose in full detail, though I won't delve deeply.\n\nMy friend pulled a fake gun out while driving to intimidate a driver who was harassing him. I happened to be in the passenger seat. When ultimately the cops got involved, I ended up being arrested as well for criminal responsibility. That's right. Me. The guy that was on a crutch, sitting in his car.\n\nSo today, he plead guilty, and my charges were dropped. It's sad that I had to pay a lawyer, sad to see my friend be on probation for an eternity, but I'm grateful to once more be a free man. \n\nBest Regards,\nLittleRedBugs\n\nEdit: And to dude that downvoted(as I'm sure their will be more), please feel free to personally message me your dissent of a fellow BPer actually having a good day. Thanks.",
        "created_utc": 1442360850,
        "label": [
            "0"
        ]
    },
    "3l9c4j": {
        "title": "Poll: Who has actually read the DSM on Bipolar?",
        "body": "Just curiosity really. I for one have read it in its entirety. ",
        "created_utc": 1442460749,
        "label": [
            "0"
        ]
    },
    "3mgejr": {
        "title": "For those struggling with others(poem: snarky-positive outlook)",
        "body": "Spoken to the outside world:\n\nI carry no burdens, I accept no desires.\n\nI close my eyes, when I cross the wire.\n\n\nThe world may dye me, but the colors don't stick.\n\nThe world will die to you, and the feelings will flick.\n\n\nTake his care or her care, pick anything you like,\n\nBut don't be bothered to ask of me in spite.\n\n\nI'll laugh, and I'll chuck, perhaps sing you a tune,\n\nBut never, shall I ever, be charming to you.\n\n\nYou tremble, you fear, you look for everything near.\n\nYou suck in desires, you sprint across the wire.\n\n\nThese burdens you carry, these beliefs swing to and fro, \n\nLet go of these notions, your woe is merely woe.\n\n\nYou claim to understand things, you claim to know truth,\n\nbut answer me one question, I promise no more laughter:\n\n\nWho's worth, mine or yours, are you still after?",
        "created_utc": 1443268314,
        "label": [
            "0"
        ]
    },
    "3mwaj7": {
        "title": "Short and Sweet",
        "body": "Short and Sweet part: Defining who are and what you love doing, that's the key, that's the ticket, that's the recipe to a stable life.\n\nNotice I didn't say stability; there's a difference. There are many ways to reach stability, with varying levels of success, but for life beyond the Dx, beyond the medication, beyond the gimmicks like \"work out more\", \"just choose happiness\", \"find a low stress job\", \"take these supplements\", \"avoid these foods and chemicals\", etc...one must come to terms with the nature of the beast.\n\nYou can reject or accept that your psyche has been disheveled. You can reject or accept help from a Doctor. You can reject or accept the love of your friends and family. You can reject the things you love and accept the things deep down you resent.\n\nThese things will define you, these things will bring about a stable or unstable life.\n\nRedefine who you are.\n\nGet back to doing what you love.\n\n\nBest Regards,\nLittleRedBugs",
        "created_utc": 1443568535,
        "label": [
            "0"
        ]
    },
    "3n3cl4": {
        "title": "Bpers are the Philosopher Kings of the Modern World",
        "body": "",
        "created_utc": 1443701195,
        "label": [
            "0"
        ]
    },
    "3o5g2b": {
        "title": "Tower of Babel, God or man?",
        "body": "What's the true moral of the parable here? I mean cmon, seems like a classic kindergarten: disagree and scatter.\n\nMankind destroys itself. \n\nGod eats the popcorn and drinks the Coco-Cola.\n\nGod stops human development? What of the modern age? What of current translations tools? Do we not now possess the same capability to work in unison?\n\nEDIT: Follow up question. Did Judas know his fate and was he predistined to betray the Christ. How do we revolt against something we have been destined to do? As in, even if it is God's \"plan\" but it's certainly evil, though in the end, is it not good if God commanded it to become.\n\nCan we continue to use God as a means for our own destruction?",
        "created_utc": 1444427134,
        "label": [
            "0"
        ]
    },
    "3o60hl": {
        "title": "Could Judas choose his fate? Was his work Good in the eyes of the Lord.",
        "body": "Did Judas know his fate and was he predestined to betray the Christ? How do we revolt against something we have been destined to do? As in, even if it is God's \"plan\" but it's certainly evil, though in the end, is it not good if God commanded it to become.\nCan we continue to use God as a means for our own destruction?",
        "created_utc": 1444437462,
        "label": [
            "0"
        ]
    },
    "3o631x": {
        "title": "Can we use Visa Standards to approach Amnesty? Is that such a bad thing?",
        "body": "[removed]",
        "created_utc": 1444438896,
        "label": [
            "0"
        ]
    },
    "3oxer5": {
        "title": "Lithium perspective, personal insight(potentially poetic)",
        "body": "Expressing emotions that I don't actual feel, I still feel dishonest. The 'wellness' lithium offers isn't lasting. A part of you becomes masked until you are left an empty shell, echoing the despair of the ocean surrounding you.\n\nI think more than not the effectiveness of lithium is driving you to a point of apathy that stabilizing isn't only an option, but the reason to breathe in this bastard world, the start to finding yourself once more.",
        "created_utc": 1444955079,
        "label": [
            "0"
        ]
    },
    "3phtbk": {
        "title": "Ethical Methods in Philosophical Discussion",
        "body": "Hello there!\n\nFirst post to /r/askphilosophy/ .\n\n\n\nEDIT: TITLE: Ethical Methods in Discussions that turn Philosophical\n\n\n\nEDIT: QUESTION: How can one address another in matters of discussion that have turned philosophical, as in beliefs and thoughts being discussed. What are effective methods?\n\n\n\nQuestion: How can one address another in matters of philosophical discussion?\n\n\nEver since taking Philosophy at University and with subsequent readings, meditations, I have found it ever so difficult, if not impossible, to engage in topical discussion with family, friends, colleagues, strangers, and all the rest.\n\n\nWith Plato in mind: I feel ever so more as Socrates, and it doesn't feel ethical, moral, well, just plain nice to approach people in such a manner. The Socrates approach is a sure fire way to be ostracized from your closest circles even unto the community.\n\n\nIt makes me wonder if the best policy is to question when questioned and answer when asked for an answer, but at the same time, it makes me cautious to enter a conversation or discussion with people who immediatly 'vibe' as emotionally opinionated and ardent on their position. \n\nI'm coming to find it's not even worth the time, and Philosophy has only opened my eyes to the ignorance that rests among the public.\n\n\nThoughts, Comments, Questions, Concerns? I'm all ears and curious if anyone else has had this feeling as they have begun their philosophical awakening or as they walk through life.",
        "created_utc": 1445350697,
        "label": [
            "0"
        ]
    },
    "3phwqc": {
        "title": "Angry Girl(drunk) at a bar last night expressed I do not understand PTSD(Semi-rant)",
        "body": "This girl interjected herself into a conversation I was participating in with a few other girls at the bar. The topic of college majors came about, and one girl was going for a degree in 'military psychology'.\n\nSo, nonsensical me, yep this guy, makes a slight joke that flies way over her head. I said, \"So, what's so intricate about that? You sign up for war. You sign up to kill people, and you can either handle it or can't\".\n\nTo which the two girl in the conversation said, \"Wow, you're so ignorant that's such an ignorant question\".\n\nLOL, Okay, so yeah, I deserved it right, but I was making a joke and a point, and of course, I couldn't stop there, right(probably should have)?\n\nSo, I question, \"In what way is that ignorant? People know what they are getting into before they sign up for the military, if they don't, that's ignorance on their part\".\n\n\nAt this point, the angry girl(drunk), interjects into the conversation(in defense of the other girls who couldn't respond as to their own statements), and she starts going off on things such as:\n\n1. Statistics of suicide\n2. Statistics of casualties\n3. Fellow soldiers dying in your arms\n4. Killing someone(asked if I could kill someone)\n5. Her Brother had PTSD from being a veteran.\n\nAll the while, I keep expressing my ignorance(of course), insisting that people that sign up for war, sign up for war, but my points didn't hold much with them.\n\nSo, after five minutes of battering back their emotional outlast(which came from one joke) and attempting to understand her degree, the bar tender on staff(chill dude) became my lifeline and shut the convo down.\n\nLater overhead the angry girl continuing to rant about the conversation to a guy she was dating, oblivious that I could hear her.\n\nIt's funny, I was close to telling her: -I know more about PTSD than you could possibly imagine, I have Manic Depressive Disorder, and unlike the military, I didn't have a choice, I had no way of knowing what it would be like. - But, I just let it go, I wouldn't let these type of people affect me or my mood, and continued to have a good night.\n\nIt was interesting. Learned a bar isn't the best place to interact with strangers, especially when they fire the emotion cannon. \n\n\nI guess at the end of the day, I was ignorant, in that I didn't think about the crowd before I pitched the joke.\n\n\nAnyways, semi-rant over, and I know there are Vets that trigger into Bipolar, and by no means, take my words as derogatory.\n\n\nHas anyone else had an experience similar, wherein, someone blatantly disregards you as ignorant? How do resist the temptation to indulge them? It's very difficult for me, I seem to have a 'socrates' complex when it comes to coversation.\n\n\nAnyways,\n\nBest Regards,\nLittleRedBugs",
        "created_utc": 1445352114,
        "label": [
            "0"
        ]
    },
    "3rpw41": {
        "title": "\"-Grunt- He already knows...\"",
        "body": "The words I will never forget.&amp;nbsp;\n\nThe words a Marine spoke to me, the moment my psychosis was shattered by paranoia. The paranoia that I was taking part in something, and to this day I still don't know what it is. The first time I trusted in the unseen. The first time I looked into the cup and saw the little red bug. The first time I knew, I was either being integrated or poisoned. The first time the truth was exposed. &amp;nbsp; \n\nI can't forget. I can't accept. I now feel as though I have been abandoned. As if I failed the initiation, as if I'm called back for the second test, and I'm fearful of the path I must walk to get back there. &amp;nbsp;\n\nPerhaps, I am already dead. Perhaps, the job has been done. Perhaps I just crave one more war, but no one will ever know what was accomplished, and neither do I. That's the traumatic part.  &amp;nbsp;\n\nBest Regards, &amp;nbsp;\n\nLittleRedBugs",
        "created_utc": 1446780766,
        "label": [
            "0"
        ]
    },
    "3usk9t": {
        "title": "I honestly don't care about completing this semester of college as long as the new Star Wars is not shit. No shame.",
        "body": "May the force be with you!!!",
        "created_utc": 1448848910,
        "label": [
            "0"
        ]
    },
    "3vha4v": {
        "title": "\"Jar Jar is Darth Plagueis- Reincarnated Before Death\" If you bought into the JarJarHype, you'll get feels watching this one LOL",
        "body": "",
        "created_utc": 1449272330,
        "label": [
            "0"
        ]
    },
    "3vhczr": {
        "title": "Meesa tink a Gooberfish been followin wesah",
        "body": "And will keep following us until the movie premiers.\n\nThe Gooberfish is the Darth Jar Jar theory and this sub. I feel it is consuming my being. I might actually hate the ST if this doesn't turn out true. It's so enticing. Gahhhhh, help I need some support my fellow Sith Gungans. It must be true.\n\nIT WILL COME TRUE!\n\n&gt;:-O",
        "created_utc": 1449273670,
        "label": [
            "0"
        ]
    },
    "3vm1wj": {
        "title": "Vadar needed Luke to 'Rule the Galaxy'. What did Vader and GL know that we did not?(DJJ)",
        "body": " At some point, Vadar becomes aware of Darth Jar Jar after becoming pupil to Palpatine. \n\nVadar knows that he can not defeat both of them alone and so he takes their side, BUT when he finds out he has a son, he finds new hope.\n\nFurther, why would the Master Sith be on the Death Star? Perhaps, he was the apprentice sent and not Vadar.\nThink about it, Vadar was looking for his Son and could care less about a hunk of metal.\n\nPalpatine also recognized Luke's power, and deemed he could also take down Darth Jar Jar with the help of Luke.\nIn the end, Darth Jar Jar wins by sending Palpatine to his doom. Darth Jar Jar knows the true heart of Anakin, and he foresees Vader fulfilling the prophecy. As fate would have, Darth Jar Jar and Skywalker will meet, as his conception was conceived by the most powerful Sith Lord in the Universe.\n\nTLDR; Luke Skywalker will face off with Darth Jar Jar.\n\n",
        "created_utc": 1449367220,
        "label": [
            "0"
        ]
    },
    "3w01y0": {
        "title": "Fans Reacting To ‘The Phantom Menace’ In 1999 Will Keep Your ‘Force Awakens’ Expectations In Check",
        "body": "",
        "created_utc": 1449618460,
        "label": [
            "0"
        ]
    },
    "4eoibz": {
        "title": "Battery ?missing? From my mother board. Help?",
        "body": "I have a hp dv6 i7 laptop. Next to the graphics chip, there is a place for a battery, probably the size of a nickel coin. Do I need this battery? What does this battery support? Why would a laptop be designed to require a battery that must be replaced? I'm counting upwards 40 screws and a good amount of time just to get to the mother board. Lol ",
        "created_utc": 1460592660,
        "label": [
            "0"
        ]
    },
    "4i3lnp": {
        "title": "I'm a college graduate now. Encouraging everyone that it is possible, don't give up!",
        "body": "What is possible for one is possible for all! Don't give up on your dreams! What ever you value, what ever the goal, give it your all. I took five years to reach a B.S. degree. I wasn't expecting to be hospitalized and diagnosed with a terminal illness. Don't give up hope!\n\nEdit: I will respond to comments as soon as free time opens up. I have a lot of family coming in town. Thank you for your support and for continuing to be a voice in this community!",
        "created_utc": 1462508420,
        "label": [
            "0"
        ]
    },
    "4ii0ym": {
        "title": "When a professor drops you a letter grade and you just have to accept it.",
        "body": "I used to be one to scheme, to plot, to seek vengeance. I used to be the one to boil in agitation, to shake in anger for a grievance. I found that playing it down, laughing over it, and knowing that someone who wrongs you is in fact beneath you, is more rewarding and leads to a peaceful mind. A professor dropped my grade an entire letter, but the light shines brighter on my success and their failure. It's more disappointing that they let me down, but I can laugh and smile at knowing that I earned a higher grade. I can view the entire course, seeing routinely high scores throughout that semester. I can see the one grade that knocked me a letter down. I can laugh at the 0 I receive for a grade, and how comical that professor looks. I can laugh over the professor grading my work two months after the fact and updating the grade seven days before the final. I can see the A on the final project and the A on the final exam, and know that I gave it my all, and the professor's consideration and respect for me was not as high as my respect for them. Sometimes, you just have to accept the reality of a situation and let it fade into your past.",
        "created_utc": 1462767936,
        "label": [
            "0"
        ]
    },
    "4ii71r": {
        "title": "A strong Pdoc was my best medication.",
        "body": "Discussing your mental health plan is a serious conversation to have with your Pdoc. Your personal progression through life with a full medication schedule or a sparse schedule is your responsibility. I'll tell you my story. I took on the world. I kept taking on responsibilities until I collapsed. I was a musician, organization leader, office worker, full time student, boyfriend, and a low scale cannabis broker(bulk buyer for my own habits and a select group of friends). In one week, I played the biggest show of my life, lost my job, un-earthed a coo against me in my organization, had finals week(failed out), broke up with my girlfriend,nearly had my residence raided. Talk about a stressful week. I had a mental breakdown, months in the brewing. Through a combination of this stress, a lack of sleep, and my migraine medication, my hypomania peaked and I experienced psychosis for the first time. I was coming down from the experience, when I went to the emergency room(anticipating a blood test for a case of mono (my girlfriend had also been sick, never confirmed mono though). My Dad deceived me, and within a matter on minutes I had pissed in a cup and was tranquilized against my will. In the meantime, my Dad was coerced into agreeing for me to be transported to a psyche hospital. I awoke in the ER and two police offices entered, and I was cuffed and place in the back of a squad car and driven off to the psychiatric hospital where I was coerced into voluntarily admitting myself. I had a nights sleep and was evaluated in the morning by my Pdoc. In his initial reports, he and his staff expected me to stay a few days at the most. It was not until I was subjected to anti-psyches that I triggered into a psychosis once more. My stay extended to two and half weeks. Eventually, my parents wised the fuck up, and realized how terrible the administration executed their hospital. A nurse literally doped me up on an antipsych, waited for it to kick in, and coerced me to sign that I did not want to discharge(voluntary admitted can legally discharge at will). It wasn't until my parents threatened a lawsuit that I was able to discharge and for about two weeks I suffered extreme withdrawals from the medications they administered to me. I struggled with my Pdoc for about a month on systematically decreasing my antipsych and demanded a minimal level on a mood stabilizer. Within three months, I quit my mood stabilizer cold turkey and continued unmediated for five or six months before my parents found out and began monitoring my medication, and the rest is a tale for another time.\n\n\n\n For the past six months, I have been extracting the medication and pretending to take it to appease my parents. My Pdoc and I had a conversation six months ago, and we agreed to ween off the mood stabilizer. My Pdoc canceled our last appointment for personal reasons, and then released me from his care after his hospital duties become more rigorous. My Pdoc's practice took on a new Doc, and I have planned to meet and switch my care over to them. My Pdoc would never have agreed to withdrawing the medication unless he had tracked my progress and ability riding the edge on medication levels. My Pdoc understood and recognized that my parent's perception of my progress was not the most valid indicator of how I was progressing; in fact, we broke my sessions up in half. The first half I would actually meet and discuss the truth with my Pdoc, and then my parents would come in and have their say; all the time, my Pdoc expressing that he and I both knew why I continued to see him, mainly to appease my parents and keep their stress on my life to a minimum. Now, don't get me wrong, I love my parents and they love me, but they are quite ignorant when it comes to genetic disorders and don't know what to do but \"hawk\" over every aspect of my life. I gave them the nickname \"the wardens\" for controlling and monitoring my medicine. LOL I had to change my life to take back control of my life, and coming off medication was not a solution. It was not the first step, but it was a step that I planned with my Pdoc and with his confidence. \n\n\n\nAm I an anti-medication nut? Truthfully yes, but I am not naive. I keep my prescriptions up to date. I have my safety net prepared. I recognize that the medication had a vital role in my recovery, and it is vital for most Bpers to maintain their medication schedules with their Pdoc's confidence. I hope my story relates and that you don't take your predicament lightly. Demand the best out of your Pdoc; set the bar high. A strong Pdoc was my best medicine.",
        "created_utc": 1462771139,
        "label": [
            "0"
        ]
    },
    "4it7ml": {
        "title": "Social Engineering, tell me your stories. You wouldn't believe mine(I wouldn't either LOL).",
        "body": "For context, social engineering is a practice in many companies, agencies, entities, in which professionals enact situations for training purposes, behavior control, habit forming, etc etc, a quick google-search will give you a general idea.",
        "created_utc": 1462939839,
        "label": [
            "0"
        ]
    },
    "4jeqd7": {
        "title": "Does anyone else medicate on an Anti-Psych regimen alone?",
        "body": "I was quite surprised to learn from my new Pdoc that symptoms could be managed alone by an anti-psyche. Has anyone else received this advice? My new Pdoc suggested using my medication primarily for insomnia.",
        "created_utc": 1463287738,
        "label": [
            "0"
        ]
    },
    "4jus8h": {
        "title": "Favorite radio talk shows?",
        "body": ":)",
        "created_utc": 1463542641,
        "label": [
            "0"
        ]
    },
    "4l26b7": {
        "title": "Found a new juice(e-liquid) source online. Couldn't be happier! :)",
        "body": "[removed]",
        "created_utc": 1464214388,
        "label": [
            "0"
        ]
    },
    "4l3oo0": {
        "title": "With an infinite IQ bounded to traverse the normal curve, how do you evade the boredom of this world?",
        "body": "What makes you tick?",
        "created_utc": 1464237284,
        "label": [
            "0"
        ]
    },
    "4lku8f": {
        "title": "Never took the time to understand Mixed Episodes",
        "body": "Still disagree with this type of rhetoric. You aren't stable in a \"mixed episode\" your psychotic. \n\n\nThere's only depression and mania in my book. If they are mixing, you are most certainly in psychosis. \n\n\nThoughts?\n",
        "created_utc": 1464535983,
        "label": [
            "0"
        ]
    },
    "4mi36q": {
        "title": "Famous Last Words for all you punks D-:&lt;",
        "body": "",
        "created_utc": 1465042913,
        "label": [
            "0"
        ]
    },
    "4mrm8i": {
        "title": "Come play League of Legends with me; my use name is, you guessed it, LittleRedBugs :)",
        "body": "It's fun :)",
        "created_utc": 1465194260,
        "label": [
            "0"
        ]
    },
    "4muf1t": {
        "title": "So, can I get imprisoned for getting black-out drunk with a girl and have sex in public?",
        "body": "",
        "created_utc": 1465237335,
        "label": [
            "0"
        ]
    },
    "4nv01a": {
        "title": "Every time a massacre occurs, I want to go buy a gun, before I'm stripped of the right to defend myself.",
        "body": "[removed]",
        "created_utc": 1465813201,
        "label": [
            "0"
        ]
    },
    "4ormxy": {
        "title": "Had a fantastic adventure this past week, but can't be happier to be back home and playing L.o.L. How's everyone's weekend going?",
        "body": "",
        "created_utc": 1466305558,
        "label": [
            "0"
        ]
    },
    "4orv9v": {
        "title": "Ranting on /r/bipolar like a \"lunatic\"...",
        "body": "What else can be expected? lol, I mean seriously though, how can this community tolerate half the posts made to this sub. There's always ranting, there's always opinionated topics, there's always different view points, there's always summation, there's always a bundling of groups and ideology for the sake of the TLDR;\n\nThis is the internet. What else would be expected? Out of all the subreddits, r/BP/ never ceases to amaze me when it comes to the butthurt commentators. \n\nEND RANT\n\nEDIT FOR CLARIFICATION: How could the community tolerate half these posts IF WE were not very open and loving. I've seen a lot of love in this sub, but every once in a while it gets nasty, of which I'm also guilty. ",
        "created_utc": 1466309721,
        "label": [
            "0"
        ]
    },
    "4oyfre": {
        "title": "So pretty hypo, and my family/GF wants me to quit vaping...Advice?",
        "body": "Hey all, so the title says the most. I use an electronic vaporizer for nicotine consumption. I am already fairly hypo(positive mood) and I'm a little concerned about quitting using nicotine. I feel as if my energy is going to spike, and I might get a little quirky.\n\nWhat medication could I try to get from my Pdoc to make the transition smoother? I'd rather not have to take my Olanzapine by giving up Nicotine, but I find that when the energy goes up to quickly, I have to be more careful on how I spend my time, money, make decisions, etc...It's just a pain sometimes, having too much energy, and for that, I apologize to anyone in depression right now! We all have the ups and downs :/",
        "created_utc": 1466424776,
        "label": [
            "0"
        ]
    },
    "4pkpb7": {
        "title": "It's almost like I'm in My Perfect Hypo-State, And I can't Feel Anger.",
        "body": "Just had a conversation with some folks, and they said some very infuriating things; yet, I'm in such bliss that I just dismissed it all. I can't get frustrated or aggravated over some people who just don't understand what's in my best interests.\n\nSimilar feelings?\n\n-END RANT- HAPPY RANT",
        "created_utc": 1466738288,
        "label": [
            "0"
        ]
    },
    "4q7vfn": {
        "title": "Finally reached my perfect equilibrium. Unlimited energy and constant focus. Love it.",
        "body": "So, I've transformed over the past 7-8 months. I've finally reached the 3-4 week period where I have been able to set my schedule, routinely work out, keep my diet up, and just enjoy life for what it is. I've found my inner peace, my strength has returned.\n\nGotta love summer, who is your summer going?",
        "created_utc": 1467092488,
        "label": [
            "0"
        ]
    },
    "4qe1ef": {
        "title": "So Hypo, I could just call it manic, but I'm in full control. These always the most beneficial times of my life.",
        "body": "There is always a 2-3 week period in my yearly cycling that I can take grab hold of and set the tone for the rest of the year. I challenge and encourage everyone to finish 2016 strong. \n\nI know what goes up must come down, but perhaps we can prove physics wrong for once(haha just joking).\n\n\nI hope everyone is having a good night.\n\n\nRegards, \n\nLittleRedBugs\n\n\nEDIT: Title lol, I can always tell I'm pushing the limits when I start making really bad writing errors.",
        "created_utc": 1467179909,
        "label": [
            "0"
        ]
    },
    "4qq1f8": {
        "title": "Applied to five jobs, within a week, three job offers. I'm manic, but I'm rooted in my faith.",
        "body": "So, I have accepted two of the positions, and I am meeting with the manager of a third company tomorrow. They are all open and encouraging my part time work schedule.\n\nI couldn't be more joyful. \n\nNever give up your faith, my friends.\n\n\nI'm ecstatic. I am taking my Olanzapine, but I'm afraid I've reached the point of utmost joy. I am aligned with my creator. Good God, what have I become but the image of what I once thought was impossible. I encourage everyone to chase their dreams, to listen to their doctors, to take the steady course, to plan step by step, and to reach for the stars.\n\n\nI've made it folks. I think I've finally made it. I had half a bottle of shampagne to celebrate(with my sister) and burnt a fire. I've spent the last hour staring at the stars and just feeling the vibrant energies of the universe swarm around me.\n\nYes, my imagination is certainly broadening, I hope you don't mind the gradiose metaphors.\n\nI'm just really happy, and wish nothing more than to share and inspire some of you whom may come across this post. If you ever need a word of encouragement, whether you be my brother in Christ or my brother in humanity, just know, I am always open and willing to help you in any way possible to tread through this illness.\n\n\nWe can succeed, reach out to those in your support group!",
        "created_utc": 1467349409,
        "label": [
            "0"
        ]
    },
    "4qw0mj": {
        "title": "really Hypo, the Olanzapine is keeping me out of mania, my new job though...it's got me running at full capacity. I feel so useful right now. God, don't let me crash now!",
        "body": "Hope everyone has a good weekend.",
        "created_utc": 1467438226,
        "label": [
            "0"
        ]
    },
    "4rglp1": {
        "title": "What jobs are illegal or frowned upon for bPers?",
        "body": "",
        "created_utc": 1467776318,
        "label": [
            "0"
        ]
    },
    "4tjqwk": {
        "title": "2yr Relationship, Can I suedo white-night, but still be alpha as fuck? I got her locked in, no doubt. She Jealous of every woman within 1 meter of me.",
        "body": "So, my Bae is great. I absolutely love doting on her and providing for her. So, I guess I am wondering if I can transition to being the white-night, because I am the romantic type, that is for certain, but at the same time, maintain my alpha dominance in the relationship.\n\nMy girlfriend becomes very jealous when I am around other women. It almost increases her sex drive 10 fold. I go white night a random fucking girl in public, and my Bae gets super jealous and territorial. Got her hooked pretty deep no lie. Anytime she steps out of line, I can easily coax her back just by giving the slightest attention to another woman.\n\nIt's good and bad, but I mean, she's very loyal to me, and we've been together near 2 years, I have her V card, we make love 3-8 times per week, I take her out on 4-5 dates per week, hold respect with her father(she's Hispanic...big macho quality to be cool with Dad), and I work 14-18 hours, six days a week, so basically, in my free time I am just on a pillar. My Sexual value whatever is infinite, I literally have no trouble with women, only power tripping bitches. \n\nI guess unfortunatly, I have the body, brains, work ethic of an Alpha, but I have the heart of the beta.\n\nCan I pull off the white night, or am I just hurting the cause, fellahs?\n\nThanks,\nLittleRedBugs\n\nEDIT: Only a DISDAIN for women out of line and out of place, fake ass bitches.",
        "created_utc": 1468910047,
        "label": [
            "0"
        ]
    },
    "4tjzli": {
        "title": "So, my LTR and I are a \"comfortable couple\". I think I have a strong abundance mentality as well as remarkable dread game, but I'm wondering if it's in my best interests to hit the gym hard for a few weeks.",
        "body": "I'm 240lbs, 23% body fat. I used to do Olympic lifting training. My mass is still impressive, I've just not taken the time to go to the gym. At this point, do I even fucking have to, other than to improve myself? I tore my achilles injury 2 years ago, literally a week or two after beginning my LTR. I used to be a more toned and around 15% body fat.\n\nAfter months of gradual convincing, I convinced my LTR to get a membership at my gym, and we have started going together from time to time.\n\nCurrently, I have other goals than my \"health\" persay, but I eat a hearty diet(healthy food, not junk). My BMI is atrocious because of my muscle density; however, I am slightly overweight, I think I'd like to get back down to 15-18%, which I know I am capable of doing in 2-3 weeks of twice-a-day routines.\n\nIs it worth pulling off my work schedule(I work 14-18 hours, 6 days a week) in order to improve my health for the sake of my SMV, or would the loss of income and work detract from my SMV.\n\nI suppose the question is: Do I need to balance my tactics in my LTR? I am happy, she is happy, and we are slowly improving our health, but we aren't overly concerned with being god-like models.\n\n;TLDR I'm overweight, but my overall SMV is good. My LTR doesn't seem to have a problem whatsoever with my weight; she is satisfied by my weight(As well as our sexual relationship), and I see this LTR as going the distance. Do I need to change my physical appearance, am I just waiting to get shot in the foot later down the road?\n\nThanks,\nLittleRedBugs",
        "created_utc": 1468914758,
        "label": [
            "0"
        ]
    },
    "4usjke": {
        "title": "In that phase where your sO is breaking down from realizing that you are chronically ill. Advice welcome.",
        "body": "So, my SO has known about my illness for a year, but she is just now starting to understand it's implications should we get married and start a family together(I want a big family).\n\n\nShe breaks down every so often because she wants to be able to support me if something were to go amiss. I have been off medication for years(Doctor Approved), and I also have a very strong support system, routine, etc.\n\n\nI've directed her towards bipolarSOS and we have begun watching movies recommended by Bphope online. It seems to be helping her cope with the landslide of information; however, I just don't know how to get through to her that I'm doing great. As an anomaly of our kind, I can't help but be inwardly frustrated at her lack of confidence in me. As if, she believes I am on the edge and could crack at any moment.\n\n\nAny advice on the matter, would be greatly appreciated.\n\nThanks,\n\nLittleRedBugs ",
        "created_utc": 1469588694,
        "label": [
            "0"
        ]
    },
    "4usn1v": {
        "title": "Watching Silver Linings Playbook with my SO, feel like utter shit now. Did I ask for a taste of Depression. No. I fucking DID NOT.",
        "body": "Rant.",
        "created_utc": 1469590149,
        "label": [
            "0"
        ]
    },
    "4v6bvb": {
        "title": "We've got to resist",
        "body": "Himalayan life.\n\nPeak to peak, avoid this strife.\n\nTemples of peace,\n\nthe mind becomes weak.\n\n\nCrashing, the sun fading.\n\nClouds of deep aging.\n\nI felt a bliss upon these mountains,\n\ndoubting the cliffs and the heights,\n\nnever leaning my sights,\n\nat the depressions of valleys beneath my feet.\n\n\nAnd when the storms came,\n\nimpeccable rains,\n\nthe rocks slid right from under me,\n\nthe hand of God slumbered me,\n\nand I rode on wings to the depths,\n\n\nResisting the urge to plunge into the darkness,\n\na dive bomb into the forests,\n\nI cried out in pain.\n\n\nAs I descended, I felt the weight,\n\nit was not lifted.\n\nI shifted, my mind almost twisted.\n\nTo lay still and retain my position,\n\nmy soul began it's nuclear fission.\n\nRipping apart my journey in the peaks,\n\ninflicting pain on adventures and feats.\n\n\nResist this urge to stay off the mountain,\n\nto sore with eagles,\n\nto drink from fountains.\n\nThey say youth is but a mindset,\n\na vision, a passion.\n\n\nOld as I am, I resist to be fashioned.\n\nI resist to lay forever in the depths of depression.\n\nI resist to hide and shutter, at youth and my passion.\n\nI resist the pain in failure and displacement.\n\n\nI resist those who would ask of me to never climb again.\n\n\n\n",
        "created_utc": 1469795409,
        "label": [
            "0"
        ]
    },
    "4wjfxz": {
        "title": "New Skillet Album. Enjoy.",
        "body": "",
        "created_utc": 1470544255,
        "label": [
            "0"
        ]
    },
    "4wjtaa": {
        "title": "Sleep Schedule shifted",
        "body": "Shifted my schedule to 9am-3pm.\n\nAnyone else sleep at peculiar times of the day?\n\nOr is it just me?\n\n-LittleRedBugs",
        "created_utc": 1470551939,
        "label": [
            "0"
        ]
    },
    "4wjww5": {
        "title": "Should my parents have know?",
        "body": "TLDR; Bipolar bruh, If I could go back, I'd see the signs, the obvious signs.\n\n\nI always look back and think, \"Shouldn't my parents have known that I would become Bipolar, eventually\"?\n\n\nIt's a heavy accusations; that my parents disregarded the signs and the family history, and by no means are they to blame, but I can't help but be smitten with bitterness over their lack of oversight.\n\n\nTo give one example:\nI played a very popular MMORPG as a child. Since the 5th grade, I would stay up till 1-2am and rise by 6 to go to school. Somtimes, I'd go to bed as early as 9 or 10 in order to wake up a 3 or 4 in the morning to play this game.\n\n\nWas this not a major indicator? Could they not see the mischievousness and vindictiveness of my actions?\n\n\nI would ascertain their email passwords, computer passwords. I would learn new ways to hide my game play. Some days, I would play 18-30 hours, spilling over into tomorrows dreamland.\n\n\nThis game shaped me, molded me, taught me many things about life. It was truely a useful tool, and probably post-poned my eventually rendevue with fate, the fate of hospitalization in my twenties.\n\n\nYet, I can't help but think: Why did they not see IT?\n\nLooking back, I see it now. How could I, as a child, comprehend what I was doing to my mind and to my body. For all I knew, I was a kid, a kid addicted to video games and staying up all night long. I was a go-getter. I was an athelete. I was a straight A student. I saw what I wanted, and I gave it everything I had.\n\n\nI guess I never failed in life, until my twenties. Perhaps, I didn't fail enough, and this curse, this plague, these genetics, were a reminder that we are all fallable. That we all fall. That no one is free from repercussions. We all must stand the tests of life.\n\n\nI just wish I had been more prepared and aware of the challenges I would face.\n\nTLDR; Bipolar man, If I could go back, I'd see the signs, the obvious signs.",
        "created_utc": 1470554147,
        "label": [
            "0"
        ]
    },
    "4wjxzp": {
        "title": "Hypo-depressive is literally the best I can ask for",
        "body": "It may just be me, but when I'm in a low energy state, but my mind is running at 120%, I feel like I'm in a good state.\n\nI can get so much done from home, and I don't have to worry about going out and doing something stupid.\n\n\nAnyone else relate?",
        "created_utc": 1470554896,
        "label": [
            "0"
        ]
    },
    "4wrebd": {
        "title": "New Stuff for you to check out Music/Netflix",
        "body": "So, there's been a new season of Bojack Horseman to come out and if you like heavy rock, check out Skillet's new album: Unleashed.\n\n\nBoth are great :)",
        "created_utc": 1470678115,
        "label": [
            "0"
        ]
    },
    "4wrekv": {
        "title": "My BP best friend doesn't believe that I'm BP too. Maybe he's delusional",
        "body": "Hahaha, did you see what I did there?\n\n\nBut really, it's like he wants to see me out bipolar him. I don't think he could handle it.",
        "created_utc": 1470678197,
        "label": [
            "0"
        ]
    },
    "4wrfgn": {
        "title": "2:08 People, 2:08, this right here, watch the next two minutes, change your day in an instant!",
        "body": "",
        "created_utc": 1470678448,
        "label": [
            "0"
        ]
    },
    "4wrq70": {
        "title": "First Post, Self Post, feel free to follow the same style and post a little about your story.",
        "body": "Hello all,\n\nmy background:\n\n\nCollege Educated\n\nLong Term Relationship\n\nGym 5-7 times per week\n\n40-60hr Work Week\n\n\nWhat's your basics? :)",
        "created_utc": 1470681636,
        "label": [
            "0"
        ]
    },
    "4wrsdj": {
        "title": "Don't be trapped by Dogma, \"Why I am against Remission...as the goal of Bipolar Treatment\".",
        "body": "",
        "created_utc": 1470682304,
        "label": [
            "0"
        ]
    },
    "4wrsz7": {
        "title": "\"Not Getting better, but that's OK\" -&gt; Why we must fight, its our only hope.",
        "body": "",
        "created_utc": 1470682482,
        "label": [
            "0"
        ]
    },
    "4wst9u": {
        "title": "Working on the CSS, any links would be appreciated. :)",
        "body": "Thanks!!!",
        "created_utc": 1470694209,
        "label": [
            "0"
        ]
    },
    "4x9vdd": {
        "title": "Remission is possible. Don't fall for the nay-sayers. It's possible. Don't let anyone tell you that you can't make it.",
        "body": "",
        "created_utc": 1470944379,
        "label": [
            "0"
        ]
    },
    "4xxupk": {
        "title": "Response, Remission, and Recovery in Bipolar Disorders: What Are the Realistic Treatment Goals?",
        "body": "",
        "created_utc": 1471323950,
        "label": [
            "0"
        ]
    },
    "4xxuur": {
        "title": "Hey all, I've been busy finding a new job in my career field, but I'm still putting some thought and energy into this sub!",
        "body": "Still planning to upgrade the CSS a little more, create a graphic background, and perhaps work on the Flair as well as posting flags.\n\n\nIf you have any tips or suggestions, PM or post here!\n\nThanks!",
        "created_utc": 1471324029,
        "label": [
            "0"
        ]
    },
    "4y3yh7": {
        "title": "Anyone have DPD Dx? What's your story?",
        "body": "Depersonalization Derealization Disorder.",
        "created_utc": 1471411760,
        "label": [
            "0"
        ]
    },
    "4zskdy": {
        "title": "Credit Card debt isn't all that bad because I can afford it, but my assets aren't liquid. I might have to pass on a good opportunity because they want a cash transaction. Tell me your credit stories. :)",
        "body": "Basically, I have 80k line of credit, but I can't move forward with a great opportunity because they want a cash advance. It really sucks, because I can totally afford it!!! Just, not in an instant :/ I'm so desperate, I'm downloading apps and trying to find odd jobs to come up with some quick cash.\n\nAny suggestions? Tell me your credit stories :)\n\nI'd rather not take a 70% reduction at a pawn shop, but I've liquidated belongings there before...it wouldn't be the first time. Lol.\n",
        "created_utc": 1472269897,
        "label": [
            "0"
        ]
    },
    "50rzug": {
        "title": "I used to work in insurance, until I was denied coverage.",
        "body": "Anyone else have trouble finding life insurance?\n\nI couldnt believe I was rejected by a company I represented. Lol.",
        "created_utc": 1472799548,
        "label": [
            "0"
        ]
    },
    "515p8g": {
        "title": "The knowledge of God, prophecy.",
        "body": "It has arrived on Earth, in this generation.",
        "created_utc": 1473019394,
        "label": [
            "0"
        ]
    },
    "5181go": {
        "title": "I feel as if everyone i had faith in before my Dx, disappeared and that no one believes in me anymore. Can you relate?",
        "body": "My friends, my family, I feel as though no one believes in me. No one believes in my dreams nor my goals. It's sad; I have a poster on my wall from a SO(anniversary present). It says something like, 'a good life is when you smile often, dream big, and laugh a lot, realizing how blessed who are to have these things'.\n\n\nSmiling and Laughing, okay I can handle those things, but dreaming big? I feel as though I'm not allowed to dream anymore. My dreams are unrealistic. My dreams are ever changing. My dreams aren't real. I'm not allowed to have these dreams. No one believes in my dreams. How can I believe when no one else will?\n\n\nI'm sure you can relate? The stress of over coming the fact that NO ONE believes in you anymore, it's enough to keep you in depression for the rest of your life. I hope you find the inspiration you need to push for your dreams, even when no one else believes in you. I hope you inspire others every chance you get, I know I do. I never tell someone they can not do something; because, that is the hell I live in. I'm surrounded by doubters and nay sayers, and anyone that knows what I live with, will never have faith in me to be great.\n\n\nTo me personally, this is the greatest sorrow of my life, but allows the greatest opportunity to pursue joy. At the end of the day, when I am great, there will be nothing to stand between me when I exclaim I am great for God, and no one say God could lift me out of this hell.",
        "created_utc": 1473054531,
        "label": [
            "0"
        ]
    },
    "51k5i2": {
        "title": "I realized that I was alone, utterly alone, and not even God could comfort the coldness my heart felt in the following months.",
        "body": "During my first hospitalization, I literally told my Pdoc what I was doing in my life, my accomplishments, and they said it was all grandor. Like, I couldn't possibly be a College student, leader of a school organization, in a successful music band, in a relationship with a girlfriend, and training to compete in the Olympics. They couldn't believe a person could do all that. Well, fuck em, because I had the proof as time passed by, and my Pdoc realized I was seriously pursuing all those things, when I just happened to get prescribed a medication for my migraines, a medication that caused my mania...but still, all my pursuits, all my dreams, crumbled, because the people that believed I could be great, took the lie that I wasn't great at any of the things I talk about, and I realized that I was alone, utterly alone, and not even God could comfort the coldness my heart felt in the following months.\n\n\nI'm back on the climb up, pursuing the passions I left at the peaks. Never give in, my friends. You've got to push past acceptance, and find a love for yourself that you can never loose sight of ever again. Love yourself, and love your haters, they'll eventually become your biggest fans.",
        "created_utc": 1473234604,
        "label": [
            "0"
        ]
    },
    "51tw4f": {
        "title": "Bipolar, the non-medication route, what can we learn from history and past techniques? Bipolar isn't a modern invention.",
        "body": "",
        "created_utc": 1473371961,
        "label": [
            "0"
        ]
    },
    "51txoc": {
        "title": "I'll be implementing some CSS updates over the weekend. Format might totally train wreck, but I've got some cool ideas to brighten up the sub.",
        "body": "",
        "created_utc": 1473372483,
        "label": [
            "0"
        ]
    },
    "51vxlo": {
        "title": "Please welcome user: theycallmeofearhail who has been helping me code the CSS. With another coder on the team, we will have a real nice looking sub!!!",
        "body": "theycallmeofearhail has been coding for mental health subs in his spare time and ran across our new sub, offering his skill and expertise. I'm really excited that he will be joining the moderator team!!!",
        "created_utc": 1473400787,
        "label": [
            "0"
        ]
    },
    "52u8gz": {
        "title": "So conflicted as a Conservative dating a DREAM act immigrant, of the past two years. This election is pulling me in all directions :/. Can you relate?",
        "body": "[removed]",
        "created_utc": 1473908112,
        "label": [
            "0"
        ]
    },
    "53yni4": {
        "title": "Soros can stoop even lower",
        "body": "",
        "created_utc": 1474546716,
        "label": [
            "0"
        ]
    },
    "5af3qu": {
        "title": "a word of advice for those who may need to get back to the basics",
        "body": "TLDR; Get back to the basics of well-being, and prioritize a healthy lifestyle, in the body, in the home, in the wallet, in the career, in the mind.\n\nIs it a good thing to clean my closet? Why bother, my life's a mess, it doesn't matter. Should I brush my hair? Should I vacuum my carpet. Why? I've been lying around all day. I've been loathing. Why do such minuscule tasks? I have SO MUCH to worry about, so much to do, so many things unfinished. Why on earth would I waste time doing something so small. \n\n\nThis message may be better received by the depressed, but possible the manic who feel overwhelmed:\n\n\nGive your self no room to be complacent. Start in your dwelling. It's about accomplishing small tasks, not only for the sake of repetition, focus, and habit building, but because once you knock out the small things, then you get BETTER and FASTER at doing them, this will give you more time to focus on 'the big picture'.\n\nHere's the short list: 1. Attend to your room\n\n 2. Attend to your bathroom\n\n 3. Attend to your living areas\n\n 4. Attend to your kitchen\n\nBed made, one load of laundry per week, change your sheets once a week, keep your closet tidy, vacuum once per week, dust once per week.\n\nClean your tub once per month, clean the sink once per week, clean the mirror once per week, the floor, etc.\n\nYou get the picture? Now your living spaces, now your kitchen area.\n\nAttend to your dwelling so that you may be free form the burden of it. Do not let complacency keep your mind from 'the big picture' because you've got to 'do the chores'. Go ahead and knock out the small stuff just so you can have a clear space, a place to think, a place to relax.\n\nCleaning your dwelling and belongings is the first step.\n\nWhy? Does a dirty mole live in a dirty hole? Yes, yes it does. If you clean your dwelling, you will notice that you need to take the next step, cleaning you.\n\nProper hygiene:\n\nbrush teeth, combo hair, shower daily, wash hair a few times a week, floss, perfume/cologne/deodorant, dress sharply, dress for success, dress your best, clip your nails, present yourself in the most refreshing, cleanest way. Feel good about taking care of your personal hygiene. You don't have to go overboard, and eventually it becomes mere minutes of your daily routine. It's sometimes fun to 'race the clock' and see just how fast you can get through it all.\n\nSo the next step, you've got a clean dwelling, you've got a clean and kept up body, so are you going to eat junk food all day and have an IV of coca cola? Hell no. You've got a clean space, a clean body, it's time to focus on a clean diet. Try to incorporate foods high in micro-nutrients into your diet, get on a regular eating schedule, plan healthy snacks. Get on a general routine of eating. Even if you don't want to, you really do. Eat TASTY healthy food. I've felt the 'im bipolar, I'm not hungry' many times, but after a few tastes of GOOD tasting, healthy food, my appetite spikes. If you get in a good routine, your appetite will naturally spike around certain times of the day. Some people barely eat breakfast, but after getting into the habit, they eventually wake up hungry for a huge breakfast, it's all about pushing into a system, a logical progression of steps to improve your well-being.\n\nSo, clean dwelling, clean body, clean diet. What else can we clean at this point? From here, it really depends on the plan you set, but I think that it's most important to solidify what you can do easily versus taking on some of the 'harder to break' \"symptoms\" of bipolar.\n\nMy next recommendation is to clean your finances. You've got debt? Sit down with a financial planner. There are some free resources for this, and no you don't act on their advice, but it will be a great source of learning. You've got to set a budget, for your own personal peace of mind. You need to know how much \"money\" or rather time spent working, do I require to maintain and keep myself healthy. Don't think about kids, a family, entertainment. Netflix is $8 bucks a month(do that), you can chill on the entertainment for right now, you gotta get down to the basics. Once you get to the basics, find a job that will cover your basics, and if you are in debt, you need to find a job that covers the basics, but also helps you take down the debt. ---&gt; I am a financial planner as well, and there are many steps to take, but the first two steps of establishing income, saving money( PAY yourself), and get rid of debts. I can go further if you would like to know more, but I promise you that having a strong financial sense will help control your thoughts and behaviors, and keep you away from financial traps and spending sprees.\n\nSo, clean dwelling, clean body, clean diet, clean finances, CLEAN JOB. I'd like to further expound upon this. I think you should go for the best job your education can offer you, but you've got to way the pros and cons. Really consider employee benefits, really consider drive time as a major LOSS of time. If you have to drive a total of an hour or more for work, factor that out of your pay and your life as loss of time. You didn't work 8 hours that day, you worked 10, considering the lunch and the drive time. You want to compensate by finding a job closer to home, that is the most congruent chunk of time. Pick a job that you know has a great training program. BRING THIS UP IN INTERVIEWS. \"Tell me about your employee training\". This is almost the most important question you can EVER ask in an interview IF you want to keep your stress levels low, and find a job that is not stressful. Jobs are only stressful when you don't know what to do exactly. Finding the right job, a 'clean' job, will truly benefit your overall well-being.\n\nClean dwelling, clean body, clean diet, clean finances, clean job. You're making your way up Maslow's Hierarchy of Needs pyramid. I know I've talked about a lot, and honestly, this would take at least 30-60 days to accomplish and get a good foot hold on, so I'll stop here. Feel free to follow up for the next steps, which include clean friendships, clean relationships, clean life.\n\nIf you start small on this steps, and progress back through what's really important in your life, well-being, and survival. You'll come to find that you won't have time to consider 100s of different impulses at once. You'll have your mind so busy on your own well-being, that the rest will just fall into place.\n\nMake your wellness, your well-being, your lifestyle, the path forward. Set this as your goal, your dream, your priority. Get back on top of just being you and taking care of your needs on the basic level. The path forward is straight and narrow. You've got to make your way back on to the path.",
        "created_utc": 1477949101,
        "label": [
            "0"
        ]
    },
    "5dzd76": {
        "title": "So, I've been in a tight squeeze since my last posting. Landed a new job, and now am setting up routines. This will be a biweekly routine. I'd like to get focused, and try to buff this sub up. :) Updates soon!",
        "body": "Updates soon! Keep fighting!",
        "created_utc": 1479666811,
        "label": [
            "0"
        ]
    },
    "6i00f0": {
        "title": "Our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure.",
        "body": "",
        "created_utc": 1497797370,
        "label": [
            "0"
        ]
    },
    "6kkzmj": {
        "title": "Of this I've come to know",
        "body": "Your secrets are more precious than gold. :)",
        "created_utc": 1498882123,
        "label": [
            "0"
        ]
    },
    "6p7n6y": {
        "title": "Approaching year 2 of medication free living. Still faking emotions and increasing manipulation. Seems like I'm almost back to normal. Sociopathic? Well, I do like being social, persay.",
        "body": "Cheers,\n\nBugs",
        "created_utc": 1500893870,
        "label": [
            "0"
        ]
    },
    "6pd7hw": {
        "title": "Triggered: 'To The Bone' Movie available on streaming Services, broke me",
        "body": "So, I've been self medicating for a few years now. Watching To the Bone on Netflix literally broke my will. I couldn't believe it. I love to eat food. So does my SO. It's a passion. I guess I realized that I may need help, even when I'm feeling okay with who I am. I learned that having a support system can be a matter of life and death, and to be honest, I've been quite depressed the past few months. My job, my relationships, I've found that I had to keep running from my life to find my life, and I can't forget how great I used to be. What I've given up for the needs of others. This movie really woke my soul, and stirred me back into the light.\n\nI hope you consider watching To the Bone on streaming services. It changed my perspective, and I know, it'll be the wake up call you may very well need to hear.\n\nRegards,\nLittleRedBugs",
        "created_utc": 1500948854,
        "label": [
            "0"
        ]
    },
    "6pdnxq": {
        "title": "How do I know Aspergers",
        "body": "Hello everyone. I'm a very shy person. I'd like to know more about Aspergers. I was Dx'ed as Bipolar after a stint of cannabis addiction and a psychotic episode. It's been almost five years, and I'm considering getting a full evaluation again, most likely out patient.\n\nI'm just trying to figure out what Aspergers syndrome actually means. I've read the Diagnostics manuel, but it was almost five years ago. \n\nAs a child, I hit 6 out of the 10 flags for Autism. My mother didn't have me evaluated because I began becoming more social. I've always been a smart kid, good grades when school become important, and currently I am a System Integration Engineer. It took me five years to earn my Degree in Computer Science, admist my first 'episode'. I'm open to conversations, but please be careful. I'm trying to be open about who I am, and I'm really considering that it's possible, I may have been to shy to accurately help the Doctors figure out what was happening during my episode.\n\nI'm quite the argumentative person. I like to be right. I like to know facts and knowledge. I like to tell people the truth, and I'm not very filtered. My mouth gets me in trouble, but when I'm over stimulated, it's hard to not get angry. I get very must-win-all attitude, and this drives me. \n\nPlease let me know what I might be missing, or perhaps, what I might be ignoring. I'm not really cognizant of my own persona, yet, I've got a feeling, that you all might be able to dispel any misconceptions I have about Aspergers.\n\nFire away.",
        "created_utc": 1500954191,
        "label": [
            "0"
        ]
    },
    "6qshjg": {
        "title": "That stage of grief when you realize you are bipolar, and bipolar the shit out of people just because you've been labeled. Welcome to the other side of reason.",
        "body": "",
        "created_utc": 1501545342,
        "label": [
            "0"
        ]
    },
    "6qzy7e": {
        "title": "The best Part about Depression is learning to fall in love with yourself. To all those hurting, don't lose hope. Lil'bugs ain't no quitter. I'm always here for my family.",
        "body": "Stay in touch, and keep your voice vibrating with us.\n\nRegards,\nLittleRedBugs",
        "created_utc": 1501627673,
        "label": [
            "0"
        ]
    },
    "6r1c7w": {
        "title": "Open Letter to My oldest Sub",
        "body": "I know the Mods couldn't forget a shit poster like myself, or perhaps I'm being too humble. :-D Okay, jokes aside:\n\nDear Bipolar Family,\n\nWe've had our ups and downs from time to time, and I know you've praised me in my weakness and criticized me at my strongest, but I'd like to open this discussion for anyone who's seen a positive impact on their lives from /r/bipolar/\n\nHere's me:\n\n\nI found /r/bipolar in a dark time of struggle. I had just been Dx'ed and couldn't bare to look at my friends, my family, and most of all myself.\n\n\n I had to regain what I had allowed to be taken from myself. I toiled with the notion that I had received what I considered a curse. A great turmoil of emotions, I spent years of my life back and forth, going against anything and everyone in which I could exhibit my angst. I found /r/bipolar , and did as all redditors do, karma-whored the shit out of every post. Well, not consciously. I learned more about my fellow bipolars than I could bear in just a few years. It took me four years to recognize the depth and breadth of this sub. I really appreciate the support I've seen and graciously accept the criticism. I'll be the first to say, I push people's buttons. It breaks my heart to see anyone in this sub suffering, it truly does. I couldn't be more grateful to be part of something, and to share in the experiences of anyone who walks into the light of /r/bipolar/\n\nMy flair says Future Hope, because that's what I've always want to get out of this sub, what I've always wanted to become. I just hope that this sub remains open, free, and welcoming.\n\nBest Regards,\nEver returning,\nLittleRedBugs",
        "created_utc": 1501642503,
        "label": [
            "0"
        ]
    },
    "6r1k9d": {
        "title": "Well, well well. The job seems to have finally become stable. It took long enough. No promises, but I promise to get some traction on this sub. Please keep this sub in your thoughts(suggestions welcomed)",
        "body": "I've finally hammered out my position in a new company, while it may end up with me relocating to another state. Thank you to anyone and everyone that's been patient. I hope to continue this sub's dialog, and get back on track with a customized sub, dedicated to helping those in stability and those in remission get the right tools in their hands to take this illness by the balls.\n\n\nRegards,\nLittleRedBugs",
        "created_utc": 1501645071,
        "label": [
            "0"
        ]
    },
    "6r1loh": {
        "title": "Consider improving your toolkit, check out the reviews for BP-In-Order. It's a saftey net that I've considered including in my toolkit. Thoughts?",
        "body": "",
        "created_utc": 1501645538,
        "label": [
            "0"
        ]
    },
    "6s9zzl": {
        "title": "Anyone else ever get back on Lithium without inpatient?",
        "body": "Damn, I forgot why I hate this shit so much. LOL\n\nWhere the lithium squad at? :)\n",
        "created_utc": 1502153378,
        "label": [
            "0"
        ]
    },
    "6ue394": {
        "title": "How do I stop my LTR(w/e you call it) from being a gossip queen.",
        "body": "[removed]",
        "created_utc": 1503014010,
        "label": [
            "0"
        ]
    },
    "6ylonp": {
        "title": "On any special diets? Suggestions welcome.",
        "body": "What works for you? What do you avoid?",
        "created_utc": 1504768640,
        "label": [
            "0"
        ]
    },
    "9rs0x1": {
        "title": "Hello, I'm in some deep shit.",
        "body": "So, TLWR; I need to get back on my medication to stop my mood swings. Where can I get emergeny prescriptions?\n\n&amp;#x200B;\n\nI'm accidently breaking glass when doing dishes, ripping my clothes when getting dressed, and I can tell I'm really agitated. So now we get to the problem, all my scripts are out of date and I'm running out of pills. I know, I know, this is why we should keep things current and up to date, but I haven't had to take my meds in well over a year. \n\nI think I could manage it, but at the rate it's going, if I got fired from my job, I'd probably go into full mania. I've been dipping in and out of present cognizance the past couple of days(extreme zoning out, memory problems), my mind is trying to gear up on a different level. It's really affecting my wife, and the relationships with my family and coworkers. \n\nI'm a little paranoid that I just got accused early this week of being a racist at my job. There's now cops living in my building and sitting on the side roads on my way to work. I'm not on a watch list or anything, I've never been involuntarily committed. I don't know, this heightened awareness is really fucking with my ability to just focus on my priority, which is maintaining a balanced lifestyle(I don't routinely take meds). I've been trying to get an appointment with my Pdoc, but her assistant is a POS and can't pick up the damn phone when I call, and I've called at different times during the day. How can I get an emergency prescription filled without breaking the bank? Can an MD write my script? I'd like to avoid paying 1000s out of pocket, though if that's my only option, I'm going to have to do it. Looking for LithiumBiCarbs and Instant-Zyprexa tabs.  \n\n\nIf you have any advice, I'm totally up to listening. \n\n&amp;#x200B;\n\nAs always,\n\nBest Regards,\n\nLittleRedBugs  \n",
        "created_utc": 1540619248,
        "label": [
            "0"
        ]
    },
    "9v6yoc": {
        "title": "New Scripts, any advice helps!",
        "body": "Hello everyone,\n\nI've been med free for almost 2 years. I almost strangled someone at work (joking), and I hopped back onto a med cocktail to balance out. I used to take Lithium and Zyprexa. Now, I'm trying a few alternatives. Please share if you have any experience with these, and what are the realistic side effects I should expect. I really appreciate the insight.\n\nBelsomra\n\nZyprexa\n\nTripidal\n\nI was on Serequel, but I gained 18 lbs in 2 days and I told my Pdoc to fuck off, I wasn't taking any more.\n\n&amp;#x200B;\n\nThoughts?\n\nLittleredbugs",
        "created_utc": 1541651560,
        "label": [
            "0"
        ]
    },
    "9wjxso": {
        "title": "For my fellow euphoric BP I people. I miss the old days, ever so much.",
        "body": "",
        "created_utc": 1542068931,
        "label": [
            "0"
        ]
    },
    "9wwsft": {
        "title": "HR requesting diagnosis, do I have to provide them that. I feel that's violating HIPPA",
        "body": "Thoughts?\n\n&amp;#x200B;",
        "created_utc": 1542170104,
        "label": [
            "0"
        ]
    },
    "9xlg8y": {
        "title": "Low dose Seroquel, also a knock on Belsomra(stay the fuck away from that shit).",
        "body": "So, I'm an euphoric manic. If there was one-sided bipolar, that'd be me.\n\n&amp;#x200B;\n\nMy Pdoc recently thought the Zyprexa was hitting me too hard, and I would do better on something else. I wasn't losing any insight, I just genuinely didn't have an interest in sleeping much because life's going pretty good right now, and I like to relish in the highs. I actually function better with about six hours of sleep on a consistent basis. The Zyprexa was just knocking me on my ass, and my body was responding with a potent 'fuck you sir, you will have insomnia now'. A few restless nights, and I was willing to try something new.\n\n&amp;#x200B;\n\nAnyways, Pdoc recently prescribed Seroquel is place of the Z, at a  low dose. I read that low dose acts like an antidepressant, and oh boy, I've been flying for weeks now. I feel like I'm abusing the meds, but the hypo is really irresistible. I know I can't be flung into mania off an antipsychotic, but I feel like I'm riding the wave like crazy. Does anyone have any experience on low does Seroquel? Should I expect it to level off eventually? Full discloser, I also take tripidal as a mood stabilizer.\n\n&amp;#x200B;\n\nAs for Belsomra, sleeping pills, fuck that shit, do not take it. I woke up with the biggest fucking migraine in my life. I get cluster headaches, and let me tell you, I had to pop two high-strength Excedrin within 5 minutes of waking up, take a hot fucking bath, and take a shit ton of caffine during the day. I couldn't even drive myself to work. Stay the fuck away from belsomra, that shit will make you a zombie from the walking dead, getting your head beat in.\n\n&amp;#x200B;\n\nHave a great day,\n\nLittleredbugs\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1542368526,
        "label": [
            "0"
        ]
    },
    "ad4x6u": {
        "title": "Something and Bipolar and Musicians &lt;3",
        "body": "",
        "created_utc": 1546774732,
        "label": [
            "0"
        ]
    },
    "asjdqg": {
        "title": "Why is there no office of the seer/prophet?",
        "body": "I'm confused why these offices no longer exist?\n\nDid the seers/prophets up and disappear after the early church began to split?",
        "created_utc": 1550633605,
        "label": [
            "0"
        ]
    },
    "ewfa2v": {
        "title": "My company has changed my job title(3 times) and now to a non-technical role. Help!",
        "body": "Long story short, my company hired me in for a role b/c they needed to fill the position. I was entry-level filling a 3-5year position. So, they change my role title twice now, from Engineer to Developer, all the same job and such.\n\nRecently, I noticed on our HR portal, my job has changed again to a non-technical role. \"Application Delivery\". Sure, they need someone with my credentials, but I am a degreed Computer Scientist, and I just don't know if I should step into a non-technical role (i.e. no coding). The company has been restructuring for a few years now, and our end of year reviews are under way. I have a feeling they are preparing to shift me to a new role.\n\nThey haven't told me of this new role yet.\n\nWhat should I do? Should I approach them now, or wait for it to happen? Brush up the resume?\n\n&amp;#x200B;\n\nAnything helps.",
        "created_utc": 1580429589,
        "label": [
            "0"
        ]
    },
    "ezn2i1": {
        "title": "Insight, intuition, and Medication",
        "body": "Good evening Reddit BPers,\n\nSo, I was meditating the other day, and I got to thinking about insight. We lose insight when manic or when in major depression, but the question is this: What does it mean to lose insight?\n\nI've come to the conclusion that this is our insight, our own person or personality. How did I come to this conclusion? Well recently, I've tried a new drug cocktail, and I've noticed all the nasty, negative side effects, side effects which led me to live medication free before. \n\nSo, how did I get back to this point of needing medication? Well, through many major life events, I put myself back into stressful situations which exacerbated my general well-being. Sound familiar?\n\nWell, let's get back to insight. So, while meditating, I began to really dig deep into this insight my Pdoc supposed I had lost. Come to think of it, my insight and intuition increased in manic states and decreased in depressed states. This makes sense, but on the far end of mania, this insight, this intuition, can be a very powerful drug. On the other end of depression, this willfulness to deny insight or intuition, can also lead to a very dark places.\n\nSo, is the answer balance? No, not really. Balance so I thought, would mean equal parts insight/intuition when manic and depressed, but I found that mood stabilizers did no such thing, they simply redirected insight and intuition to oneself. In a sense, giving oneself permission to be completely selfish, solely focused on one's own life.\n\n&amp;#x200B;\n\nSo, why am I here tonight, why am I posting when I've been away from the subreddit for quite some time. I have woken back up, through reducing stressors and taking Rx Stimulants and AntiPsychs, I've become intuitive again. Not that I lost my insight, but in a sense, I was in a defensive position, and now I'm in an offensive state. I was quite aware in my depression, and avoided my problems. I was quite aware in my mania, I was pushing my limits. But is that not life?\n\nLately, I've noticed other people's pass-aggressive behavior, peoples insults and doublespeak. I feel like my mind has regenerated as to when I was younger. I am sharper. Focused. Determined. I feel as though I've over come the illness again. I'm back in the driver's seat. I am normal again. I've recently become debt free, been eating clean, working out every day, and maintaining a good routine. I was able to do this with the help of Rx Stimulants, but even those have become too powerful to stay on long term.\n\n&amp;#x200B;\n\n\\*Trigger Warning: Obesity and Medication free life\\*\n\nNow that I have clarity of thought, insight, and intuition, I've decided to back off the drugs. I know, I know: isn't that a bad idea? I've lived medication free for years at a time, and lately I got motivated to get back in athletic shape. I was making significant progress, dieting and losing weight. I lost about 15lbs in a month or so. Everything has been going great! Until I started gaining weight. I felt the hypomania slipping away. The  Rx stimulant has done its job, pulling me out of a major depressive episode(fueled by alcoholism). I thought this was great, and had asked the Pdoc to increase the dosage. I started to anticipate other's actions, speech, ideas. My mind was racing, and I was gleaming insight from everything around me.  I tried to stay positive, I really did, but the mania was too much, and I could feel things getting out of hand. I lost MY insight. About ME. That's the insight I lost. I lost sight of what I(ME) wanted. MY goals. MY vision. \n\nJust as quickly as I had elevated myself, I could not feel pressure from everyone around me. Needless to say, I began taking mood stabilizers and antiPsycotics. Anytime I felt negativity from others, or felt them trying to influence me in a way I did not want, I would take my meds. This dependence on medication, is just as dangerous. I went from being in charge, being aggressive and determined, to being stagnant and not making decisions. I had reached balance, but there was no more progress. In a sense, I became stuck. I started to experience all the bad symptoms of these drugs, and most notably, after a few weeks on the drugs, I noticed that I had regained 10lbs. All my hard work, diminished just so I could play it safe and be balanced. Hey, if that's your bag of tea, by all means. I can't live life like this; refusing to use my insight, intuition for the greater good.\n\nSo, I'll be back tracking off the antiPsycs, then reduce the mood stabilizers, and finally reduce the stimulants, in a controlled manner. It's time to implement my support groups, and focus on improving my general well-being, one day at a time.\n\nI'm very fortunate and grateful of where I am in life, living with BP in the way I do. \n\nIf this relates to you, feel free to leave a comment.\n\n&amp;#x200B;\n\nAs always,\n\nLittleRedBugs",
        "created_utc": 1580964693,
        "label": [
            "0"
        ]
    },
    "fh52l0": {
        "title": "Any experience with Vraylar?",
        "body": "Thoughts? I'm just starting my second week, and I think it's making me do some weird things. I feel more like myself, which is a weird thing to feel after six years.",
        "created_utc": 1583963360,
        "label": [
            "0"
        ]
    },
    "fnm0eu": {
        "title": "Government Healthcare Coverage for Mentally Ill",
        "body": "Does anyone know if ole Uncle Sam is going to foot the bill for the uptick in Mentally Ill healthcare?\n\n&amp;#x200B;\n\nThis COVID-19 pandemic has altered the way in which the mentally ill can maintain a healthy lifestyle. The closing of businesses that cater to the mental ill will not bod well with people that need services in order to sustain stability.  \n\n\nDepression and Suicide rates will increase. Loneliness will have catastrophic consequences for the mentally ill. While emergency services will continue to be available, what about out-patient programs? What about physical therapy programs? What about physical wellness programs?\n\n&amp;#x200B;\n\nWhat about SII workers who can not work now? What about those who have lost their jobs? How can people sustain themselves during this time without financial assistance?\n\n&amp;#x200B;\n\nWhat happens when medication shortages arise? What happens when the mentally ill can not get access to their medications? What happens when routine doctor's visits are put on hiatus.\n\n&amp;#x200B;\n\nThese are troubling times, and certainly we must not fear the unknown, but we must prepare. There must be a way forward for the mentally ill. How can we shape a future where we can be assured that one of the most vulnerable populations of our society will not live in fear?  \n\n\nPlease feel free to openly discuss these questions and more.\n\n&amp;#x200B;\n\nRegards,\n\nLittle Red Bugs",
        "created_utc": 1584978023,
        "label": [
            "0"
        ]
    },
    "fosjru": {
        "title": "My Wife Is Driving Me Nuts (Quarantine Rant)",
        "body": "I need help. I can't take it anymore. My wife is driving me up a wall. The entire house is on lock-down. \n\nI've got screaming kids running around while I have to work. She's gone on a bender, spending money left and right on binges and impulses. She's oversleeping, staying up late, complaining about the messiness of the house. Streaming Netflix all day, painting all day, playing video games all day. She just won't leave me alone. And the kids. Where do I even start? Tio this, Tio that. Knocking on my office door. Oops, we broke the Nintendo Switch. We are hungry. We need more activities. The kids want to see their Tio. Why are you working so much? Crying Toddler climbing the stairs by himself. Children throwing balls in the house. My wife is just enthralled, and treating the lock-down like some kind of super fantastic sleep over, FROM HELL.\n\nShe is so hypomanic, it's just too much right now. I can't even get out of the house to breath. Can't see my family, friends. Can't even just go drive around or go to the park.\n\nShe's paranoid, euphoric half the time, and the other half depressed and agitated. Like a bad mixed episode.\n\nThis quarantine has destroyed her routines. Her work sent her home for weeks. She wants to spend every minute of the day with me. Her sex drive is off the walls. I can't keep up with her anymore.\n\nI just don't even know where to begin. I'm an essential worker, and I have to work from home right now. My wife is driving me NUTS!\n\n&amp;#x200B;\n\n\\-End Rant",
        "created_utc": 1585151364,
        "label": [
            "0"
        ]
    },
    "frdqnj": {
        "title": "Quarantine Vibes",
        "body": "",
        "created_utc": 1585517458,
        "label": [
            "0"
        ]
    },
    "fsatus": {
        "title": "How about some music therapy? In these dark times, post your favorite Depression lifting music.",
        "body": " Skillet: Would it matter at all?\n\n[https://www.youtube.com/watch?v=82hLvgGuDu8&amp;list=PLOtAL\\_aFkJ2Oje5A5cATGLUDOXAyR4m7\\_&amp;index=14](https://www.youtube.com/watch?v=82hLvgGuDu8&amp;list=PLOtAL_aFkJ2Oje5A5cATGLUDOXAyR4m7_&amp;index=14)",
        "created_utc": 1585651887,
        "label": [
            "0"
        ]
    },
    "ft5zl6": {
        "title": "Suspension of Rights during Crisis",
        "body": "What's the point of having a Constitution that can be suspended in times of crisis?\n\nAre these rights not endowed by God?\n\nIs government Supreme to God?",
        "created_utc": 1585766720,
        "label": [
            "0"
        ]
    },
    "fvwqv3": {
        "title": "The OG social distancing. It's about reducing connections to reduce delusions.",
        "body": "A thought had crossed my mind. I've seen so many people reading Bipolar books, and it got me thinking about a key component of some of this literature, namely building a team of people to support you.\n\nI'd like to share why I do not have a team, nor support, and why I prefer being alone, except for appointments with the Pdoc.\n\nI'll keep this short and sweet.\n\n1. The less people that know you are Bipolar, the better your life will be.\n2. The less people that have a say about your Bipolar, the more say you have.\n3. The less people watching you, the less paranoia you have.\n4. The less people investigating your moods, the more stable you tend to be.\n5. The less people you're in relationship with, the less lies and deceit.\n\nI've found that the less interaction, the less I have to think about or know about a person, their relationship with other people, and it's a lot easier to spot narcs and people checking on you. You notice the abnormal a lot easier because you've separated yourself from everything and everyone.\n\nYou can better see people influencing you. You can see people taking advantage of you. You can see people being indirect to you. You can easily walk away with no attachment. \n\nWell, how then do you trust people, you might ask? Simple, I trust until I have reason to not trust, and in general, I only trust people who are direct, honest, and impartial. The greater the relationship with someone, the greater the influence.\n\nSounds harsh right? How do you have any meaningful relationships? Well, that's the key. I only have meaningful relationships now. This keeps me more stable than any medicine or therapy ever could.\n\nSocial distancing is driving people nuts, because people are so invested in other people, they haven't invested enough in themselves.\n\n\"Our deepest fear is not that we are inadequate, our deepest fear is that we are powerful beyond measure. It's our light not our darkness that most frightens us.\"\n\nRegards,\n\nLittleRedBugs",
        "created_utc": 1586170712,
        "label": [
            "0"
        ]
    },
    "g5mh7h": {
        "title": "Finished Building My New Desk Today ( Phase 1 )",
        "body": "Well, it took me about a week or so, but I got it done! It's got a few shelves, roll-out draws, and enough space to fit numerous laptops and monitors. In total, it probably took about four hours or so of labor. Phase 2 will be installing a bookshelf attachment. I'm really excited!\n\nI've been working from home during the Great Ban of 2020. The isolation has been tolerable, but still I've found some ways to get out and about in a healthy manner. Small to medium sized projects have kept me busy and helped pass the time.\n\n&amp;#x200B;\n\nWhat projects have you kept you busy at home the past few weeks?",
        "created_utc": 1587499299,
        "label": [
            "0"
        ]
    },
    "gctg4h": {
        "title": "Seeking Insight, 3-4 years in industry, trying to step up to the next level, what am I worth?",
        "body": "Any advice helps.\n\nNeed some insight and guidance. I've got about 3-4 years experience in CS, but if I put pen to paper, my professional work makes me look like a junior/novice developer and or a legacy junkie.\n\nMost recently, I wrote about 10k lines of code for production in about 3 weeks or so. If I could just have the 'keys to the kingdom', I could easily write 100k per year. I do not get enough high level projects or even medium level projects to warrant a raise/promotion. This year was supposed to be the big raise/promotion year, but COVID has fucked that up. Our employee reviews have been pushed out to August. I'm not sure I can keep holding on for false promises. Last year I was passed up b/c 'other Devs have been waiting longer than me, but you are doing a great job'.\n\nI'm too far into this to still be at a low level, and I've been taking out my retribution on my personal projects. I spend most of my days googling $$$ jobs and trying to implement their stacks/languages/frameworks on my GCP stack. It's difficult to even know if I'm building something that's worth value b/c I don't have much insight into things like ruby on rails, python apps, kubernets, containerization. \n\nI just need to understand what it actually takes to get offered the $$$.\n\n&amp;#x200B;\n\nI've listed out what I'm comfortable discussing in interviews. You tell me, if you will. What am I worth? Right now, I make 60k salary(\\~75k with benefits). In Silicon valley terms, probably around 90-110k per year.  \n\n\n2018 - Present\n\nPosition: Systems Engineer, Information Developer, Application Delivery\n\nAccomplishments/Responsibilities:\n\nTransforming Big Data Sets\n\nWriting new source modules to the main engine\n\nMentoring new hires\n\nMaintaining weekly SQL scripts and engine reports\n\nOn-Call rotation, handling engine abends in real time\n\nAssisting in maintaining testing/development environments\n\nLeading teams to perform complex engine testing\n\nWorking alongside Senior developers on high-profile projects\n\n&amp;#x200B;\n\n2016 – 2017\n\nPosition:   Software Engineer, Systems Integration Engineer\t\t \n\n\tAccomplishments/Responsibilities:\t\n\nObtained a working knowledge of FORTRAN in 2 weeks\n\nWrote a proprietary custom-C application to meet cyber-security regulations set by the Nuclear Regulatory Committee, NRC by porting a FORTRAN data acquisition program into the C language from a production server to a corporate server\n\nRe-wrote two custom applications, including system configuration, file initialization, and library function calls\n\nRe-engineered system/server environment for custom application programs\n\nCreated virtual test environments and data sets to mimic \"live\" testing ahead of scheduled client testing\n\nCold Metal Configuration\t\t\t\n\nApplication Development and Design\n\nSRP Synchronous Reactive Programming (100ms) using C-threads\n\nData Acquisition and Integration, Writing and Configuring Simulators\n\nContent Management(Responsible for 50+ files, multiple modules)\n\nExtensive Documentation, Writing Design, and Product testing \n\n&amp;#x200B;\n\nRELATED TECHNICAL SKILLS\t\t\t\n\n IDE/GUI:\t\tMicrosoft Visual Studios, Eclipse, SSMS, SQL Developer, TOAD, UltraEdit, MobaXterm\n\nOS:\t\t\tUNIX, Windows\n\nLanguages:\t\tC, C++, Java(Console,Android), FORTRAN, Pro-C, PL/SQL(Oracle)\n\nWeb:\t\t\tHTML, CSS, Bootstrap, JavaScript, PhP, SQL\t\t\t\n\nTechnical:\t\tMicrosoft Office Suite, Adobe Suite, AutoCAD Suite\n\nMethodologies:\tSDLC, FDD, Rapid Prototyping,, Agile, Waterfall, etcetera\t\t\t\n\nCloud:\t\t\tGCP(Google Cloud Platform)",
        "created_utc": 1588523298,
        "label": [
            "0"
        ]
    },
    "gj12kw": {
        "title": "Vanderbilt COVID-19 hospitalization forecast reduced from thousands to 300",
        "body": "",
        "created_utc": 1589383297,
        "label": [
            "0"
        ]
    },
    "gtp975": {
        "title": "Live streams showing damage to court building, statehouse, and library.",
        "body": "Seeing a live stream of a roaming crowd breaking windows in downtown, knocked down the statue at the statehouse, and more. \n\nThey need to start arresting people now before it gets dark. People are actively provoking and encouraging mob mentality in downtown Nashville.\n\n&amp;#x200B;\n\nCan our spineless Mayor even stand up?",
        "created_utc": 1590884967,
        "label": [
            "0"
        ]
    },
    "l4kee1": {
        "title": "I'm not a wrapper",
        "body": "I'm a shining star. The end. Blip splot splot. Pow. Goodnight.",
        "created_utc": 1611566855,
        "label": [
            "0"
        ]
    },
    "lkhdnw": {
        "title": "I'm back, back in black.",
        "body": "Well ladies and gentlemen, ladies and gents,\n\nit's good to be back, back in black. Thank you all for holding down the fort in my absence. Let's get to work.  \n\n\nBest Regards,\n\nLittleRedBugs",
        "created_utc": 1613407301,
        "label": [
            "0"
        ]
    },
    "lku998": {
        "title": "I feel like a hero, and you are my heroine",
        "body": "Don't you know that your love, is the sweetest!\n\n[https://www.youtube.com/watch?v=hYNznNBeDnQ](https://www.youtube.com/watch?v=hYNznNBeDnQ)",
        "created_utc": 1613444730,
        "label": [
            "0"
        ]
    },
    "ll2o0a": {
        "title": "Welcome to the fallout",
        "body": "[https://www.youtube.com/watch?v=jE-Krlqi4fk](https://www.youtube.com/watch?v=jE-Krlqi4fk)",
        "created_utc": 1613477985,
        "label": [
            "0"
        ]
    },
    "ll2rgv": {
        "title": "So sick of the self righteous admins of /r/bipolar that fucking gatekeep nothingness",
        "body": "That's all.",
        "created_utc": 1613478354,
        "label": [
            "0"
        ]
    },
    "ll2sx6": {
        "title": "Future hope",
        "body": "[https://www.youtube.com/watch?v=s3-7fjhYm2g](https://www.youtube.com/watch?v=s3-7fjhYm2g)",
        "created_utc": 1613478514,
        "label": [
            "0"
        ]
    },
    "ll2vow": {
        "title": "Let's cure bipolar once in for all, shall we",
        "body": "Our Father, who art in heaven, hallow be thy name, thy kingdom come, thy will be done, on earth as it is in heaven. If it be your will father. Lift up our hearts today. Lift up the hearts of those hurting all over the world lord. Bring us home today lord. bring us back to you. amen.",
        "created_utc": 1613478803,
        "label": [
            "0"
        ]
    }
}