{
    "jqv2z9-jvdtlc": {
        "timeline_of_interest": true,
        "posts": [
            "jqv2z9",
            "jr0wup",
            "jrdpcc",
            "jvdtlc"
        ]
    },
    "jzbwss-k0m5i0": {
        "timeline_of_interest": true,
        "posts": [
            "jzbwss",
            "k09p3k",
            "k0bm2w",
            "k0bu06",
            "k0m5i0"
        ]
    },
    "k6savw-kg1w5m": {
        "timeline_of_interest": true,
        "posts": [
            "k6savw",
            "k7okt1",
            "k9d3ig",
            "k9d5fq",
            "k9dbza",
            "ka2ssj",
            "ka72i6",
            "kawhxm",
            "kawimb",
            "kaxu90",
            "kbbaoa",
            "kc11lm",
            "kc45yj",
            "kc47g5",
            "kf68hw",
            "kf6t62",
            "kfq39e",
            "kg1o35",
            "kg1w5m"
        ],
        "summary_tulu": " Based on the provided text, the individual appears to be expressing feelings of rejection, betrayal, and a desire for revenge against someone they refer to as a \"hoe.\" The text suggests a complex emotional state with elements of anger, sadness, and a sense of loss. Here are the observations based on the provided aspects:\n\n1. Presenting Issues: The individual seems to be dealing with the end of a relationship or friendship, as indicated by their expressions of rejection and betrayal. They mention a desire for revenge and a wish that the person they are addressing would not find love again.\n\n2. Mental Health Symptoms and Functioning: The individual's mood appears to be negative, with expressions of sadness, anger, and a sense of loss. They mention a desire for revenge and a wish that the person they are addressing would not find love again. There is no mention of changes in sleep patterns, appetite, concentration, or social interactions.\n\n3. Mental Health Treatment History: There is no mention of the individual's contact with mental health professionals or their mental health treatment history.\n\n4. Physical Health: There is no mention of current or past physical health issues, medical conditions, hospitalizations, or surgeries.\n\n5. Risk Assessment: There is no mention of suicidal thoughts, previous suicide attempts, or access to lethal means. The individual does not express hopelessness or discuss social isolation, recent losses, impulsivity, or dramatic mood swings.\n\n6. Lifestyle Factors: There is no mention of the individual's lifestyle habits, such as diet, physical activity, sleep patterns, occupation, environment, screen time, or healthcare practices.\n\n7. Substance Use: There is no mention of the individual's use of substances like alcohol, drugs, or tobacco.\n\n8. Significant Life Events and Family History: There is no mention of significant life events like divorce, loss of a close person, experiences of abuse, or neglect. There is no mention of psychiatric problems or treatments among family members.\n\n9. Motivation and Coping Strategies: The individual does not express any motivation for"
    },
    "kuqomf-l34zpo": {
        "timeline_of_interest": true,
        "posts": [
            "kuqomf",
            "ky02uw",
            "kyvd0w",
            "kyyt7n",
            "kzcrcy",
            "l01ig7",
            "l2ilfa",
            "l34zpo"
        ]
    }
}