{
    "7wfluu": {
        "title": "I need a friend to help me through this.",
        "body": "This is pathetic. I need a friend or a contact with the same \"demon\" as me. I am  25 years old. Female. \n\nI started drinking at age 21 while in a toxic abusive relationship with another alcoholic. At first I used it as a crutch to numb all the pain I was feeling but once I got out of that relationship the drinking just got worse. I would drink when I remembered the bad times....it didn't help but I used being drunk as an excuse to be stupid. I am now in a healthy relationship and I am so embarrassed of my problem. Every time I try to quit I relapse. Last night I told myself I would only have 2 drinks... I remember after finishing my second drink I went to the whisky bottle. I remember having a few swigs. this morning... I wake up and the bottle is just gone. Not empty I don't think...but just nowhere. No idea what I did with it. I also tend to sleepwalk and sleep eat. I am scared I sleep drank the whole bottle. For the record I sleepwalk sober and drunk. Just more so when I'm drunk.",
        "created_utc": 1518201940,
        "label": [
            "0"
        ]
    },
    "83kmzv": {
        "title": "Wooowee I sure am sorry",
        "body": "See, sometimes I drink and I am fine... then there are times like this. Editing is hard because intoxication + Swype typing is hard. \n\nI keep thinking that my thoughts aren't so personal. I use that as an excuse to poison my body.",
        "created_utc": 1520743081,
        "label": [
            "0"
        ]
    },
    "84atqi": {
        "title": "My fave boy. Morty boy.",
        "body": "",
        "created_utc": 1521003431,
        "label": [
            "0"
        ]
    },
    "8n4rx8": {
        "title": "What if I don't have eds?",
        "body": "I learned about eds fairly recently (within the last 6 months).... every post, every article I read is like my life. Always sick with something. Doctors making excuses.  Having parents learn to put your elbows back in place. Horrible bursts of adrenaline randomly. Forgetting what mom asked me to do. Having to quit gymnastics because every time you landed a front hand spring your knees would give up. You can't enjoy the trampoline at the end of gymnastics because your skull would jiggle on your neck and your sinuses felt like they were going on an under sea adventure. \nEverything scars.\nI have the hands of an old woman. I always have... same with my mother and sister. \nI have annoyingly long periods. \nI get random nausea and diareah and constipation and increase and loss of appetite. 90% of the time I feel like I'm getting sick with the flu or a cold.... You know that  squeezing dehydrated headache and dryness in your sinuses ...feeling like you tried to swallow a mouth full of dust...or saw dust...or feathers... And 24 hours later after vitamins and neocitrin... You are just A paranoid idiot?\n\nWhat if I just feel shitty? I no longer have a cause for all of my maladies... what then? I haven't been diagnosed yet. But every bizarre unexplained health phenomena I've experienced in my life could be explained with eds. I'm so stressed out. I don't want to be a hypochondriac. I don't want people to think I'm crazy. I'm not crazy. I'm just frustrated... and in discomfort and pain.",
        "created_utc": 1527645342,
        "label": [
            "0"
        ]
    },
    "8nkkwl": {
        "title": "Those days where you feel like you got hit by a bus",
        "body": "I woke up yesterday in crazy pain. Back knees ankles arms wrists shoulders and mostly....chest and upper middle back. I thought it would go away after eating easy food and sleeping... Woke up this morning still feeling like I got chest and back punched by the incredible hulk.  And my breakfast made me incredibly nauseous. Why. This is fucking awful. Ugh.",
        "created_utc": 1527789676,
        "label": [
            "0"
        ]
    },
    "94ufm7": {
        "title": "No official diagnosis....but this new thing popped up one morning. Off centre pupil. It was just like that one morning and never went back. Other eye is starting to do it too. Also pupils are expanding and contracting like a camera trying to focus.",
        "body": "",
        "created_utc": 1533497162,
        "label": [
            "0"
        ]
    },
    "9q4alk": {
        "title": "Fit bit tracking heart rate",
        "body": "I have been having weird health issues all my life. In the last year they got significantly worse, and new issues popped up.  Can anyone here tell me if this kind of variation is normal? For reference, I work in a women's clothing shop and do some heavy lifting at work but mainly standing and walking and talking. I worked 9 - 5  this day.",
        "created_utc": 1540135161,
        "label": [
            "0"
        ]
    },
    "9q4gfs": {
        "title": "I don't think this is normal. I have no diagnosis - should I bring this up with my doctor? I worked 9 to 5 this day.",
        "body": "",
        "created_utc": 1540136418,
        "label": [
            "0"
        ]
    },
    "9rgu8s": {
        "title": "My room mate's gf is a real kleptomaniac.",
        "body": "Over the last year, the actual maniac my room mate has been dating has stolen thousands of dollars worth of items from me.  \nI live with my boyfriend. We were together 2 years before this fuckery. We live in a 3 bedroom 2 bathroom townhouse . She is significantly larger than I am, but seems to THINK it is okay to use my underwear and leggings and jackets. And makeup items that disappeared over the period of time I was Conveniently distracted with work.",
        "created_utc": 1540521269,
        "label": [
            "0"
        ]
    },
    "9rgxag": {
        "title": "Angela Brooke you are a thief and I feel sorry for your bf Nick Lalonde",
        "body": "",
        "created_utc": 1540521978,
        "label": [
            "0"
        ]
    },
    "a4ifqe": {
        "title": "Shaking and twitching during attack...?",
        "body": "So. Yesterday (friday), I had a huge migraine attack flare up at work. As I was starting my shift the headache started at the nape of my neck. Over the next two hours it progressed to be so painful that my face turned blue grey (along with my hands.... raynauds reaction) and I was shaking pretty badly. It was very hard to walk to the break room. I couldn't find anyone to cover my shift so I had to power through.... but every once in a while  I would have these weird contracting spasms on the right half of my face.  This is normal ish with my migraines, but it was particularly bad this time.  Gradually the tremors would come and go but they were primarily on my right side. Could I have been having small seizures? By the end d of the night I was basically in so much pain that I kin d of had to dissociate to keep from crying and or punching the wall. Once I made it home, i laid down and I couldn't move or speak without pain so I was just.... Like a vegetable. I made myself eat a bit and I took my night time meds for migraine and fell asleep eventually.  It was absolutely top 5 worst headaches of my life.  \n\nAnyone else get tremors or unstoppable facial spasms with their headaches???",
        "created_utc": 1544333342,
        "label": [
            "0"
        ]
    },
    "ab1c25": {
        "title": "Over 2 months sober... still not any less depressed. Still not in any less pain.",
        "body": "Somehow I thought I would feel better. I still have widespread joint pain, migraines and gastric system upset. I feel like it's gotten worse since I stopped drinking entirely.... I am so disappointed. And now I can't even blame my health problems on my addiction and I have to accept that I will always have chronic pain. There is something wrong that is out of my control. I hate this. Nothing brings me joy anymore. How do you cope? How do you find things that make you happy? I don't know what I'm even saying anymore. Depression is stupid.",
        "created_utc": 1546213856,
        "label": [
            "0"
        ]
    },
    "ajfxfs": {
        "title": "I had about a month of relief.",
        "body": "I went on Elavil for my headaches. I went from daily headaches to weekly to none. Now they're back and I don't know what to do. I  don't want to het fired from underperforming and I don't want to have to increase my dose of Elavil because as soon as I went on it I gained weight even while eating less than 1200 calories a day and taking upwards of 15000 steps in a day. It's so frustrating. My whole body hurts. If I up my dose and gain weight I will have more joint pain. If I don't, I will continue to have horrible headaches. Anyone have an idea for me please",
        "created_utc": 1548357483,
        "label": [
            "0"
        ]
    },
    "akn6rv": {
        "title": "Anxiety over anxiety...panic attacks about a future situation I could have a panic attack.... anyone relate?",
        "body": "The cycle keeps me from succeeding. It was under control for a few years and now it's coming back. All these \"what if\" moments. Feeling trapped in my body. Piloting a meat suit and feeling totally disconnected. Ugh. Vent.",
        "created_utc": 1548680371,
        "label": [
            "0"
        ]
    },
    "aom7lq": {
        "title": "No diagnosis yet, but do any of you get numbness in your feet when working out?",
        "body": "I get numbness and stiffness from raynauds but sometimes while working out my toes go numb. And I have taken off my shoes to check if it was vasospasm. Aaand it isn't. I also have arthritis in my lumbar spine. Related? Anyway. If anyone has insight I would appreciate it:)",
        "created_utc": 1549666662,
        "label": [
            "0"
        ]
    },
    "ar2ytf": {
        "title": "New pain?",
        "body": "I don't have any official diagnosis, so I don't want to be running to my doctor with every little thing... but how often do you get random new pains? I have had these deep aches in both my shoulders(sometimes at the same time) and it's like even the weight of swinging my arms while walking feels like my arms are being ripped off. I think the official joint is the AC joint.... just the whole area there feels awful.",
        "created_utc": 1550275025,
        "label": [
            "0"
        ]
    },
    "ax1mw6": {
        "title": "Raynauds in palms??",
        "body": "I had been running my hands under very warm water. This is a picture of my achey palms that I get when the raynauds reactions get extra bad. You can kinda see the separation of the skin that's starting to get blood again.",
        "created_utc": 1551665513,
        "label": [
            "0"
        ]
    },
    "azxl88": {
        "title": "I'm nervous. My doctor wants to see me. I have never had her call me to initiate any appointment.",
        "body": "I'm probably being paranoid. It's probably just to get me set up with a rheumatologist or something. But my symptoms have been getting worse and I'm scared. I want to have an actual diagnosis.  I want to name the evil. But what if it's something scarier than eds? What if it's lupus after all? What if it's MS? I have been really having a hard time moving my hands lately.  They're so stiff.  And it's hard to aim. I'm scared.",
        "created_utc": 1552332510,
        "label": [
            "0"
        ]
    },
    "b0aeoc": {
        "title": "Update: nothing to panic about.",
        "body": "So my appointment was basically just my doctor telling me that I'm probably right about my diagnosis. Very validating. She just wanted to do the beighton scale test again because the physiatrist didn't detail everything when he did it. didn't check my arm span/height ratio, didn't measure multiple areas for skin elasticity... couple other things. Now I am waiting on calls from someone whose gonna look at my eyeballs extra close (dilated eye exam) and a rheumatologist / connective tissue disorder specialist.  So I will have to go to Toronto for that. I'd like to move back there. I miss Toronto.",
        "created_utc": 1552411266,
        "label": [
            "0"
        ]
    },
    "b0o5ql": {
        "title": "Literally less than an hour after my appointment... checking elasticity... the rest of the bruises took longer to develop. Haaah.",
        "body": "",
        "created_utc": 1552495434,
        "label": [
            "0"
        ]
    },
    "b6juzg": {
        "title": "Physiotherapy woes....",
        "body": "So in early February I finally started going to physio for my most debilitating pain - my lower back. BACKSTORY TANGET TIME:\n I am 26 years old, in fairly good shape, but at 23 I started having chronic and severe back pain. It took a while, but eventually the doctors did an x-ray. Turns out I have ARTHRITIS in my lumbar spine. Found this out at age 24 I think. So that's not normal for someone my age / fitness level. Blood work - no rheumatic indicators. No antinuclear antibodies. For now it's \"not lupus\" but likely a connective tissue disorder - beighton scale test replicated 3x with the same results- super floppy and definitely worth looking into eds (it would literally answer all of my weird body things that I've dealt with all my life. ).\n\nBACKSTORY TANGENT OVER. \nSo my physiotherapist is super nice and validating. My pelvis, shoulders and spine are crooked in one way or another. At first, the 2 times a week appointments really seemed to be helping. I have been given exercises to kind of support my lower back. I do these every day. But the thing is... I don't have an actual diagnosis yet. And these appointments are 80 bucks a session. I have insurance through work, but that will eventually run out. I don't know if it's worth just paying out of pocket for if I am not getting the right kind of treatment for what I have. While all this is going on, I am also in the process of working a full time retail job and moving. It's super overwhelming. Anyone have advice or opinions on what my next move should be?",
        "created_utc": 1553785367,
        "label": [
            "0"
        ]
    },
    "bamb2d": {
        "title": "Depressing day off.",
        "body": "After the move, I finally have a Day off from work.  My plan was to wake up early and be productive.  Instead, I wake up with a major headache and I can't think properly. Yay migraine! And cramps! And back ache! All my joints hurt and my eyes feel like they're pointing in different directions. I'm shaking.  I keep losing my balance. I used all my energy to take a bath and brush my teeth.  My headache is slightly less awful, But my back hurts more.  I used my tens and my heating pad but that's not providing any lasting relief... and my ears are ringing.... and my vision is like tv static......all kinds of new bruises are just fucking appearing on my body.  I have a bruise from wearing a knee brace. Like...a stretchy one. One that shouldn't make you bruise.. My skin is being an asshole, too. I tore it open on my forearm when I had a tiny itch.  I swear - it's like wet tissue paper. \nI have my echocardiogram tomorrow morning, but I still don't have an appointment for my dilated eye exam. As happy as I am about finally finding the root cause of my body issues, I am becoming exponentially more symptomatic. I'm so scared I won't be able to work anymore. I don't want to go on disability.  I hate that my boyfriend has to be physically careful with me. I wish I could just be a normal girlfriend. I wish my hips didn't slip out of their sockets during sex. I wish I could get a big hug without my skin tearing. I wish we could just fucking go out to eat - but any kind of normal stomach/bowel function has not been a part of my life for a while now. I am always in pain. I know that sounds dramatic - but it's just true. It's not always the worst pain, but it never goes away completely.  I can't even remember a time where I was pain free for longer than a few days.  I don't want to accept that this life is my new normal. I just want to be better...but I don't think that will ever be in the cards for me. My heart is breaking. I feel like I'm morning my own death. Not literal...but like the death of who I aspired to be. And I know my loved ones worry about me. But I don't want them to. So I'm feeling guilty for making them worry.  It's all just one big fucked up mess.",
        "created_utc": 1554677891,
        "label": [
            "0"
        ]
    },
    "bbgvys": {
        "title": "I had a scary moment.",
        "body": "So, I've been with my boyfriend for a little over 4 years and we have lived together most of those 4 years.  Lately my memory has been getting worse and I have been assuming it's stress, migraine related, or a lack of concentration (I am on my phone way too much). The other night, I woke up  to him hugging me (big spooning). It was the middle of the night, so I'm hoping I was just in a weird state of mind, but for a good minute I was freaking out inside. I couldn't remember who he was. I of course remember now, but I'm still worrying.  Does anyone else here have moments like this where you forget people??? I feel so guilty.  And terrified. It may also be worth noting that within 20 hours of that episode I would be having a horrendous migraine.",
        "created_utc": 1554864085,
        "label": [
            "0"
        ]
    },
    "bbpjt1": {
        "title": "I want to go to work.",
        "body": "It's so dumb. My body is being so ....ugh. So I am all excited to go to work this afternoon - busy beautiful day.... lots to do! Cut to about an hour before I wanted to leave to catch an early bus - ooh my tum hurts. And I'm dizzy. Ooh boy I feel like I might faint. So then my legs start to tingle. I go to the bathroom and I'm in that state of nausea where all of the discomfort is there with no relief. Light headed. Numb throat and tongue. Weird sinus spasm. No actual vom relief. I never get that. Never. Last time I threw up was 20 years ago. I am so fucking tired of feeling like shit all the time. I feel like I'm letting everyone in my life down by not being able to get up and do my part. The worst thing is that I am always saying \"yes please give me more responsibility! Let's try new things! I CAN DO It!\"  But some times (more often nowadays) it turns out that my body can't take it on. I'm so exhausted. My back hurts.my chest hurts. My eyes hurt. My ears are ringing. \n\nI just wanna be good. I just want to do good. I want to excel. I want to fix the body problems. I want to live in the world. Not just exist in it.",
        "created_utc": 1554921101,
        "label": [
            "0"
        ]
    },
    "bdzell": {
        "title": "Shuga Cain... CHOCOLATE RAIN?!",
        "body": "I can't be the only one who sees it... shuga (out of drag / at least in the interviews on the show) looks like Tay zonday.  Anyone?",
        "created_utc": 1555449774,
        "label": [
            "0"
        ]
    },
    "bk0b83": {
        "title": "Tried to put my hair up and my hands said no",
        "body": "",
        "created_utc": 1556832059,
        "label": [
            "0"
        ]
    },
    "bq46ls": {
        "title": "Nausea is awful and stupid",
        "body": "It feels like my insides are doing a relay of deciding not to work. Sometimes swallowing doesn't make stuff go down. Sometimes my stomach takes forever to empty. Some times my small Intestine makes my belly feel like it's made of balloon animals. Sometimes my large intestine decides to not move for a week....and then evacuate everything in one day. I am very annoyed. I am so nauseous and my tum feels all burny and adrenaline-y. I don't know if that makes sense, but I just needed to vent. I dont feel well.  Hxbdnsjksb. Tums didn't help. Pepto didnt help. Chewing on ginger helped a tiny bit... sigh. I'm trying to wait it out  without taking gravol because it makes me sleepy (though it does help a bit) and I have to go to work soon.",
        "created_utc": 1558187316,
        "label": [
            "0"
        ]
    },
    "bs9jav": {
        "title": "Officially on the list to see an EDS specialist.",
        "body": "Obviously I am happy for that. I'm still in that state of mourning for a healthy life.... but I am so relieved that I'll finally have answers.  What sucks is that while I'm waiting, I'm still desperately trying to hold down my full time job (I work in a clothing store and a lot of my job has to be done speedily and with a smile)(Also lots of walking and lifting), but my symptoms are all over the place. For the last week I've been so nauseous. Nearly non stop.  I take gravol to help me get through the work day, but it makes me sleepy and I feel like I'm not as productive. I actually just had to leave work due to a fucking awful headache.  Started yesterday, and was on and off until about an hour into my shift. Then it peaked. When it gets to that point I basically go catatonic. I can't think or speak or move properly. I had to leave. My problem is.... I didn't want to leave. I just want to be well enough to work.  I actually quite like my job.  I have good benefits, I love the clothes, I like looking at the stats and figuring out where our strengths and weaknesses lie and planning out pathways to successes... I am so ashamed.  I don't want to call in. I don t want to go home sick. I just want my body to stay okay enough to get through a 40 hour work week. How do you deal with this? Have any of you guys got tips on how to keep a job? Or how do you worl from home? My brain feels all tangled.  And painful. I sad.",
        "created_utc": 1558652462,
        "label": [
            "0"
        ]
    },
    "bujy37": {
        "title": "Permanent old person hands",
        "body": "I have always had very old looking hands. Ever since I was a little kid. My mom and sister both have them too, but I am the one with the worst raynauds. I am currently working with some doctors to identify the root cause of all my garbage body issues, mainly investigating EDS and Lupus. Anyone here have primary or secondary raynauds with old looking hands??? Even though it's almost June (and finally getting warm in ottawa) I am still having daily / multiple times a day flare ups.",
        "created_utc": 1559162769,
        "label": [
            "0"
        ]
    },
    "bx3kcx": {
        "title": "Health frustrations. Fear.",
        "body": "Everything makes me feel sick. My insides are killing me. I'm so tired. I'm scared to eat. The feeling of being empty feels better than the panic and nausea I get if I eat or drink. I don't know how I'm gonna get through this time. Previously I was young enough to be living with my parents and be helped by them. Now I have rent to pay. I have a full time job. But I have to survive. How can I make money and not have to eat?? Fuck. I really wish I could just inject calories and energy into myself and not have to eat. It hurts. It physically hurts. And I feel so sick. I'm pretty sure that I've got gastroparesis or something... I've been having bouts of not being able to eat without nausea and pain for most of my life. My bowel doesn't work for weeks at a time. I have to take something for that. When I am able to go, the pain is insane. I almost passed out last night. My lips are tingling. My sides hurt. I never am able to throw up. It just feels awful for days at a time until my stomach finally gurgles and I feel it start to drain. I've had to press on my abdomen and manually move things around for relief. I am so tired. I am so nauseous. I am so scared. I don't want to die. But when I go to the doctor, \"nothing is causing it.\" I've never been tested for gastroparesis, looking back on it,  I have no fucking clue why. They did a barrium swallow and tilt test. They did an endoscopy and took tissue samples. But never bothered to connect my nausea and chronic constipation and difficulty swallowing. I didn't know gastroparesis was a thing until about a year ago. Maybe that's why I've had trouble swallowing pills and food??? For fucks sake. Doctors are so quick to say that you're paranoid. I am in real genuine pain. I have missed out on SO MUCH OF MY LIFE being sick. I've been judged by teachers and shunned by friends. I've had employers tell me that my illness is really inconvenient for them. Like. If you think it's annoying for you... stop and think. How the fuck do you think I feel???? I WANT to work. I WANT to be able to go to work and feel 100% okay. My pain and suffering is inconvenient for you? Fucking really? I am so tired. I almost want to just give up. May as well just let myself starve. Uh oh. But then they'll call me anorexic! Middle school flashbacks. Nothing is more confusing as a young teen than having the guidance counsellor tell you that you have an eating disorder when you don't. I want to eat. I really do. It's just not worth what I feel like afterwards.",
        "created_utc": 1559746953,
        "label": [
            "0"
        ]
    },
    "c3gmdg": {
        "title": "That feeling when your stomach finally starts to empty after 18 hours of constant moderate nausea",
        "body": "It's like a breath of fresh air.",
        "created_utc": 1561151971,
        "label": [
            "0"
        ]
    },
    "ctkc05": {
        "title": "The pulling feeling",
        "body": "Anyone else know what I'm talking about when I describe the awful pulling feeling of your stomach trying to empty, but failing? I am no anatomy expert but that's what it feels like. Like the right muscles are contracting but the sphincter isn't opening to let the contents drain. Or the feeling of pure adrenaline in your gastro tract? Like it's hot and cold and inflamed all at once? It literally feels like a panic attack. Numb and cold and hot and tingly. Only in your stomach and intestines. I had to call off work today for the first time in a while.... feeling guilty about it. Now I'm rambling. Anyway hope you guys are doing okay here all things considered. ♡",
        "created_utc": 1566409737,
        "label": [
            "0"
        ]
    },
    "d2pk4z": {
        "title": "DAE suddenly smell something weird and unique if they hit their head?",
        "body": "This has always happened to me but it only occurred to me recently that it might not be normal. It's the same smell every time, but only if I hit my head do I smell it. I also don't have to actually inhale... the smell is just suddenly there in my sinus.",
        "created_utc": 1568205832,
        "label": [
            "0"
        ]
    },
    "daqun9": {
        "title": "Sometimes I forget where I am.",
        "body": "Mostly when I'm in bed. I'll have moments when I think I'm back at my parents house in my childhood bedroom. Moments  where I think I'm in one of my old apartments. I'll open my eyes and be surprised by what my environment is. It's scary.",
        "created_utc": 1569732938,
        "label": [
            "0"
        ]
    },
    "dgmdc9": {
        "title": "I am just... so.... tired.",
        "body": "I feel like a lump. My health is garbage in new ways (new development- on top of the joint pain, my dexterity is worse and now my LEGS dont work properly. Partial numbness and trouble moving them. And pain. Also chest pain. And feeling like a golf ball is lodged in my throat.) My grandmother just died a few days ago.... my sister is severely mentally ill and suicidal... I am so worried about my parents handling her along with the death of my mother's mom... And on top of it All, work became 100 per cent more hectic as one of our core staff members was fired. And I trusted her. I tried to help her succeed in her job but she fucking fucked it up for herself. I feel disillusioned. I know she was just a co worker. But she was so nice. And we all trusted her. Now she has a criminal record forever. Like.... It wasn't worth it. \nAlso. I can't see my own worth. At all. Like. I do something like put a new set up together at work and I think it looks like garbage and no one else sees it. I clean the apartment and I see no difference but my boyfriend says I did a good job. My parents say they're proud of me. But I don't have a social life. I don't have friends at all. I have a boyfriend and a cat. I don't know what I'd do without them. I wish sometimes that no one cares about me so that I could just disappear. I don't want to die because I'm scared of what happens after. What will my family or boyfriend or cat or workplace do if I die? My sister would absolutely lose her mind. My parents likely wouldn't be far behind her. My cat would meow at my boyfriend asking where I went. My boyfriend would lose himself in fantasy games and probably go after a vice like drugs or alcohol to distract himself. And even saying all that... why do I think people would fall apart without me? Do I think THAT highly of myself? I am caught between being a self hating sad sack and a self centred narcissist. Any comments or messages are appreciated. I don't like feeling alone. But I always feel alone. Any sort of human reach out would be appreciated.",
        "created_utc": 1570833064,
        "label": [
            "0"
        ]
    },
    "drrnbd": {
        "title": "I've had a steady diet of broth and coffee the last few days",
        "body": "Aaaand I tried to add some calories in with my soup the other day. A minced small potato.  NOT EVEN THAT CAN GO INTO MY BOD WITHOUT NAUSEA.  \n\nNot cool body, not cool. \n\nI don't vomit.  Ever.  I just get to suffer.  Yay me. \n \nBack to broth and liquid calories.",
        "created_utc": 1572916236,
        "label": [
            "0"
        ]
    },
    "dxwehi": {
        "title": "Nail polish helps keep my hands warm??",
        "body": "So I'm not good at regulating body  temperatures. In the summer i don't like polish because I feel all swollen and sweaty. In the winter my hands are noticeably warmer while wearing nail polish (inside anyway.). Anyone else notice This?? Or am I just way too sensitive?",
        "created_utc": 1574042125,
        "label": [
            "0"
        ]
    },
    "elx6x4": {
        "title": "This might be a reality",
        "body": "I have kind of lost hope. I am in physical pain all the time. I am in mental pain all the time. I don't have any friends. I no longer have a romantic partner. My family keeps pushing the whole \"just be positive\" bullshit. I never thought I would get tossed aside like that. I am so disillusioned. I feel like he was playing a joke on me. He said he didn't love me for a long time. I feel like this (killing myself) is becoming a very real possibility. Club 27 here I come. Just with out the fame money or adoration.",
        "created_utc": 1578510415,
        "label": [
            "0"
        ]
    },
    "fh0egv": {
        "title": "Please give me some input eds folks!",
        "body": "So I finally have an appointment at the eds clinic in Toronto. It's been over a year since I was officially referred. I am curious... has anyone gone through this journey without an official diagnosis? My mom and dad still don't believe me. They say things like \"just eat better and exercise\". Even though I do work out 2-5 days a week depending on how I feel, and even though I eat a supplement supported plant based diet....but that's a whole other issue. Regardless of wether I come out with genetic testing or a diagnosis of hEds... has anyone ever been sent away being told that they're really fine? That it was all for nothing?",
        "created_utc": 1583946065,
        "label": [
            "0"
        ]
    },
    "fvfvpj": {
        "title": "Impossible to be sober in a house where everyone drinks.",
        "body": "I had to move back in with my parents after a bad break up. I didn't drink for almost a year. Last night I drank 375 ml of whisky. I am trying not to blame myself or them. That's hard. With the pandemic situation no one can really go out or do anything. I'm drinking out if boredom and anxiety.",
        "created_utc": 1586101894,
        "label": [
            "0"
        ]
    },
    "g3nbyx": {
        "title": "Subluxing in my sleep...?",
        "body": "So sometimes I wake up with horrifying pain in my hips. To the point where I can barely walk.  Any sort of pressure (like from lying on my side or walking) makes it hurt more. This has happened several times, mostly within the last year.  I want to know if anyone has had this happen to them (or even something similar). I don't know how the heck I slept to have this happen. Usually the pain lasts for a day or two. Today is my day two.",
        "created_utc": 1587215719,
        "label": [
            "0"
        ]
    },
    "gq5fl7": {
        "title": "Quarentine is really fucking me up",
        "body": "I was finally developing a good relationship with food and exercise. Quarentine caused my gym to close and I can't find the motivation to work out in my house (everything I do gets commented on. ). \nI am so sad. And so fat. I gained all of the weight I lost back and then more. I don't even know how that could happen seeing as I really don't eat much at all and drink over 2 litres of water a day, and still manage to get around 10k steps every day. My stomach is huge. I look 6 months pregnant. I have rolls on my BACK when standing up straight. I don't know what to do. I'm so confused and angry and sad.",
        "created_utc": 1590385875,
        "label": [
            "0"
        ]
    },
    "h8jvgv": {
        "title": "Anyone else have days where their joints are extra LOUD? just.... constant loud cracking. Non stop.",
        "body": "",
        "created_utc": 1592096106,
        "label": [
            "0"
        ]
    },
    "hdarl1": {
        "title": "Constipation from ondansetron/zofran",
        "body": "I try not to take my ondansetron (for nausea) very often. However, the last two weeks I was feeling eeexxtra gross and took it almost every day. I am now less nauseous, but very backed up. I'm having painful cramps (like diarrhea cramps or period cramps) and stabby bad pain like I get before I go.... only I'm not going. Has anyone figured out how to counter the constipation caused by nausea meds?? I've taken polyethylene glycol (generic restoralax) every morning, as well as having senna tea before bed... I eat vegan, and most of the time my diet it high in fiber (hummus is everything) and liquids... I drink near 2 litres of water a day... kombucha.... what else can I do? I feel like my intestines are just.... solid.",
        "created_utc": 1592760434,
        "label": [
            "0"
        ]
    },
    "iutdez": {
        "title": "I don't want to do anything",
        "body": "I feel useless. Im in bed at 6pm on a Thursday. It's beautiful outside. I don't want to do anything. I have games to play and books to read and art to work on.  I could go to the gym. Or go for a walk. But I don't think I can get out of bed.",
        "created_utc": 1600379850,
        "label": [
            "0"
        ]
    },
    "j7or49": {
        "title": "Cat proof yoga mat",
        "body": "[removed]",
        "created_utc": 1602202252,
        "label": [
            "0"
        ]
    },
    "jr0hjf": {
        "title": "i wish i knew what it felt like to be truly happy and optimistic. then at least i would have something to strive for.",
        "body": "i am really really tired of keeping on. the last two years have just been one big dull nightmare that i can't wake up from.",
        "created_utc": 1604938477,
        "label": [
            "0"
        ]
    },
    "jrw570": {
        "title": "Salt to ease constant nausea",
        "body": "Anyone else just.... eat tiny bits of salt to combat the nausea? I don't know why it helps.... but it does.  Maybe because i'm tricking my body into thinking it's eating,  but I don't have to deal with food in my belly.",
        "created_utc": 1605050398,
        "label": [
            "0"
        ]
    },
    "ju6n7s": {
        "title": "Bloated from water.",
        "body": "anyone else have stupid gut reactions? Like. I'll wake up and have a flat stomach. Then I'll drink a GLASS OF WATER. 20 minutes later I look 5 months pregnant. It's really depressing. I don't wanna do anything because my body looks like shit.",
        "created_utc": 1605378571,
        "label": [
            "0"
        ]
    },
    "kttcfz": {
        "title": "Rose out of drag reminds me of.....",
        "body": "[removed]",
        "created_utc": 1610207885,
        "label": [
            "0"
        ]
    },
    "kttfpy": {
        "title": "I already love all the queens of season 13. BUT I HAVE A PROBLEM.",
        "body": "Much like in season 11, in my \"shuga cain... CHOCOLATE RAIN?!' post, there is another striking resemblance.  Rose out of drag..... looks like onion boy. im sorry.",
        "created_utc": 1610208163,
        "label": [
            "0"
        ]
    },
    "lfhsig": {
        "title": "Does anyone else have these?",
        "body": "So I often get migraines, I have chronic headaches that last weeks, and there's something else that I've come to call \"rapid progression migraine.\" Starts slowly like a regular annoying headache. Then, Over the course of like... one or two hours it goes from regular headache to bad headache to \"ok I guess this is gonna be a migraine\"... more symptoms rapidly pile up and then it peaks (pain and other symptoms). The peak doesnt last long. Usually like 30 mins to an hour.... I cant walk or talk or move... if I try to talk it's just... gibberish... then it rapidly gets better and is back to a medium headache.  Is this just a regular migraine?? Or does it sound more like mini strokes? I've had an MRI (without dye - i think that was a mistake because I have major circulation issues and suspected heds) within the last 2 years where they didnt see anything abnormal, but that was before I started having these attacks as often as I have them now.  Does anyone else here experience these rapid progression attacks??",
        "created_utc": 1612807756,
        "label": [
            "0"
        ]
    },
    "lsn759": {
        "title": "Just another post.",
        "body": "Turned 28 today. I don't want to keep going. Ive felt like a ghost for years. Even when I make friends I feel like I don't have friends. People caring about me always feels fake or forced. I can't fathom someone actually giving a shit about me.  I'm nothing but a second thought. Just a ghost in a forgotten house. I feel like i'm not supposed to be here. I wish I didn't feel like this. I wish I didn't want to disappear. I don't want to die. I just want to stop existing. Covid, health issues, and a late 2019 break up all just made me more stuck. being still makes me feel like im fading, but i'm so tired that I don't have the will to move.",
        "created_utc": 1614305324,
        "label": [
            "0"
        ]
    },
    "m63a2q": {
        "title": "Misophonia.",
        "body": "I cant be around my dad. He does this sucking thing because of dry mouth hundreds of times a day - it makes me feel like I am being violated and makes my physically angry, frustrated and shameful. Hearing mouth smacking and sucking noises makes me feel like I am being molested. Always has. Dont know why. I wasnt molested as a child. All I know is that I am unable to function in this house without headphones in unless I am hone alone. This shit makes me want to cry and throw things. I literally think I am going to have to move out. My dad thinks I hate him. I dont hate him at all. I've explained maaany times that misophonia is a real thing and maybe he could not open and close his mouth (like hes tasting wine) for no reason. Or not suck his teeth 7 times in as many seconds. But he just gets mad when I bring it up.  I am in bed trying to sleep. Ive actually cried a few times tonight because I cant relax enough to fall asleep. Its 3 am but I am on fucking high alert in anticipation of another stressful interaction.  I need to move out. I want to hear silence and not smacking and sucking coming from another room or floor (yes it's that loud.)",
        "created_utc": 1615878641,
        "label": [
            "0"
        ]
    },
    "mtndv5": {
        "title": "Brain-gut axis dysfunction. Halp!",
        "body": "So the last two ish years my chronic and episodic digestive issues have gotten pretty significantly worse. I thought I might have gastroparesis, and honestly I still do.... but i had been doing better on a very specific diet, and when i finally went to see the gastroenterologist, I was overly positive. Also brain fog made me forget to ask about a gastric emptying test or swallow test. She said what I'm dealing with is a textbook case of brain gut axis dysfunction- a neurological condition that is (as she put it) \"cousins\" with migraine (which I have), and is connected to the autonomic nervous system (might have some sort of dysautonomia). Have any of you guys here been told you have brain-gut axis dysfunction? And do any of your symptoms go way up and down?? Because sometimes I pass something 3 hours after I eat it (mostly -entirely undigested) and sometimes I dont feel the urge to go for a week even if I know I'm literally full of shit. The same stop and go happens with my stomach and small intestine too. It's like... my entire gi tract is playing red light green light.",
        "created_utc": 1618785921,
        "label": [
            "0"
        ]
    },
    "myt33j": {
        "title": "DAE get hiccups when they quickly go from lying down to standing??",
        "body": "Title says it all.  Not every time,  but often enough for me to notice it as a thing that my body does now. Started happening about 1.5 years ago.",
        "created_utc": 1619426415,
        "label": [
            "0"
        ]
    },
    "n6bwkw": {
        "title": "QUESTION! I am being evaluated for mcas and...",
        "body": "...and I have to get a couple rounds of blood work done when I am, and am not reactive. Because this blood test isnt covered by Ohip it cost me like...250 bucks I think. \n\nSo I had it done once when I thought I was reactive (spell of nausea and exhaustion, not rashy) and those results came back normal. Now I am rashy. Small rashes all over, but I dont know if it's bad enough to spend money on in case this is just dry skin. \n\nSooo I doubt it's just dry skin because I exfoliate and moisturize really consistantly (pure sweet almond oil right out of the shower on wet skin does wonders). Also a few moles that are usually flat are raised (sometimes they get big and itchy). Also also I'm nauseous and exhausted. \n\nMy question is - how likely is it, do you think, that this reaction will show up on blood work? I am not in a full body rash, but I am itchy everywhere with spotty rashes and generally feeling shitty. Any and all opinions are appreciated 💖",
        "created_utc": 1620320166,
        "label": [
            "0"
        ]
    },
    "pdzuz7": {
        "title": "No friends.",
        "body": "I don't really have friends. And when people start to become friends with me I distance myself. It's almost like I don't want people to care about me so that if I  ever decide to \"log off\" permanently, the damage will be minimal. I don't want to be alive but ugh the thought of the trouble ot would cause for me to burden people with my corpse? I don't want to do that. I just wish I cared more and less at the same time. I wish I was younger. I wish I didn't have so many scars. I wish I would stop having nightmares about my abuser. And rape. And human meat. Seeing death and gore in your sleep really fucks you up. Anyway. I'm just rambling. Back to cleaning my room. Love you bye 👋",
        "created_utc": 1630258896,
        "label": [
            "0"
        ]
    },
    "pi2pu5": {
        "title": "Teeth of a bulimic",
        "body": "I literally haven't actually vomited since I was 5. I have really bad splash back /ooze up. My teeth ate awful especially in the back. My mouth always tastes sour and bitter.  My insides hurt. Anyone else struggle with their teeth??? I hate being shamed by dentists. Yes I brush and floss. My stomach acid just is constantly popping up to say \"hey whats up\"",
        "created_utc": 1630800788,
        "label": [
            "0"
        ]
    }
}